[Killed] BlockStatement
src/offlineQueue.ts:74:58
   quarantine: string;
 }
 
-function scopeId(origin: string, userId: string): string {
-  // AsyncStorage keys are observable metadata, so avoid putting a readable
-  // username or host in them. This is an identifier, not cryptographic
-  // secrecy; ciphertext remains encrypted independently.
-  return Buffer.from(`${origin}\u0000${userId}`, "utf8").toString("base64url");
-}
+function scopeId(origin: string, userId: string): string {}
 
 async function scopeFor(userId: string): Promise<QueueScope> {
killedBy: queue regression pins makes a validation future-date response retryable, without uploading it to another origin
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/offlineQueue.ts:81:62
   return Buffer.from(`${origin}\u0000${userId}`, "utf8").toString("base64url");
 }
 
-async function scopeFor(userId: string): Promise<QueueScope> {
-  if (!userId) throw new Error("cannot access an offline queue without an account id");
-  // `getBaseUrl` is always present in production. The fallback makes this
-  // module usable by old isolated test mocks while retaining a safe concrete
-  // local-only origin there.
-  const base = typeof getBaseUrl === "function" ? await getBaseUrl() : "http://localhost:8000";
-  const origin = new URL(base).origin;
-  const id = scopeId(origin, userId);
-  return {
-    origin,
-    userId,
-    queue: `${STORAGE_PREFIX}.items.${id}`,
-    rejected: `${STORAGE_PREFIX}.rejected.${id}`,
-    quarantine: `${STORAGE_PREFIX}.quarantine.${id}`,
-  };
-}
+async function scopeFor(userId: string): Promise<QueueScope> {}
 
 /** Transitional convenience for callers from pre-v2 queue APIs. Runtime
killedBy: queue regression pins does not make a 409 duplicate into a rejected recovery item
statusReason: Cannot read properties of undefined (reading 'queue')

[Killed] BooleanLiteral
src/offlineQueue.ts:82:7
 }
 
 async function scopeFor(userId: string): Promise<QueueScope> {
-  if (!userId) throw new Error("cannot access an offline queue without an account id");
+  if (userId) throw new Error("cannot access an offline queue without an account id");
   // `getBaseUrl` is always present in production. The fallback makes this
   // module usable by old isolated test mocks while retaining a safe concrete
killedBy: queue regression pins does not make a 409 duplicate into a rejected recovery item
statusReason: cannot access an offline queue without an account id

[Killed] ConditionalExpression
src/offlineQueue.ts:86:16
   // `getBaseUrl` is always present in production. The fallback makes this
   // module usable by old isolated test mocks while retaining a safe concrete
   // local-only origin there.
-  const base = typeof getBaseUrl === "function" ? await getBaseUrl() : "http://localhost:8000";
+  const base = false ? await getBaseUrl() : "http://localhost:8000";
   const origin = new URL(base).origin;
   const id = scopeId(origin, userId);
killedBy: offline queue scope does not expose or upload pending ciphertext after an origin change
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ObjectLiteral
src/offlineQueue.ts:89:10
   const base = typeof getBaseUrl === "function" ? await getBaseUrl() : "http://localhost:8000";
   const origin = new URL(base).origin;
   const id = scopeId(origin, userId);
-  return {
-    origin,
-    userId,
-    queue: `${STORAGE_PREFIX}.items.${id}`,
-    rejected: `${STORAGE_PREFIX}.rejected.${id}`,
-    quarantine: `${STORAGE_PREFIX}.quarantine.${id}`,
-  };
+  return {};
 }
 
killedBy: offline queue scope uses physically separate origin/account stores and never uploads a foreign scope
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Survived] StringLiteral
src/offlineQueue.ts:93:15
     origin,
     userId,
     queue: `${STORAGE_PREFIX}.items.${id}`,
-    rejected: `${STORAGE_PREFIX}.rejected.${id}`,
+    rejected: ``,
     quarantine: `${STORAGE_PREFIX}.quarantine.${id}`,
   };

[Killed] ConditionalExpression
src/offlineQueue.ts:116:7
  * opaque retained record after the owner identifies the original server.
  */
 async function migrateUnscopedLegacyData(): Promise<void> {
-  if (legacyMigration) return legacyMigration;
+  if (true) return legacyMigration;
   legacyMigration = (async () => {
     const entries = await Promise.all(
killedBy: offline queue durability preserves pre-v2 global bytes without assigning them to the current server
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/offlineQueue.ts:116:7
  * opaque retained record after the owner identifies the original server.
  */
 async function migrateUnscopedLegacyData(): Promise<void> {
-  if (legacyMigration) return legacyMigration;
+  if (false) return legacyMigration;
   legacyMigration = (async () => {
     const entries = await Promise.all(

[Killed] LogicalOperator
src/offlineQueue.ts:121:83
     const entries = await Promise.all(
       [LEGACY_QUEUE_KEY, LEGACY_REJECTED_KEY, LEGACY_QUARANTINE_KEY].map(async (key) => [key, await AsyncStorage.getItem(key)] as const),
     );
-    const records = entries.filter((entry): entry is readonly [string, string] => entry[1] !== null && entry[1] !== "");
+    const records = entries.filter((entry): entry is readonly [string, string] => entry[1] !== null || entry[1] !== "");
     if (records.length === 0) return;
     const previous = await AsyncStorage.getItem(LEGACY_RECOVERY_KEY);
killedBy: offline queue durability enforces a per-scope capacity and preserves every existing ciphertext
statusReason: Invalid string length

[Killed] EqualityOperator
src/offlineQueue.ts:122:9
       [LEGACY_QUEUE_KEY, LEGACY_REJECTED_KEY, LEGACY_QUARANTINE_KEY].map(async (key) => [key, await AsyncStorage.getItem(key)] as const),
     );
     const records = entries.filter((entry): entry is readonly [string, string] => entry[1] !== null && entry[1] !== "");
-    if (records.length === 0) return;
+    if (records.length !== 0) return;
     const previous = await AsyncStorage.getItem(LEGACY_RECOVERY_KEY);
     const envelope = {
killedBy: offline queue durability preserves pre-v2 global bytes without assigning them to the current server
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/offlineQueue.ts:143:10
 }
 
 function wipedSince(generation: number): boolean {
-  return queueGeneration !== generation;
+  return queueGeneration === generation;
 }
 
killedBy: offline queue scope uses physically separate origin/account stores and never uploads a foreign scope
statusReason: the queue was cleared while saving — the entry was NOT queued

[Killed] EqualityOperator
src/offlineQueue.ts:150:5
   if (typeof raw !== "object" || raw === null) return null;
   const item = raw as Record<string, unknown>;
   if (
-    typeof item.userId !== "string" ||
+    typeof item.userId === "string" ||
     typeof item.clientEntryId !== "string" ||
     typeof item.blobB64 !== "string" ||
killedBy: offline queue scope uses physically separate origin/account stores and never uploads a foreign scope
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/offlineQueue.ts:150:5
   if (typeof raw !== "object" || raw === null) return null;
   const item = raw as Record<string, unknown>;
   if (
-    typeof item.userId !== "string" ||
-    typeof item.clientEntryId !== "string" ||
-    typeof item.blobB64 !== "string" ||
-    typeof item.entryDate !== "string"
+    true
   ) {
     return null;
killedBy: offline queue scope uses physically separate origin/account stores and never uploads a foreign scope
statusReason: expected +0 to be 1 // Object.is equality

[Survived] EqualityOperator
src/offlineQueue.ts:163:7
     blobB64: item.blobB64,
     entryDate: item.entryDate,
   };
-  if (typeof item.attempts === "number" && Number.isFinite(item.attempts)) normalized.attempts = item.attempts;
+  if (typeof item.attempts !== "number" && Number.isFinite(item.attempts)) normalized.attempts = item.attempts;
   if (typeof item.notBefore === "number" && Number.isFinite(item.notBefore)) normalized.notBefore = item.notBefore;
   return normalized;

[Killed] ConditionalExpression
src/offlineQueue.ts:172:7
   const parsed: unknown = JSON.parse(raw);
   const slots = Array.isArray(parsed)
     ? parsed
-    : typeof parsed === "object" && parsed !== null && (parsed as { v?: unknown }).v === 1
+    : false
       ? (parsed as { items?: unknown }).items
       : null;
killedBy: queue regression pins keeps a non-validation 422 terminal even when its message says future
statusReason: expected [] to deeply equal [ 'bad' ]

[Killed] ConditionalExpression
src/offlineQueue.ts:176:76
       ? (parsed as { items?: unknown }).items
       : null;
   if (!Array.isArray(slots)) return null;
-  return slots.map(normalizeEntry).filter((entry): entry is QueuedEntry => entry !== null);
+  return slots.map(normalizeEntry).filter((entry): entry is QueuedEntry => false);
 }
 
killedBy: offline queue scope uses physically separate origin/account stores and never uploads a foreign scope
statusReason: expected +0 to be 1 // Object.is equality

[NoCoverage] LogicalOperator
src/offlineQueue.ts:190:14
   const records = previous ? (() => {
     try {
       const parsed = JSON.parse(previous) as { v?: unknown; records?: unknown };
-      return parsed.v === 1 && Array.isArray(parsed.records) ? parsed.records.filter((x): x is string => typeof x === "string") : [previous];
+      return parsed.v === 1 || Array.isArray(parsed.records) ? parsed.records.filter((x): x is string => typeof x === "string") : [previous];
     } catch {
       return [previous];

[NoCoverage] EqualityOperator
src/offlineQueue.ts:190:14
   const records = previous ? (() => {
     try {
       const parsed = JSON.parse(previous) as { v?: unknown; records?: unknown };
-      return parsed.v === 1 && Array.isArray(parsed.records) ? parsed.records.filter((x): x is string => typeof x === "string") : [previous];
+      return parsed.v !== 1 && Array.isArray(parsed.records) ? parsed.records.filter((x): x is string => typeof x === "string") : [previous];
     } catch {
       return [previous];

[Killed] BlockStatement
src/offlineQueue.ts:199:102
   await AsyncStorage.setItem(scope.quarantine, JSON.stringify({ v: 1, records }));
 }
 
-async function readItems(key: string, scope: QueueScope, generation: number): Promise<QueuedEntry[]> {
-  const raw = await AsyncStorage.getItem(key);
-  if (!raw) return [];
-  try {
-    const parsed = parseItems(raw);
-    // A parseable but unrecognized shape is retained untouched for manual
-    // repair; treating it as an empty queue cannot cause cross-account data
-    // disclosure.
-    if (parsed === null) return [];
-    return parsed.filter((item) => item.userId === scope.userId);
-  } catch {
-    await appendQuarantine(scope, raw, generation);
-    if (!wipedSince(generation)) await AsyncStorage.removeItem(key);
-    return [];
-  }
-}
+async function readItems(key: string, scope: QueueScope, generation: number): Promise<QueuedEntry[]> {}
 
 async function writeItems(key: string, items: QueuedEntry[]): Promise<void> {
killedBy: queue regression pins does not make a 409 duplicate into a rejected recovery item
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BooleanLiteral
src/offlineQueue.ts:201:7
 
 async function readItems(key: string, scope: QueueScope, generation: number): Promise<QueuedEntry[]> {
   const raw = await AsyncStorage.getItem(key);
-  if (!raw) return [];
+  if (raw) return [];
   try {
     const parsed = parseItems(raw);
killedBy: queue regression pins keeps a non-validation 422 terminal even when its message says future
statusReason: expected [] to deeply equal [ 'bad' ]

[Killed] BlockStatement
src/offlineQueue.ts:202:7
 async function readItems(key: string, scope: QueueScope, generation: number): Promise<QueuedEntry[]> {
   const raw = await AsyncStorage.getItem(key);
   if (!raw) return [];
-  try {
-    const parsed = parseItems(raw);
-    // A parseable but unrecognized shape is retained untouched for manual
-    // repair; treating it as an empty queue cannot cause cross-account data
-    // disclosure.
-    if (parsed === null) return [];
-    return parsed.filter((item) => item.userId === scope.userId);
-  } catch {
+  try {} catch {
     await appendQuarantine(scope, raw, generation);
     if (!wipedSince(generation)) await AsyncStorage.removeItem(key);
killedBy: offline queue scope uses physically separate origin/account stores and never uploads a foreign scope
statusReason: Cannot read properties of undefined (reading 'find')

[Killed] ConditionalExpression
src/offlineQueue.ts:207:9
     // A parseable but unrecognized shape is retained untouched for manual
     // repair; treating it as an empty queue cannot cause cross-account data
     // disclosure.
-    if (parsed === null) return [];
+    if (true) return [];
     return parsed.filter((item) => item.userId === scope.userId);
   } catch {
killedBy: offline queue scope uses physically separate origin/account stores and never uploads a foreign scope
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/offlineQueue.ts:207:9
     // A parseable but unrecognized shape is retained untouched for manual
     // repair; treating it as an empty queue cannot cause cross-account data
     // disclosure.
-    if (parsed === null) return [];
+    if (parsed !== null) return [];
     return parsed.filter((item) => item.userId === scope.userId);
   } catch {
killedBy: offline queue scope uses physically separate origin/account stores and never uploads a foreign scope
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArrowFunction
src/offlineQueue.ts:208:26
     // repair; treating it as an empty queue cannot cause cross-account data
     // disclosure.
     if (parsed === null) return [];
-    return parsed.filter((item) => item.userId === scope.userId);
+    return parsed.filter(() => undefined);
   } catch {
     await appendQuarantine(scope, raw, generation);
killedBy: offline queue scope uses physically separate origin/account stores and never uploads a foreign scope
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/offlineQueue.ts:208:36
     // repair; treating it as an empty queue cannot cause cross-account data
     // disclosure.
     if (parsed === null) return [];
-    return parsed.filter((item) => item.userId === scope.userId);
+    return parsed.filter((item) => item.userId !== scope.userId);
   } catch {
     await appendQuarantine(scope, raw, generation);
killedBy: offline queue scope uses physically separate origin/account stores and never uploads a foreign scope
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ConditionalExpression
src/offlineQueue.ts:211:9
     return parsed.filter((item) => item.userId === scope.userId);
   } catch {
     await appendQuarantine(scope, raw, generation);
-    if (!wipedSince(generation)) await AsyncStorage.removeItem(key);
+    if (true) await AsyncStorage.removeItem(key);
     return [];
   }

[Killed] ArrayDeclaration
src/offlineQueue.ts:212:12
   } catch {
     await appendQuarantine(scope, raw, generation);
     if (!wipedSince(generation)) await AsyncStorage.removeItem(key);
-    return [];
+    return ["Stryker was here"];
   }
 }
killedBy: offline queue durability quarantines corrupt data in the current scope without touching another scope
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
src/offlineQueue.ts:217:7
 }
 
 async function writeItems(key: string, items: QueuedEntry[]): Promise<void> {
-  if (items.length === 0) {
+  if (items.length !== 0) {
     await AsyncStorage.removeItem(key);
   } else {
killedBy: offline queue scope uses physically separate origin/account stores and never uploads a foreign scope
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/offlineQueue.ts:228:107
   return readItems(scope.rejected, scope, generation);
 }
 
-async function appendRejected(scope: QueueScope, items: QueuedEntry[], generation: number): Promise<void> {
-  if (items.length === 0 || wipedSince(generation)) return;
-  const existing = await rejectedFor(scope, generation);
-  if (wipedSince(generation)) return;
-  const ids = new Set(existing.map((item) => item.clientEntryId));
-  for (const item of items) {
-    if (!ids.has(item.clientEntryId)) {
-      existing.push(item);
-      ids.add(item.clientEntryId);
-    }
-  }
-  if (!wipedSince(generation)) await writeItems(scope.rejected, existing);
-}
+async function appendRejected(scope: QueueScope, items: QueuedEntry[], generation: number): Promise<void> {}
 
 export async function quarantinedQueueExists(userId?: string): Promise<boolean> {
killedBy: offline queue scope keeps rejected recovery scoped to the same account and origin
statusReason: expected [] to deeply equal [ 'a-rejected' ]

[Killed] ConditionalExpression
src/offlineQueue.ts:229:7
 }
 
 async function appendRejected(scope: QueueScope, items: QueuedEntry[], generation: number): Promise<void> {
-  if (items.length === 0 || wipedSince(generation)) return;
+  if (true) return;
   const existing = await rejectedFor(scope, generation);
   if (wipedSince(generation)) return;
killedBy: offline queue scope keeps rejected recovery scoped to the same account and origin
statusReason: expected [] to deeply equal [ 'a-rejected' ]

[Killed] EqualityOperator
src/offlineQueue.ts:229:7
 }
 
 async function appendRejected(scope: QueueScope, items: QueuedEntry[], generation: number): Promise<void> {
-  if (items.length === 0 || wipedSince(generation)) return;
+  if (items.length !== 0 || wipedSince(generation)) return;
   const existing = await rejectedFor(scope, generation);
   if (wipedSince(generation)) return;
killedBy: offline queue scope keeps rejected recovery scoped to the same account and origin
statusReason: expected [] to deeply equal [ 'a-rejected' ]

[Killed] BooleanLiteral
src/offlineQueue.ts:234:9
   if (wipedSince(generation)) return;
   const ids = new Set(existing.map((item) => item.clientEntryId));
   for (const item of items) {
-    if (!ids.has(item.clientEntryId)) {
+    if (ids.has(item.clientEntryId)) {
       existing.push(item);
       ids.add(item.clientEntryId);
killedBy: offline queue scope keeps rejected recovery scoped to the same account and origin
statusReason: expected [] to deeply equal [ 'a-rejected' ]

[Killed] ConditionalExpression
src/offlineQueue.ts:265:9
     const generation = queueGeneration;
     const queue = await readItems(scope.queue, scope, generation);
     if (wipedSince(generation)) throw new QueueAbandonedError();
-    if (queue.length >= MAX_QUEUE_LENGTH) throw new QueueFullError();
+    if (true) throw new QueueFullError();
     // Scope owns the account id. Normalize it from the caller so a tampered
     // record cannot poison another account's queue key.
killedBy: offline queue scope uses physically separate origin/account stores and never uploads a foreign scope
statusReason: offline queue is full (200 entries) — sync before writing more

[Timeout] BlockStatement
src/offlineQueue.ts:274:49
   });
 }
 
-function retryDelayMs(attempts: number): number {
-  const exponential = Math.min(RETRY_MAX_MS, RETRY_BASE_MS * 2 ** Math.min(attempts, 10));
-  return Math.floor(exponential / 2 + Math.random() * (exponential / 2));
-}
+function retryDelayMs(attempts: number): number {}
 
 type FlushOutcome =

[Killed] ArithmeticOperator
src/offlineQueue.ts:276:21
 
 function retryDelayMs(attempts: number): number {
   const exponential = Math.min(RETRY_MAX_MS, RETRY_BASE_MS * 2 ** Math.min(attempts, 10));
-  return Math.floor(exponential / 2 + Math.random() * (exponential / 2));
+  return Math.floor(exponential * 2 + Math.random() * (exponential / 2));
 }
 
killedBy: flushQueueOnReconnect flushes again once the throttle window has passed
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Survived] ArithmeticOperator
src/offlineQueue.ts:276:21
 
 function retryDelayMs(attempts: number): number {
   const exponential = Math.min(RETRY_MAX_MS, RETRY_BASE_MS * 2 ** Math.min(attempts, 10));
-  return Math.floor(exponential / 2 + Math.random() * (exponential / 2));
+  return Math.floor(exponential / 2 - Math.random() * (exponential / 2));
 }
 

[Killed] ConditionalExpression
src/offlineQueue.ts:288:11
   | { kind: "retry"; retryAfterMs?: number; stop: boolean };
 
 function isFutureDateRejection(error: ApiError): boolean {
-  return (error.code === undefined || error.code === "validation_error") && /future/i.test(error.message);
+  return (true) && /future/i.test(error.message);
 }
 
killedBy: queue regression pins keeps a non-validation 422 terminal even when its message says future
statusReason: expected [] to deeply equal [ 'bad' ]

[Killed] ConditionalExpression
src/offlineQueue.ts:288:10
   | { kind: "retry"; retryAfterMs?: number; stop: boolean };
 
 function isFutureDateRejection(error: ApiError): boolean {
-  return (error.code === undefined || error.code === "validation_error") && /future/i.test(error.message);
+  return true;
 }
 
killedBy: queue regression pins keeps a non-validation 422 terminal even when its message says future
statusReason: expected [] to deeply equal [ 'bad' ]

[Killed] BooleanLiteral
src/offlineQueue.ts:292:7
 }
 
 function classifyError(error: unknown): FlushOutcome {
-  if (!(error instanceof ApiError)) return { kind: "retry", stop: true };
+  if (error instanceof ApiError) return { kind: "retry", stop: true };
   if (error.status === 409) return { kind: "duplicate" };
   if (error.status === 401) return { kind: "session-expired" };
killedBy: queue regression pins does not make a 409 duplicate into a rejected recovery item
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/offlineQueue.ts:294:7
 function classifyError(error: unknown): FlushOutcome {
   if (!(error instanceof ApiError)) return { kind: "retry", stop: true };
   if (error.status === 409) return { kind: "duplicate" };
-  if (error.status === 401) return { kind: "session-expired" };
+  if (true) return { kind: "session-expired" };
   if (error.status === 429) return { kind: "retry", retryAfterMs: error.retryAfterMs, stop: true };
   if (error.status === 422 && isFutureDateRejection(error)) return { kind: "retry", stop: false };
killedBy: queue regression pins keeps a non-validation 422 terminal even when its message says future
statusReason: session expired mid-flush — unsent entries were preserved for recovery

[Killed] LogicalOperator
src/offlineQueue.ts:296:7
   if (error.status === 409) return { kind: "duplicate" };
   if (error.status === 401) return { kind: "session-expired" };
   if (error.status === 429) return { kind: "retry", retryAfterMs: error.retryAfterMs, stop: true };
-  if (error.status === 422 && isFutureDateRejection(error)) return { kind: "retry", stop: false };
+  if (error.status === 422 || isFutureDateRejection(error)) return { kind: "retry", stop: false };
   if (error.status === 413) return { kind: "reject-and-stop" };
   if (error.status >= 400 && error.status < 500) return { kind: "reject" };
killedBy: offline queue scope keeps rejected recovery scoped to the same account and origin
statusReason: expected [] to deeply equal [ 'a-rejected' ]

[Survived] EqualityOperator
src/offlineQueue.ts:297:7
   if (error.status === 401) return { kind: "session-expired" };
   if (error.status === 429) return { kind: "retry", retryAfterMs: error.retryAfterMs, stop: true };
   if (error.status === 422 && isFutureDateRejection(error)) return { kind: "retry", stop: false };
-  if (error.status === 413) return { kind: "reject-and-stop" };
+  if (error.status !== 413) return { kind: "reject-and-stop" };
   if (error.status >= 400 && error.status < 500) return { kind: "reject" };
   return { kind: "retry", stop: error.status === 0 };

[Killed] ConditionalExpression
src/offlineQueue.ts:298:7
   if (error.status === 429) return { kind: "retry", retryAfterMs: error.retryAfterMs, stop: true };
   if (error.status === 422 && isFutureDateRejection(error)) return { kind: "retry", stop: false };
   if (error.status === 413) return { kind: "reject-and-stop" };
-  if (error.status >= 400 && error.status < 500) return { kind: "reject" };
+  if (false) return { kind: "reject" };
   return { kind: "retry", stop: error.status === 0 };
 }
killedBy: offline queue scope keeps rejected recovery scoped to the same account and origin
statusReason: expected [] to deeply equal [ 'a-rejected' ]

[Killed] BlockStatement
src/offlineQueue.ts:308:47
   const scope = await scopeFor(currentUserId);
   let sent = 0;
   for (;;) {
-    const peek = await serialized(async () => {
-      const generation = queueGeneration;
-      const queue = await readItems(scope.queue, scope, generation);
-      const item = queue.find((entry) => entry.notBefore === undefined || entry.notBefore <= Date.now());
-      return { generation, item };
-    });
+    const peek = await serialized(async () => {});
     const item = peek.item;
     if (!item) return sent;
killedBy: offline queue scope uses physically separate origin/account stores and never uploads a foreign scope
statusReason: Cannot read properties of undefined (reading 'item')

[Killed] ConditionalExpression
src/offlineQueue.ts:311:75
     const peek = await serialized(async () => {
       const generation = queueGeneration;
       const queue = await readItems(scope.queue, scope, generation);
-      const item = queue.find((entry) => entry.notBefore === undefined || entry.notBefore <= Date.now());
+      const item = queue.find((entry) => entry.notBefore === undefined || false);
       return { generation, item };
     });
killedBy: flushQueueOnReconnect flushes again once the throttle window has passed
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] ConditionalExpression
src/offlineQueue.ts:311:42
     const peek = await serialized(async () => {
       const generation = queueGeneration;
       const queue = await readItems(scope.queue, scope, generation);
-      const item = queue.find((entry) => entry.notBefore === undefined || entry.notBefore <= Date.now());
+      const item = queue.find((entry) => false);
       return { generation, item };
     });
killedBy: offline queue scope uses physically separate origin/account stores and never uploads a foreign scope
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/offlineQueue.ts:318:9
     if (!item) return sent;
 
     let outcome: FlushOutcome;
-    try {
-      await api.createEntry(item.clientEntryId, item.blobB64, item.entryDate);
-      sent += 1;
-      outcome = { kind: "sent" };
-    } catch (error) {
+    try {} catch (error) {
       outcome = classifyError(error);
     }
killedBy: offline queue scope uses physically separate origin/account stores and never uploads a foreign scope
statusReason: Cannot read properties of undefined (reading 'kind')

[Killed] AssignmentOperator
src/offlineQueue.ts:320:7
     let outcome: FlushOutcome;
     try {
       await api.createEntry(item.clientEntryId, item.blobB64, item.entryDate);
-      sent += 1;
+      sent -= 1;
       outcome = { kind: "sent" };
     } catch (error) {
killedBy: offline queue scope uses physically separate origin/account stores and never uploads a foreign scope
statusReason: expected -1 to be 1 // Object.is equality

[Killed] BlockStatement
src/offlineQueue.ts:322:21
       await api.createEntry(item.clientEntryId, item.blobB64, item.entryDate);
       sent += 1;
       outcome = { kind: "sent" };
-    } catch (error) {
-      outcome = classifyError(error);
-    }
+    } catch (error) {}
 
     if (outcome.kind === "session-expired") {
killedBy: offline queue scope keeps rejected recovery scoped to the same account and origin
statusReason: Cannot read properties of undefined (reading 'kind')

[Timeout] EqualityOperator
src/offlineQueue.ts:343:11
       const queue = await readItems(scope.queue, scope, peek.generation);
       if (wipedSince(peek.generation)) return false;
       const index = queue.findIndex((entry) => entry.clientEntryId === item.clientEntryId);
-      if (index < 0) return true; // another flush resolved it
+      if (index >= 0) return true; // another flush resolved it
       switch (outcome.kind) {
         case "sent":

[Timeout] StringLiteral
src/offlineQueue.ts:350:14
           queue.splice(index, 1);
           await writeItems(scope.queue, queue);
           break;
-        case "reject":
+        case "":
         case "reject-and-stop":
           queue.splice(index, 1);

[Killed] ArrayDeclaration
src/offlineQueue.ts:353:39
         case "reject":
         case "reject-and-stop":
           queue.splice(index, 1);
-          await appendRejected(scope, [item], peek.generation);
+          await appendRejected(scope, [], peek.generation);
           if (wipedSince(peek.generation)) return false;
           await writeItems(scope.queue, queue);
killedBy: offline queue scope keeps rejected recovery scoped to the same account and origin
statusReason: expected [] to deeply equal [ 'a-rejected' ]

[Killed] ConditionalExpression
src/offlineQueue.ts:354:15
         case "reject-and-stop":
           queue.splice(index, 1);
           await appendRejected(scope, [item], peek.generation);
-          if (wipedSince(peek.generation)) return false;
+          if (true) return false;
           await writeItems(scope.queue, queue);
           break;
killedBy: offline queue scope keeps rejected recovery scoped to the same account and origin
statusReason: expected +0 to be 1 // Object.is equality
