[Killed] BlockStatement
src/crypto/aad.ts:19:48
  * `npm test` on BOTH platforms before shipping.
  */
 
-function escapeAsciiChar(code: number): string {
-  return "\\u" + code.toString(16).padStart(4, "0");
-}
+function escapeAsciiChar(code: number): string {}
 
 function toEnsureAscii(text: string): string {
killedBy: AAD canonicalization pins (ensure_ascii contract) escapes non-ASCII to \uXXXX exactly like Python json.dumps
statusReason: expected '["undefinednundefinedcode","undefined…' to be '["\u00fcn\u00efcode","\ud83e\udde0-br…' // Object.is equality

[Killed] BlockStatement
src/crypto/aad.ts:23:46
   return "\\u" + code.toString(16).padStart(4, "0");
 }
 
-function toEnsureAscii(text: string): string {
-  let out = "";
-  for (let i = 0; i < text.length; i++) {
-    const code = text.charCodeAt(i);
-    out += code >= 0x7f ? escapeAsciiChar(code) : text[i];
-  }
-  return out;
-}
+function toEnsureAscii(text: string): string {}
 
 export function buildAad(...parts: string[]): Buffer {
killedBy: AAD canonicalization pins (ensure_ascii contract) escapes non-ASCII to \uXXXX exactly like Python json.dumps
statusReason: The first argument must be of type string or an instance of Buffer, ArrayBuffer, or Array or an Array-like Object. Received undefined

[Killed] EqualityOperator
src/crypto/aad.ts:25:19
 
 function toEnsureAscii(text: string): string {
   let out = "";
-  for (let i = 0; i < text.length; i++) {
+  for (let i = 0; i <= text.length; i++) {
     const code = text.charCodeAt(i);
     out += code >= 0x7f ? escapeAsciiChar(code) : text[i];
killedBy: AAD canonicalization pins (ensure_ascii contract) escapes non-ASCII to \uXXXX exactly like Python json.dumps
statusReason: expected '["\u00fcn\u00efcode","\ud83e\udde0-br…' to be '["\u00fcn\u00efcode","\ud83e\udde0-br…' // Object.is equality

[Killed] ConditionalExpression
src/crypto/aad.ts:25:19
 
 function toEnsureAscii(text: string): string {
   let out = "";
-  for (let i = 0; i < text.length; i++) {
+  for (let i = 0; false; i++) {
     const code = text.charCodeAt(i);
     out += code >= 0x7f ? escapeAsciiChar(code) : text[i];
killedBy: AAD canonicalization pins (ensure_ascii contract) escapes non-ASCII to \uXXXX exactly like Python json.dumps
statusReason: expected '' to be '["\u00fcn\u00efcode","\ud83e\udde0-br…' // Object.is equality

[Killed] AssignmentOperator
src/crypto/aad.ts:27:5
   let out = "";
   for (let i = 0; i < text.length; i++) {
     const code = text.charCodeAt(i);
-    out += code >= 0x7f ? escapeAsciiChar(code) : text[i];
+    out -= code >= 0x7f ? escapeAsciiChar(code) : text[i];
   }
   return out;
killedBy: AAD canonicalization pins (ensure_ascii contract) escapes non-ASCII to \uXXXX exactly like Python json.dumps
statusReason: The first argument must be of type string or an instance of Buffer, ArrayBuffer, or Array or an Array-like Object. Received type number (NaN)

[Killed] ConditionalExpression
src/crypto/aad.ts:27:12
   let out = "";
   for (let i = 0; i < text.length; i++) {
     const code = text.charCodeAt(i);
-    out += code >= 0x7f ? escapeAsciiChar(code) : text[i];
+    out += false ? escapeAsciiChar(code) : text[i];
   }
   return out;
killedBy: AAD canonicalization pins (ensure_ascii contract) escapes non-ASCII to \uXXXX exactly like Python json.dumps
statusReason: expected '["ünïcode","🧠-brain","del\u007f","ba…' to be '["\u00fcn\u00efcode","\ud83e\udde0-br…' // Object.is equality

[Killed] BlockStatement
src/crypto/aad.ts:32:54
   return out;
 }
 
-export function buildAad(...parts: string[]): Buffer {
-  const arrayJson = JSON.stringify(parts);
-  // The JSON structure itself is pure ASCII after this pass; only the
-  // string contents could contain non-ASCII, and JSON.stringify escapes
-  // structural characters itself, so escaping the WHOLE serialization is
-  // safe: nothing outside string literals can be >= 0x7F.
-  // Stryker disable StringLiteral
-return Buffer.from(toEnsureAscii(arrayJson), "utf8");
-  // Stryker restore StringLiteral
-}
+export function buildAad(...parts: string[]): Buffer {}
 
killedBy: AAD canonicalization pins (ensure_ascii contract) escapes non-ASCII to \uXXXX exactly like Python json.dumps
statusReason: Cannot read properties of undefined (reading 'toString')
