[Killed] MethodExpression
src/offlineQueue.ts:362:37
           queue[index] = {
             ...item,
             attempts: attempts + 1,
-            notBefore: Date.now() + Math.min(outcome.retryAfterMs ?? retryDelayMs(attempts), RETRY_MAX_MS),
+            notBefore: Date.now() + Math.max(outcome.retryAfterMs ?? retryDelayMs(attempts), RETRY_MAX_MS),
           };
           await writeItems(scope.queue, queue);
killedBy: flushQueueOnReconnect flushes again once the throttle window has passed
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Survived] EqualityOperator
src/offlineQueue.ts:371:9
       return true;
     });
     if (!committed) return sent;
-    if (outcome.kind === "reject-and-stop" || (outcome.kind === "retry" && outcome.stop)) return sent;
+    if (outcome.kind !== "reject-and-stop" || (outcome.kind === "retry" && outcome.stop)) return sent;
   }
 }

[Survived] ConditionalExpression
src/offlineQueue.ts:371:48
       return true;
     });
     if (!committed) return sent;
-    if (outcome.kind === "reject-and-stop" || (outcome.kind === "retry" && outcome.stop)) return sent;
+    if (outcome.kind === "reject-and-stop" || (false)) return sent;
   }
 }

[Killed] BlockStatement
src/offlineQueue.ts:377:44
 
 /** Sign-out/origin switch fences in-flight writes but keeps ciphertext for
  * the correct account scope. Account deletion calls clearQueue instead. */
-export function abortInFlightFlush(): void {
-  queueGeneration += 1;
-}
+export function abortInFlightFlush(): void {}
 
 export async function requeueRejected(userId?: string): Promise<number> {
killedBy: offline queue scope fences an in-flight flush on sign-out rather than rejecting its ciphertext
statusReason: expected +0 to be 1 // Object.is equality

[Survived] AssignmentOperator
src/offlineQueue.ts:378:3
 /** Sign-out/origin switch fences in-flight writes but keeps ciphertext for
  * the correct account scope. Account deletion calls clearQueue instead. */
 export function abortInFlightFlush(): void {
-  queueGeneration += 1;
+  queueGeneration -= 1;
 }
 

[Killed] ConditionalExpression
src/offlineQueue.ts:390:9
       readItems(scope.queue, scope, generation),
       rejectedFor(scope, generation),
     ]);
-    if (wipedSince(generation) || rejected.length === 0) return 0;
+    if (true) return 0;
     const ids = new Set(queue.map((item) => item.clientEntryId));
     const stillRejected: QueuedEntry[] = [];
killedBy: offline queue scope keeps rejected recovery scoped to the same account and origin
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/offlineQueue.ts:390:35
       readItems(scope.queue, scope, generation),
       rejectedFor(scope, generation),
     ]);
-    if (wipedSince(generation) || rejected.length === 0) return 0;
+    if (wipedSince(generation) || rejected.length !== 0) return 0;
     const ids = new Set(queue.map((item) => item.clientEntryId));
     const stillRejected: QueuedEntry[] = [];
killedBy: offline queue scope keeps rejected recovery scoped to the same account and origin
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/offlineQueue.ts:396:11
     let moved = 0;
     for (const item of rejected) {
       if (ids.has(item.clientEntryId)) continue;
-      if (queue.length >= MAX_QUEUE_LENGTH) {
+      if (queue.length < MAX_QUEUE_LENGTH) {
         stillRejected.push(item);
         continue;
killedBy: offline queue scope keeps rejected recovery scoped to the same account and origin
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/offlineQueue.ts:421:18
   if (now - lastReconnectFlushAt < RECONNECT_FLUSH_MIN_INTERVAL_MS) return;
   lastReconnectFlushAt = now;
   const userId = await api.getUserId();
-  if (!userId || (await queueLength(userId)) === 0) return;
+  if (!userId || (await queueLength(userId)) !== 0) return;
   await flushQueue(userId).catch(() => {});
 }
killedBy: flushQueueOnReconnect flushes a non-empty queue when a session exists
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/offlineQueue.ts:421:7
   if (now - lastReconnectFlushAt < RECONNECT_FLUSH_MIN_INTERVAL_MS) return;
   lastReconnectFlushAt = now;
   const userId = await api.getUserId();
-  if (!userId || (await queueLength(userId)) === 0) return;
+  if (true) return;
   await flushQueue(userId).catch(() => {});
 }
killedBy: flushQueueOnReconnect flushes a non-empty queue when a session exists
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/offlineQueue.ts:426:66
 }
 
 /** Delete only this account's data for the currently selected origin. */
-export async function clearQueue(userId?: string): Promise<void> {
-  await migrateUnscopedLegacyData();
-  const scope = await scopeFor(await resolveUserId(userId));
-  queueGeneration += 1;
-  await AsyncStorage.multiRemove([scope.queue, scope.rejected, scope.quarantine]);
-}
+export async function clearQueue(userId?: string): Promise<void> {}
 
 export async function queueLength(userId?: string): Promise<number> {
killedBy: flushQueueOnReconnect does nothing when signed out or when the queue is empty
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "r-1",

[Survived] AssignmentOperator
src/offlineQueue.ts:429:3
 export async function clearQueue(userId?: string): Promise<void> {
   await migrateUnscopedLegacyData();
   const scope = await scopeFor(await resolveUserId(userId));
-  queueGeneration += 1;
+  queueGeneration -= 1;
   await AsyncStorage.multiRemove([scope.queue, scope.rejected, scope.quarantine]);
 }

[Killed] ConditionalExpression
src/offlineQueue.ts:444:10
  * without ever assigning them to the wrong account/server. */
 export async function hasLegacyQueueRecovery(): Promise<boolean> {
   await migrateUnscopedLegacyData();
-  return (await AsyncStorage.getItem(LEGACY_RECOVERY_KEY)) !== null;
+  return false;
 }
 
killedBy: offline queue durability preserves pre-v2 global bytes without assigning them to the current server
statusReason: expected false to be true // Object.is equality
