[Killed] BlockStatement
src/readableExport.ts:36:78
   truncatedCount: number;
 }
 
-function plural(count: number, singular: string, pluralForm: string): string {
-  return `${count} ${count === 1 ? singular : pluralForm}`;
-}
+function plural(count: number, singular: string, pluralForm: string): string {}
 
 function renderMarkdown(parts: readonly string[], skipped: number, truncated: number, now: Date): string {
killedBy: buildReadableExport renders oldest-first Markdown with dates, text, and mood lines
statusReason: expected '# MindPattern journal\n\nExported 202…' to contain '2 entries'

[Killed] EqualityOperator
src/readableExport.ts:37:22
 }
 
 function plural(count: number, singular: string, pluralForm: string): string {
-  return `${count} ${count === 1 ? singular : pluralForm}`;
+  return `${count} ${count !== 1 ? singular : pluralForm}`;
 }
 
killedBy: buildReadableExport renders oldest-first Markdown with dates, text, and mood lines
statusReason: expected '# MindPattern journal\n\nExported 202…' to contain '2 entries'

[Killed] ConditionalExpression
src/readableExport.ts:37:22
 }
 
 function plural(count: number, singular: string, pluralForm: string): string {
-  return `${count} ${count === 1 ? singular : pluralForm}`;
+  return `${count} ${true ? singular : pluralForm}`;
 }
 
killedBy: buildReadableExport renders oldest-first Markdown with dates, text, and mood lines
statusReason: expected '# MindPattern journal\n\nExported 202…' to contain '2 entries'

[Killed] BlockStatement
src/readableExport.ts:40:106
   return `${count} ${count === 1 ? singular : pluralForm}`;
 }
 
-function renderMarkdown(parts: readonly string[], skipped: number, truncated: number, now: Date): string {
-  const notes = [
-    skipped > 0 ? `${plural(skipped, "entry", "entries")} could not be decrypted` : "",
-    truncated > 0 ? `${plural(truncated, "entry", "entries")} omitted to keep this export under 4 MB` : "",
-  ].filter(Boolean);
-  const header =
-    `# MindPattern journal\n\nExported ${now.toISOString().slice(0, 10)} · ` +
-    `${plural(parts.length, "entry", "entries")}` +
-    (notes.length > 0 ? ` · ${notes.join(" · ")}` : "") +
-    `\n\n_Decrypted on this device. Observations only — never a diagnosis._\n`;
-  return `${header}\n${parts.join(ENTRY_SEPARATOR)}\n`;
-}
+function renderMarkdown(parts: readonly string[], skipped: number, truncated: number, now: Date): string {}
 
 /** Mood-tag words for the optional per-entry line (matches MOOD_OPTIONS
killedBy: buildReadableExport renders oldest-first Markdown with dates, text, and mood lines
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/readableExport.ts:42:5
 
 function renderMarkdown(parts: readonly string[], skipped: number, truncated: number, now: Date): string {
   const notes = [
-    skipped > 0 ? `${plural(skipped, "entry", "entries")} could not be decrypted` : "",
+    false ? `${plural(skipped, "entry", "entries")} could not be decrypted` : "",
     truncated > 0 ? `${plural(truncated, "entry", "entries")} omitted to keep this export under 4 MB` : "",
   ].filter(Boolean);
killedBy: buildReadableExport skips undecryptable blobs and counts them honestly
statusReason: expected '# MindPattern journal\n\nExported 202…' to contain '1 entry could not be decrypted'

[Killed] EqualityOperator
src/readableExport.ts:42:5
 
 function renderMarkdown(parts: readonly string[], skipped: number, truncated: number, now: Date): string {
   const notes = [
-    skipped > 0 ? `${plural(skipped, "entry", "entries")} could not be decrypted` : "",
+    skipped <= 0 ? `${plural(skipped, "entry", "entries")} could not be decrypted` : "",
     truncated > 0 ? `${plural(truncated, "entry", "entries")} omitted to keep this export under 4 MB` : "",
   ].filter(Boolean);
killedBy: buildReadableExport skips undecryptable blobs and counts them honestly
statusReason: expected '# MindPattern journal\n\nExported 202…' to contain '1 entry could not be decrypted'

[Killed] EqualityOperator
src/readableExport.ts:43:5
 function renderMarkdown(parts: readonly string[], skipped: number, truncated: number, now: Date): string {
   const notes = [
     skipped > 0 ? `${plural(skipped, "entry", "entries")} could not be decrypted` : "",
-    truncated > 0 ? `${plural(truncated, "entry", "entries")} omitted to keep this export under 4 MB` : "",
+    truncated <= 0 ? `${plural(truncated, "entry", "entries")} omitted to keep this export under 4 MB` : "",
   ].filter(Boolean);
   const header =
killedBy: buildReadableExport caps a valid oversized journal deterministically before the share sheet
statusReason: expected '# MindPattern journal\n\nExported 202…' to contain '1 entry omitted to keep this export u…'

[Killed] ConditionalExpression
src/readableExport.ts:43:5
 function renderMarkdown(parts: readonly string[], skipped: number, truncated: number, now: Date): string {
   const notes = [
     skipped > 0 ? `${plural(skipped, "entry", "entries")} could not be decrypted` : "",
-    truncated > 0 ? `${plural(truncated, "entry", "entries")} omitted to keep this export under 4 MB` : "",
+    false ? `${plural(truncated, "entry", "entries")} omitted to keep this export under 4 MB` : "",
   ].filter(Boolean);
   const header =
killedBy: buildReadableExport caps a valid oversized journal deterministically before the share sheet
statusReason: expected '# MindPattern journal\n\nExported 202…' to contain '1 entry omitted to keep this export u…'

[Survived] MethodExpression
src/readableExport.ts:46:42
     truncated > 0 ? `${plural(truncated, "entry", "entries")} omitted to keep this export under 4 MB` : "",
   ].filter(Boolean);
   const header =
-    `# MindPattern journal\n\nExported ${now.toISOString().slice(0, 10)} · ` +
+    `# MindPattern journal\n\nExported ${now.toISOString()} · ` +
     `${plural(parts.length, "entry", "entries")}` +
     (notes.length > 0 ? ` · ${notes.join(" · ")}` : "") +

[Survived] StringLiteral
src/readableExport.ts:47:29
   ].filter(Boolean);
   const header =
     `# MindPattern journal\n\nExported ${now.toISOString().slice(0, 10)} · ` +
-    `${plural(parts.length, "entry", "entries")}` +
+    `${plural(parts.length, "", "entries")}` +
     (notes.length > 0 ? ` · ${notes.join(" · ")}` : "") +
     `\n\n_Decrypted on this device. Observations only — never a diagnosis._\n`;

[Killed] EqualityOperator
src/readableExport.ts:48:6
   const header =
     `# MindPattern journal\n\nExported ${now.toISOString().slice(0, 10)} · ` +
     `${plural(parts.length, "entry", "entries")}` +
-    (notes.length > 0 ? ` · ${notes.join(" · ")}` : "") +
+    (notes.length <= 0 ? ` · ${notes.join(" · ")}` : "") +
     `\n\n_Decrypted on this device. Observations only — never a diagnosis._\n`;
   return `${header}\n${parts.join(ENTRY_SEPARATOR)}\n`;
killedBy: buildReadableExport skips undecryptable blobs and counts them honestly
statusReason: expected '# MindPattern journal\n\nExported 202…' to contain '1 entry could not be decrypted'

[Killed] ConditionalExpression
src/readableExport.ts:48:6
   const header =
     `# MindPattern journal\n\nExported ${now.toISOString().slice(0, 10)} · ` +
     `${plural(parts.length, "entry", "entries")}` +
-    (notes.length > 0 ? ` · ${notes.join(" · ")}` : "") +
+    (false ? ` · ${notes.join(" · ")}` : "") +
     `\n\n_Decrypted on this device. Observations only — never a diagnosis._\n`;
   return `${header}\n${parts.join(ENTRY_SEPARATOR)}\n`;
killedBy: buildReadableExport skips undecryptable blobs and counts them honestly
statusReason: expected '# MindPattern journal\n\nExported 202…' to contain '1 entry could not be decrypted'

[Survived] StringLiteral
src/readableExport.ts:49:5
     `# MindPattern journal\n\nExported ${now.toISOString().slice(0, 10)} · ` +
     `${plural(parts.length, "entry", "entries")}` +
     (notes.length > 0 ? ` · ${notes.join(" · ")}` : "") +
-    `\n\n_Decrypted on this device. Observations only — never a diagnosis._\n`;
+    ``;
   return `${header}\n${parts.join(ENTRY_SEPARATOR)}\n`;
 }

[Killed] StringLiteral
src/readableExport.ts:50:10
     `${plural(parts.length, "entry", "entries")}` +
     (notes.length > 0 ? ` · ${notes.join(" · ")}` : "") +
     `\n\n_Decrypted on this device. Observations only — never a diagnosis._\n`;
-  return `${header}\n${parts.join(ENTRY_SEPARATOR)}\n`;
+  return ``;
 }
 
killedBy: buildReadableExport renders oldest-first Markdown with dates, text, and mood lines
statusReason: expected -1 to be greater than -1

[Killed] BlockStatement
src/readableExport.ts:55:79
 
 /** Mood-tag words for the optional per-entry line (matches MOOD_OPTIONS
  *  wording, derived from the payload sentiment value). */
-export function moodWord(sentiment: number | null | undefined): string | null {
-  if (typeof sentiment !== "number" || !Number.isFinite(sentiment)) return null;
-  if (sentiment <= -0.75) return "Heavy";
-  if (sentiment <= -0.25) return "Low";
-  if (sentiment < 0.25) return "Okay";
-  if (sentiment < 0.75) return "Good";
-  return "Light";
-}
+export function moodWord(sentiment: number | null | undefined): string | null {}
 
 /** Decrypt every entry this account holds and render Markdown.
killedBy: buildReadableExport renders oldest-first Markdown with dates, text, and mood lines
statusReason: expected '# MindPattern journal\n\nExported 202…' to contain '_mood: Heavy_'

[Killed] LogicalOperator
src/readableExport.ts:56:7
 /** Mood-tag words for the optional per-entry line (matches MOOD_OPTIONS
  *  wording, derived from the payload sentiment value). */
 export function moodWord(sentiment: number | null | undefined): string | null {
-  if (typeof sentiment !== "number" || !Number.isFinite(sentiment)) return null;
+  if (typeof sentiment !== "number" && !Number.isFinite(sentiment)) return null;
   if (sentiment <= -0.75) return "Heavy";
   if (sentiment <= -0.25) return "Low";
killedBy: moodWord maps the 5-point check-in scale to its labels
statusReason: expected 'Light' to be null

[Killed] ConditionalExpression
src/readableExport.ts:56:7
 /** Mood-tag words for the optional per-entry line (matches MOOD_OPTIONS
  *  wording, derived from the payload sentiment value). */
 export function moodWord(sentiment: number | null | undefined): string | null {
-  if (typeof sentiment !== "number" || !Number.isFinite(sentiment)) return null;
+  if (false) return null;
   if (sentiment <= -0.75) return "Heavy";
   if (sentiment <= -0.25) return "Low";
killedBy: buildReadableExport entries without a mood pick render with no mood line
statusReason: expected '# MindPattern journal\n\nExported 202…' not to contain '_mood:'

[Killed] UnaryOperator
src/readableExport.ts:57:20
  *  wording, derived from the payload sentiment value). */
 export function moodWord(sentiment: number | null | undefined): string | null {
   if (typeof sentiment !== "number" || !Number.isFinite(sentiment)) return null;
-  if (sentiment <= -0.75) return "Heavy";
+  if (sentiment <= +0.75) return "Heavy";
   if (sentiment <= -0.25) return "Low";
   if (sentiment < 0.25) return "Okay";
killedBy: buildReadableExport renders oldest-first Markdown with dates, text, and mood lines
statusReason: expected '# MindPattern journal\n\nExported 202…' to contain '_mood: Good_'

[Killed] EqualityOperator
src/readableExport.ts:57:7
  *  wording, derived from the payload sentiment value). */
 export function moodWord(sentiment: number | null | undefined): string | null {
   if (typeof sentiment !== "number" || !Number.isFinite(sentiment)) return null;
-  if (sentiment <= -0.75) return "Heavy";
+  if (sentiment > -0.75) return "Heavy";
   if (sentiment <= -0.25) return "Low";
   if (sentiment < 0.25) return "Okay";
killedBy: buildReadableExport renders oldest-first Markdown with dates, text, and mood lines
statusReason: expected '# MindPattern journal\n\nExported 202…' to contain '_mood: Good_'

[Killed] EqualityOperator
src/readableExport.ts:58:7
 export function moodWord(sentiment: number | null | undefined): string | null {
   if (typeof sentiment !== "number" || !Number.isFinite(sentiment)) return null;
   if (sentiment <= -0.75) return "Heavy";
-  if (sentiment <= -0.25) return "Low";
+  if (sentiment > -0.25) return "Low";
   if (sentiment < 0.25) return "Okay";
   if (sentiment < 0.75) return "Good";
killedBy: buildReadableExport renders oldest-first Markdown with dates, text, and mood lines
statusReason: expected '# MindPattern journal\n\nExported 202…' to contain '_mood: Good_'

[Killed] ConditionalExpression
src/readableExport.ts:58:7
 export function moodWord(sentiment: number | null | undefined): string | null {
   if (typeof sentiment !== "number" || !Number.isFinite(sentiment)) return null;
   if (sentiment <= -0.75) return "Heavy";
-  if (sentiment <= -0.25) return "Low";
+  if (false) return "Low";
   if (sentiment < 0.25) return "Okay";
   if (sentiment < 0.75) return "Good";
killedBy: moodWord maps the 5-point check-in scale to its labels
statusReason: expected 'Okay' to be 'Low' // Object.is equality

[Killed] ConditionalExpression
src/readableExport.ts:59:7
   if (typeof sentiment !== "number" || !Number.isFinite(sentiment)) return null;
   if (sentiment <= -0.75) return "Heavy";
   if (sentiment <= -0.25) return "Low";
-  if (sentiment < 0.25) return "Okay";
+  if (true) return "Okay";
   if (sentiment < 0.75) return "Good";
   return "Light";
killedBy: buildReadableExport renders oldest-first Markdown with dates, text, and mood lines
statusReason: expected '# MindPattern journal\n\nExported 202…' to contain '_mood: Good_'

[Killed] ConditionalExpression
src/readableExport.ts:59:7
   if (typeof sentiment !== "number" || !Number.isFinite(sentiment)) return null;
   if (sentiment <= -0.75) return "Heavy";
   if (sentiment <= -0.25) return "Low";
-  if (sentiment < 0.25) return "Okay";
+  if (false) return "Okay";
   if (sentiment < 0.75) return "Good";
   return "Light";
killedBy: moodWord maps the 5-point check-in scale to its labels
statusReason: expected 'Good' to be 'Okay' // Object.is equality

[Killed] ConditionalExpression
src/readableExport.ts:60:7
   if (sentiment <= -0.75) return "Heavy";
   if (sentiment <= -0.25) return "Low";
   if (sentiment < 0.25) return "Okay";
-  if (sentiment < 0.75) return "Good";
+  if (false) return "Good";
   return "Light";
 }
killedBy: buildReadableExport renders oldest-first Markdown with dates, text, and mood lines
statusReason: expected '# MindPattern journal\n\nExported 202…' to contain '_mood: Good_'

[Killed] ConditionalExpression
src/readableExport.ts:60:7
   if (sentiment <= -0.75) return "Heavy";
   if (sentiment <= -0.25) return "Low";
   if (sentiment < 0.25) return "Okay";
-  if (sentiment < 0.75) return "Good";
+  if (true) return "Good";
   return "Light";
 }
killedBy: moodWord maps the 5-point check-in scale to its labels
statusReason: expected 'Good' to be 'Light' // Object.is equality

[Killed] MethodExpression
src/readableExport.ts:73:19
   const keys = vault.get();
   const rows = await api.listEntries();
   // listEntries returns newest-first pages; the document reads oldest-first.
-  const ordered = [...rows].reverse();
+  const ordered = [...rows];
   const parts: string[] = [];
   let skipped = 0;
killedBy: buildReadableExport renders oldest-first Markdown with dates, text, and mood lines
statusReason: expected 139 to be greater than 190

[Killed] ArrayDeclaration
src/readableExport.ts:73:19
   const keys = vault.get();
   const rows = await api.listEntries();
   // listEntries returns newest-first pages; the document reads oldest-first.
-  const ordered = [...rows].reverse();
+  const ordered = [].reverse();
   const parts: string[] = [];
   let skipped = 0;
killedBy: buildReadableExport renders oldest-first Markdown with dates, text, and mood lines
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/readableExport.ts:78:49
   let skipped = 0;
   let truncated = 0;
   let contentLength = 0;
-  for (const [index, row] of ordered.entries()) {
-    try {
-      const payload = decryptEntry(keys, userId, row.client_entry_id, row.blob);
-      const text = typeof payload.text === "string" ? payload.text.trim() : "";
-      if (!text && !row.entry_date) continue;
-      const mood = moodWord(payload.sentiment);
-      const part =
-        `## ${row.entry_date || "undated"}\n\n${text || "_(empty entry)_"}${mood ? `\n\n_mood: ${mood}_` : ""}`;
-      const separatorLength = parts.length === 0 ? 0 : ENTRY_SEPARATOR.length;
-      // Preserve the oldest-first ordering rather than producing a
-      // surprising sparse chronology. Once one valid entry will not fit,
-      // count it and every remaining row as omitted without decrypting or
-      // allocating more plaintext.
-      if (contentLength + separatorLength + part.length > MAX_READABLE_CHARS - HEADER_RESERVE_CHARS) {
-        truncated += ordered.length - index;
-        break;
-      }
-      parts.push(part);
-      contentLength += separatorLength + part.length;
-    } catch {
-      skipped += 1;
-    }
-  }
+  for (const [index, row] of ordered.entries()) {}
   let markdown = renderMarkdown(parts, skipped, truncated, now);
   // The reserve above is deliberately generous, but this remains a
killedBy: buildReadableExport renders oldest-first Markdown with dates, text, and mood lines
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/readableExport.ts:79:9
   let truncated = 0;
   let contentLength = 0;
   for (const [index, row] of ordered.entries()) {
-    try {
-      const payload = decryptEntry(keys, userId, row.client_entry_id, row.blob);
-      const text = typeof payload.text === "string" ? payload.text.trim() : "";
-      if (!text && !row.entry_date) continue;
-      const mood = moodWord(payload.sentiment);
-      const part =
-        `## ${row.entry_date || "undated"}\n\n${text || "_(empty entry)_"}${mood ? `\n\n_mood: ${mood}_` : ""}`;
-      const separatorLength = parts.length === 0 ? 0 : ENTRY_SEPARATOR.length;
-      // Preserve the oldest-first ordering rather than producing a
-      // surprising sparse chronology. Once one valid entry will not fit,
-      // count it and every remaining row as omitted without decrypting or
-      // allocating more plaintext.
-      if (contentLength + separatorLength + part.length > MAX_READABLE_CHARS - HEADER_RESERVE_CHARS) {
-        truncated += ordered.length - index;
-        break;
-      }
-      parts.push(part);
-      contentLength += separatorLength + part.length;
-    } catch {
+    try {} catch {
       skipped += 1;
     }
killedBy: buildReadableExport renders oldest-first Markdown with dates, text, and mood lines
statusReason: expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
src/readableExport.ts:81:20
   for (const [index, row] of ordered.entries()) {
     try {
       const payload = decryptEntry(keys, userId, row.client_entry_id, row.blob);
-      const text = typeof payload.text === "string" ? payload.text.trim() : "";
+      const text = typeof payload.text !== "string" ? payload.text.trim() : "";
       if (!text && !row.entry_date) continue;
       const mood = moodWord(payload.sentiment);
killedBy: buildReadableExport renders oldest-first Markdown with dates, text, and mood lines
statusReason: expected -1 to be greater than -1

[Killed] ConditionalExpression
src/readableExport.ts:81:20
   for (const [index, row] of ordered.entries()) {
     try {
       const payload = decryptEntry(keys, userId, row.client_entry_id, row.blob);
-      const text = typeof payload.text === "string" ? payload.text.trim() : "";
+      const text = false ? payload.text.trim() : "";
       if (!text && !row.entry_date) continue;
       const mood = moodWord(payload.sentiment);
killedBy: buildReadableExport renders oldest-first Markdown with dates, text, and mood lines
statusReason: expected -1 to be greater than -1

[Killed] ConditionalExpression
src/readableExport.ts:82:11
     try {
       const payload = decryptEntry(keys, userId, row.client_entry_id, row.blob);
       const text = typeof payload.text === "string" ? payload.text.trim() : "";
-      if (!text && !row.entry_date) continue;
+      if (true) continue;
       const mood = moodWord(payload.sentiment);
       const part =
killedBy: buildReadableExport renders oldest-first Markdown with dates, text, and mood lines
statusReason: expected +0 to be 2 // Object.is equality

[Survived] LogicalOperator
src/readableExport.ts:82:11
     try {
       const payload = decryptEntry(keys, userId, row.client_entry_id, row.blob);
       const text = typeof payload.text === "string" ? payload.text.trim() : "";
-      if (!text && !row.entry_date) continue;
+      if (!text || !row.entry_date) continue;
       const mood = moodWord(payload.sentiment);
       const part =

[Killed] LogicalOperator
src/readableExport.ts:85:49
       if (!text && !row.entry_date) continue;
       const mood = moodWord(payload.sentiment);
       const part =
-        `## ${row.entry_date || "undated"}\n\n${text || "_(empty entry)_"}${mood ? `\n\n_mood: ${mood}_` : ""}`;
+        `## ${row.entry_date || "undated"}\n\n${text && "_(empty entry)_"}${mood ? `\n\n_mood: ${mood}_` : ""}`;
       const separatorLength = parts.length === 0 ? 0 : ENTRY_SEPARATOR.length;
       // Preserve the oldest-first ordering rather than producing a
killedBy: buildReadableExport renders oldest-first Markdown with dates, text, and mood lines
statusReason: expected -1 to be greater than -1

[Killed] ConditionalExpression
src/readableExport.ts:85:49
       if (!text && !row.entry_date) continue;
       const mood = moodWord(payload.sentiment);
       const part =
-        `## ${row.entry_date || "undated"}\n\n${text || "_(empty entry)_"}${mood ? `\n\n_mood: ${mood}_` : ""}`;
+        `## ${row.entry_date || "undated"}\n\n${false}${mood ? `\n\n_mood: ${mood}_` : ""}`;
       const separatorLength = parts.length === 0 ? 0 : ENTRY_SEPARATOR.length;
       // Preserve the oldest-first ordering rather than producing a
killedBy: buildReadableExport renders oldest-first Markdown with dates, text, and mood lines
statusReason: expected -1 to be greater than -1

[Survived] ConditionalExpression
src/readableExport.ts:86:31
       const mood = moodWord(payload.sentiment);
       const part =
         `## ${row.entry_date || "undated"}\n\n${text || "_(empty entry)_"}${mood ? `\n\n_mood: ${mood}_` : ""}`;
-      const separatorLength = parts.length === 0 ? 0 : ENTRY_SEPARATOR.length;
+      const separatorLength = false ? 0 : ENTRY_SEPARATOR.length;
       // Preserve the oldest-first ordering rather than producing a
       // surprising sparse chronology. Once one valid entry will not fit,

[Survived] EqualityOperator
src/readableExport.ts:86:31
       const mood = moodWord(payload.sentiment);
       const part =
         `## ${row.entry_date || "undated"}\n\n${text || "_(empty entry)_"}${mood ? `\n\n_mood: ${mood}_` : ""}`;
-      const separatorLength = parts.length === 0 ? 0 : ENTRY_SEPARATOR.length;
+      const separatorLength = parts.length !== 0 ? 0 : ENTRY_SEPARATOR.length;
       // Preserve the oldest-first ordering rather than producing a
       // surprising sparse chronology. Once one valid entry will not fit,

[Killed] EqualityOperator
src/readableExport.ts:91:11
       // surprising sparse chronology. Once one valid entry will not fit,
       // count it and every remaining row as omitted without decrypting or
       // allocating more plaintext.
-      if (contentLength + separatorLength + part.length > MAX_READABLE_CHARS - HEADER_RESERVE_CHARS) {
+      if (contentLength + separatorLength + part.length <= MAX_READABLE_CHARS - HEADER_RESERVE_CHARS) {
         truncated += ordered.length - index;
         break;
killedBy: buildReadableExport renders oldest-first Markdown with dates, text, and mood lines
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/readableExport.ts:91:11
       // surprising sparse chronology. Once one valid entry will not fit,
       // count it and every remaining row as omitted without decrypting or
       // allocating more plaintext.
-      if (contentLength + separatorLength + part.length > MAX_READABLE_CHARS - HEADER_RESERVE_CHARS) {
+      if (true) {
         truncated += ordered.length - index;
         break;
killedBy: buildReadableExport renders oldest-first Markdown with dates, text, and mood lines
statusReason: expected +0 to be 2 // Object.is equality

[Killed] AssignmentOperator
src/readableExport.ts:92:9
       // count it and every remaining row as omitted without decrypting or
       // allocating more plaintext.
       if (contentLength + separatorLength + part.length > MAX_READABLE_CHARS - HEADER_RESERVE_CHARS) {
-        truncated += ordered.length - index;
+        truncated -= ordered.length - index;
         break;
       }
killedBy: buildReadableExport caps a valid oversized journal deterministically before the share sheet
statusReason: expected -1 to be 1 // Object.is equality

[Survived] ArithmeticOperator
src/readableExport.ts:92:22
       // count it and every remaining row as omitted without decrypting or
       // allocating more plaintext.
       if (contentLength + separatorLength + part.length > MAX_READABLE_CHARS - HEADER_RESERVE_CHARS) {
-        truncated += ordered.length - index;
+        truncated += ordered.length + index;
         break;
       }

[Killed] CallExpression
src/readableExport.ts:95:7
         truncated += ordered.length - index;
         break;
       }
-      parts.push(part);
+      ;
       contentLength += separatorLength + part.length;
     } catch {
killedBy: buildReadableExport renders oldest-first Markdown with dates, text, and mood lines
statusReason: expected +0 to be 2 // Object.is equality

[Survived] ArithmeticOperator
src/readableExport.ts:96:24
         break;
       }
       parts.push(part);
-      contentLength += separatorLength + part.length;
+      contentLength += separatorLength - part.length;
     } catch {
       skipped += 1;

[Survived] AssignmentOperator
src/readableExport.ts:96:7
         break;
       }
       parts.push(part);
-      contentLength += separatorLength + part.length;
+      contentLength -= separatorLength + part.length;
     } catch {
       skipped += 1;

[Killed] BlockStatement
src/readableExport.ts:97:13
       }
       parts.push(part);
       contentLength += separatorLength + part.length;
-    } catch {
-      skipped += 1;
-    }
+    } catch {}
   }
   let markdown = renderMarkdown(parts, skipped, truncated, now);
killedBy: buildReadableExport skips undecryptable blobs and counts them honestly
statusReason: expected +0 to be 1 // Object.is equality

[Killed] AssignmentOperator
src/readableExport.ts:98:7
       parts.push(part);
       contentLength += separatorLength + part.length;
     } catch {
-      skipped += 1;
+      skipped -= 1;
     }
   }
killedBy: buildReadableExport skips undecryptable blobs and counts them honestly
statusReason: expected -1 to be 1 // Object.is equality

[Killed] LogicalOperator
src/readableExport.ts:104:10
   let markdown = renderMarkdown(parts, skipped, truncated, now);
   // The reserve above is deliberately generous, but this remains a
   // fail-closed size boundary if header copy is ever expanded.
-  while (markdown.length > MAX_READABLE_CHARS && parts.length > 0) {
+  while (markdown.length > MAX_READABLE_CHARS || parts.length > 0) {
     parts.pop();
     truncated += 1;
killedBy: buildReadableExport renders oldest-first Markdown with dates, text, and mood lines
statusReason: expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
src/readableExport.ts:104:10
   let markdown = renderMarkdown(parts, skipped, truncated, now);
   // The reserve above is deliberately generous, but this remains a
   // fail-closed size boundary if header copy is ever expanded.
-  while (markdown.length > MAX_READABLE_CHARS && parts.length > 0) {
+  while (markdown.length <= MAX_READABLE_CHARS && parts.length > 0) {
     parts.pop();
     truncated += 1;
killedBy: buildReadableExport renders oldest-first Markdown with dates, text, and mood lines
statusReason: expected +0 to be 2 // Object.is equality

[NoCoverage] CallExpression
src/readableExport.ts:105:5
   // The reserve above is deliberately generous, but this remains a
   // fail-closed size boundary if header copy is ever expanded.
   while (markdown.length > MAX_READABLE_CHARS && parts.length > 0) {
-    parts.pop();
+    ;
     truncated += 1;
     markdown = renderMarkdown(parts, skipped, truncated, now);

[NoCoverage] AssignmentOperator
src/readableExport.ts:106:5
   // fail-closed size boundary if header copy is ever expanded.
   while (markdown.length > MAX_READABLE_CHARS && parts.length > 0) {
     parts.pop();
-    truncated += 1;
+    truncated -= 1;
     markdown = renderMarkdown(parts, skipped, truncated, now);
   }

[Killed] EqualityOperator
src/readableExport.ts:109:7
     truncated += 1;
     markdown = renderMarkdown(parts, skipped, truncated, now);
   }
-  if (markdown.length > MAX_READABLE_CHARS) {
+  if (markdown.length <= MAX_READABLE_CHARS) {
     throw new Error("readable export header exceeds the safe share-sheet limit");
   }
killedBy: buildReadableExport renders oldest-first Markdown with dates, text, and mood lines
statusReason: readable export header exceeds the safe share-sheet limit

[Killed] ConditionalExpression
src/readableExport.ts:109:7
     truncated += 1;
     markdown = renderMarkdown(parts, skipped, truncated, now);
   }
-  if (markdown.length > MAX_READABLE_CHARS) {
+  if (true) {
     throw new Error("readable export header exceeds the safe share-sheet limit");
   }
killedBy: buildReadableExport renders oldest-first Markdown with dates, text, and mood lines
statusReason: readable export header exceeds the safe share-sheet limit
