[NoCoverage] StringLiteral
src/readableExport.ts:110:21
     markdown = renderMarkdown(parts, skipped, truncated, now);
   }
   if (markdown.length > MAX_READABLE_CHARS) {
-    throw new Error("readable export header exceeds the safe share-sheet limit");
+    throw new Error("");
   }
   return {
