[Survived] BooleanLiteral
src/screens/SettingsScreen.tsx:60:60
   const [url, setUrl] = useState("");
   const [busy, setBusy] = useState(false);
   const [llmAvailable, setLlmAvailable] = useState(false);
-  const [sharingAvailable, setSharingAvailable] = useState(false);
+  const [sharingAvailable, setSharingAvailable] = useState(true);
   const [llmEnabled, setLlmEnabled] = useState(false);
   const [serverVersion, setServerVersion] = useState<string | null>(null);

[Killed] BooleanLiteral
src/screens/SettingsScreen.tsx:61:48
   const [busy, setBusy] = useState(false);
   const [llmAvailable, setLlmAvailable] = useState(false);
   const [sharingAvailable, setSharingAvailable] = useState(false);
-  const [llmEnabled, setLlmEnabled] = useState(false);
+  const [llmEnabled, setLlmEnabled] = useState(true);
   const [serverVersion, setServerVersion] = useState<string | null>(null);
   const [rejectedCount, setRejectedCount] = useState(0);
killedBy: SettingsScreen chrome shows the LLM switch off before the stored consent resolves
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/screens/SettingsScreen.tsx:77:29
         setLlmAvailable(Boolean(m?.llm_available));
         // Sharing is fail-closed: only a server that explicitly advertises
         // verified-clinician sharing may expose a pairing flow.
-        setSharingAvailable(m?.sharing_available === true);
+        setSharingAvailable(m?.sharing_available !== true);
         // Stryker disable next-line OptionalChaining: with m null/undefined, typeof m.version throws into the same .catch(() => {}) — no observable difference (the typeof guard itself stays live)
         if (typeof m?.version === "string") setServerVersion(m.version);
killedBy: therapist sharing entry point navigates to the share screen
statusReason: no Text node containing "Share with my therapist":

[Killed] BooleanLiteral
src/screens/SettingsScreen.tsx:77:54
         setLlmAvailable(Boolean(m?.llm_available));
         // Sharing is fail-closed: only a server that explicitly advertises
         // verified-clinician sharing may expose a pairing flow.
-        setSharingAvailable(m?.sharing_available === true);
+        setSharingAvailable(m?.sharing_available === false);
         // Stryker disable next-line OptionalChaining: with m null/undefined, typeof m.version throws into the same .catch(() => {}) — no observable difference (the typeof guard itself stays live)
         if (typeof m?.version === "string") setServerVersion(m.version);
killedBy: therapist sharing entry point navigates to the share screen
statusReason: no Text node containing "Share with my therapist":

[Killed] BooleanLiteral
src/screens/SettingsScreen.tsx:97:9
 
   const saveUrl = async () => {
     const parsed = parseServerUrl(url);
-    if (!parsed) {
+    if (parsed) {
       Alert.alert("Invalid URL", "Enter a full URL like https://your-server:8000");
       return;
killedBy: SettingsScreen chrome hands cleartext URLs directly to the fail-closed client without a consent dialog
statusReason: expected "vi.fn()" to be called with arguments: [ 'http://nas.lan:8000' ]

Number of calls: 0

[NoCoverage] StringLiteral
src/screens/SettingsScreen.tsx:114:41
     try {
       const userId = await api.getUserId();
       if (!userId) {
-        Alert.alert("Sign in required", "Sign in again before retrying saved entries.");
+        Alert.alert("Sign in required", "");
         return;
       }

[NoCoverage] StringLiteral
src/screens/SettingsScreen.tsx:114:21
     try {
       const userId = await api.getUserId();
       if (!userId) {
-        Alert.alert("Sign in required", "Sign in again before retrying saved entries.");
+        Alert.alert("", "Sign in again before retrying saved entries.");
         return;
       }

[Killed] StringLiteral
src/screens/SettingsScreen.tsx:122:9
       const left = await rejectedEntryCount(userId);
       setRejectedCount(left);
       Alert.alert(
-        "Recovered entries",
+        "",
         moved > 0
           ? `${moved} ${moved === 1 ? "entry" : "entries"} moved back into the sync queue — ${left === 0 ? "they upload on the next sync." : `${left} still waiting.`}`
killedBy: recovered entries surface offers one-tap recovery when rejected entries exist (requeue + flush)
statusReason: expected "vi.fn()" to be called with arguments: [ 'Recovered entries', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "Recovered entries",

[Killed] EqualityOperator
src/screens/SettingsScreen.tsx:123:9
       setRejectedCount(left);
       Alert.alert(
         "Recovered entries",
-        moved > 0
+        moved >= 0
           ? `${moved} ${moved === 1 ? "entry" : "entries"} moved back into the sync queue — ${left === 0 ? "they upload on the next sync." : `${left} still waiting.`}`
           : "Nothing could be moved yet — the entries stay safely stored on this device.",
killedBy: recovered entries surface reports honestly when nothing could be moved yet
statusReason: expected "vi.fn()" to be called with arguments: [ 'Recovered entries', …(1) ]

Received:

  1st vi.fn() call:

  [
    "Recovered entries",

[Killed] StringLiteral
src/screens/SettingsScreen.tsx:128:38
           : "Nothing could be moved yet — the entries stay safely stored on this device.",
       );
     } catch {
-      Alert.alert("Could not retry", "The saved entries are still safe on this device.");
+      Alert.alert("Could not retry", "");
     } finally {
       setBusy(false);
killedBy: recovered entries surface a requeue failure reassures instead of alarming
statusReason: expected "vi.fn()" to be called with arguments: [ 'Could not retry', …(1) ]

Received:

  1st vi.fn() call:

  [
    "Could not retry",

[Killed] ConditionalExpression
src/screens/SettingsScreen.tsx:137:9
   /** Destructive flows land here FIRST — the actual action only runs after
    *  the typed password re-derives the vault's own auth key. */
   const confirmWithPassword = async () => {
-    if (!pending || busy || !password) return;
+    if (false) return;
     setBusy(true);
     // done: the flow concluded (success or unrecoverable) — clear the card.
killedBy: SettingsScreen pins: the password re-auth card a leaked second Confirm press while the verifier is busy is swallowed by the guard
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BooleanLiteral
src/screens/SettingsScreen.tsx:146:11
     const retry = () => { setBusy(false); setPassword(""); };
     try {
       const reauth = await verifyPasswordForVault(password);
-      if (!reauth.ok) {
+      if (reauth.ok) {
         const messages = {
           locked: "The vault is locked — unlock again first.",
killedBy: SettingsScreen pins: the password re-auth card a rejected password retries in place: card up, password cleared, busy reset
statusReason: expected "vi.fn()" to be called with arguments: [ 'Could not verify', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
src/screens/SettingsScreen.tsx:157:11
         retry();
         return;
       }
-      if (pending.kind === "llm") {
+      if (false) {
         const result = await api.setLlmConsent(pending.enabled, reauth.verifierB64);
         setLlmEnabled(result.enabled);
killedBy: SettingsScreen chrome disables the switch and buttons while the verified consent save is busy, and resets after
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/screens/SettingsScreen.tsx:157:11
         retry();
         return;
       }
-      if (pending.kind === "llm") {
+      if (pending.kind !== "llm") {
         const result = await api.setLlmConsent(pending.enabled, reauth.verifierB64);
         setLlmEnabled(result.enabled);
killedBy: SettingsScreen pins: delete failure copy a 401 delete reports the exact dead-session sentence (not the calm fallback's shorter one)
statusReason: expected "vi.fn()" to be called with arguments: [ 'Delete failed', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "Delete failed",

[Killed] StringLiteral
src/screens/SettingsScreen.tsx:175:40
       if (isSessionExpiredError(err)) {
         // 401: the client hook has already locked the vault; the stack is
         // about to swap to Unlock. Say why.
-        Alert.alert("Session expired", "Please unlock again.");
+        Alert.alert("Session expired", "");
       } else {
         Alert.alert("Could not complete", calmFallbackCopy(err, "Something went wrong — try again."));
killedBy: verification-failure branching (403 vs 401) a 401 on the LLM toggle reports the dead session (vault already locked by the hook)
statusReason: expected "vi.fn()" to be called with arguments: [ 'Session expired', …(1) ]

Received:

  1st vi.fn() call:

  [
    "Session expired",

[Killed] StringLiteral
src/screens/SettingsScreen.tsx:177:65
         // about to swap to Unlock. Say why.
         Alert.alert("Session expired", "Please unlock again.");
       } else {
-        Alert.alert("Could not complete", calmFallbackCopy(err, "Something went wrong — try again."));
+        Alert.alert("Could not complete", calmFallbackCopy(err, ""));
       }
       done();
killedBy: LLM consent toggle reports failures and keeps the old state
statusReason: expected "vi.fn()" to be called with arguments: [ 'Could not complete', …(1) ]

Received:

  1st vi.fn() call:

  [
    "Could not complete",

[Killed] BlockStatement
src/screens/SettingsScreen.tsx:219:43
     } catch (err) {
       // The server still holds the account — keep the local session intact
       // so the user can retry instead of believing it worked.
-      if (isVerificationFailedError(err)) {
-        Alert.alert("Delete failed", "The server didn't accept that password. Nothing was deleted — check it and try again.");
-      } else if (isSessionExpiredError(err)) {
+      if (isVerificationFailedError(err)) {} else if (isSessionExpiredError(err)) {
         Alert.alert("Delete failed", "Session expired — please unlock again. Nothing was deleted.");
       } else {
killedBy: verification-failure branching (403 vs 401) a 403 on account deletion keeps the session and offers a retry
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Received:

  1st vi.fn() call:

  [
-   "Delete failed",

[Killed] StringLiteral
src/screens/SettingsScreen.tsx:220:38
       // The server still holds the account — keep the local session intact
       // so the user can retry instead of believing it worked.
       if (isVerificationFailedError(err)) {
-        Alert.alert("Delete failed", "The server didn't accept that password. Nothing was deleted — check it and try again.");
+        Alert.alert("Delete failed", "");
       } else if (isSessionExpiredError(err)) {
         Alert.alert("Delete failed", "Session expired — please unlock again. Nothing was deleted.");
killedBy: verification-failure branching (403 vs 401) a 403 on account deletion keeps the session and offers a retry
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Received:

  1st vi.fn() call:

  [
-   "Delete failed",

[Killed] StringLiteral
src/screens/SettingsScreen.tsx:220:21
       // The server still holds the account — keep the local session intact
       // so the user can retry instead of believing it worked.
       if (isVerificationFailedError(err)) {
-        Alert.alert("Delete failed", "The server didn't accept that password. Nothing was deleted — check it and try again.");
+        Alert.alert("", "The server didn't accept that password. Nothing was deleted — check it and try again.");
       } else if (isSessionExpiredError(err)) {
         Alert.alert("Delete failed", "Session expired — please unlock again. Nothing was deleted.");
killedBy: verification-failure branching (403 vs 401) a 403 on account deletion keeps the session and offers a retry
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Received:

  1st vi.fn() call:

  [
-   "Delete failed",

[Killed] StringLiteral
src/screens/SettingsScreen.tsx:224:21
       } else if (isSessionExpiredError(err)) {
         Alert.alert("Delete failed", "Session expired — please unlock again. Nothing was deleted.");
       } else {
-        Alert.alert("Delete failed", calmFallbackCopy(err, "Something went wrong — try again."));
+        Alert.alert("", calmFallbackCopy(err, "Something went wrong — try again."));
       }
     }
killedBy: destructive delete keeps the session intact when the server refuses, so retry is possible
statusReason: expected "vi.fn()" to be called with arguments: [ 'Delete failed', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "Delete failed",

[Killed] StringLiteral
src/screens/SettingsScreen.tsx:243:7
 
   const deleteEverything = () => {
     Alert.alert(
-      "Delete everything?",
+      "",
       "All entries, patterns and your account will be permanently deleted from the server. " +
         "Your local encrypted queue is also wiped. This cannot be undone. You will be asked for your password.",
killedBy: destructive delete requires two confirmations and the sign-in key
statusReason: expected '' to be 'Delete everything?' // Object.is equality

[Killed] StringLiteral
src/screens/SettingsScreen.tsx:244:7
   const deleteEverything = () => {
     Alert.alert(
       "Delete everything?",
-      "All entries, patterns and your account will be permanently deleted from the server. " +
+      "" +
         "Your local encrypted queue is also wiped. This cannot be undone. You will be asked for your password.",
       [
killedBy: destructive delete requires two confirmations and the sign-in key
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA=",

[Killed] ArrayDeclaration
src/screens/SettingsScreen.tsx:246:7
       "Delete everything?",
       "All entries, patterns and your account will be permanently deleted from the server. " +
         "Your local encrypted queue is also wiped. This cannot be undone. You will be asked for your password.",
-      [
-        { text: "Cancel", style: "cancel" },
-        {
-          text: "Continue",
-          style: "destructive",
-          onPress: () =>
-            Alert.alert("Final confirmation", "Deleting is irreversible. You will be asked for your password next.", [
-              { text: "Cancel", style: "cancel" },
-              // The password prompt below IS the real confirmation.
-              { text: "Continue to password", style: "destructive", onPress: () => setPending({ kind: "delete" }) },
-            ]),
-        },
-      ],
+      [],
     );
   };
killedBy: destructive delete requires two confirmations and the sign-in key
statusReason: no alert button "Cancel"; buttons: []

[Killed] StringLiteral
src/screens/SettingsScreen.tsx:247:17
       "All entries, patterns and your account will be permanently deleted from the server. " +
         "Your local encrypted queue is also wiped. This cannot be undone. You will be asked for your password.",
       [
-        { text: "Cancel", style: "cancel" },
+        { text: "", style: "cancel" },
         {
           text: "Continue",
killedBy: destructive delete requires two confirmations and the sign-in key
statusReason: no alert button "Cancel"; buttons: [{"text":"","style":"cancel"},{"text":"Continue","style":"destructive"}]

[Killed] ObjectLiteral
src/screens/SettingsScreen.tsx:248:9
         "Your local encrypted queue is also wiped. This cannot be undone. You will be asked for your password.",
       [
         { text: "Cancel", style: "cancel" },
-        {
-          text: "Continue",
-          style: "destructive",
-          onPress: () =>
-            Alert.alert("Final confirmation", "Deleting is irreversible. You will be asked for your password next.", [
-              { text: "Cancel", style: "cancel" },
-              // The password prompt below IS the real confirmation.
-              { text: "Continue to password", style: "destructive", onPress: () => setPending({ kind: "delete" }) },
-            ]),
-        },
+        {},
       ],
     );
killedBy: destructive delete requires two confirmations and the sign-in key
statusReason: no alert button "Continue"; buttons: [{"text":"Cancel","style":"cancel"},{}]

[Killed] StringLiteral
src/screens/SettingsScreen.tsx:252:47
           text: "Continue",
           style: "destructive",
           onPress: () =>
-            Alert.alert("Final confirmation", "Deleting is irreversible. You will be asked for your password next.", [
+            Alert.alert("Final confirmation", "", [
               { text: "Cancel", style: "cancel" },
               // The password prompt below IS the real confirmation.
killedBy: destructive delete requires two confirmations and the sign-in key
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA=",

[Survived] ArrayDeclaration
src/screens/SettingsScreen.tsx:273:6
   const [biometrics] = useState(biometricCapability());
   React.useEffect(() => {
     void loadHapticsSetting().then(setHaptics);
-  }, []);
+  }, ["Stryker was here"]);
   React.useEffect(() => {
     let cancelled = false;

[Killed] LogicalOperator
src/screens/SettingsScreen.tsx:280:28
       try {
         const AsyncStorage = (await import("@react-native-async-storage/async-storage")).default;
         const stored = await AsyncStorage.getItem(themeStorageKey());
-        if (!cancelled && (stored === "dark" || stored === "light" || stored === "system")) {
+        if (!cancelled && (stored === "dark" && stored === "light" || stored === "system")) {
           setThemeModeState(stored);
         }
killedBy: theme radio initial value shows the provider default while the persisted read is in flight — never a palette-derived value
statusReason: expected { selected: false } to deeply equal { selected: true }

[Killed] BooleanLiteral
src/screens/SettingsScreen.tsx:280:13
       try {
         const AsyncStorage = (await import("@react-native-async-storage/async-storage")).default;
         const stored = await AsyncStorage.getItem(themeStorageKey());
-        if (!cancelled && (stored === "dark" || stored === "light" || stored === "system")) {
+        if (cancelled && (stored === "dark" || stored === "light" || stored === "system")) {
           setThemeModeState(stored);
         }
killedBy: theme radio initial value shows the provider default while the persisted read is in flight — never a palette-derived value
statusReason: expected { selected: false } to deeply equal { selected: true }

[Killed] ObjectLiteral
src/screens/SettingsScreen.tsx:293:12
   }, []);
 
   const themed = {
-    label: { color: t.colors.muted, fontSize: 12, fontWeight: "700" as const, letterSpacing: 1, marginTop: 8 },
+    label: {},
     input: {
       backgroundColor: t.colors.card,
killedBy: SettingsScreen chrome pins the visual language of the screen
statusReason: style not rendered: {"color":"#8a91a3","fontSize":12,"fontWeight":"700","letterSpacing":1,"marginTop":8}
rendered styles:
{"flex":1}
{"backgroundColor":"#0f1115","padding":24,"gap":14}
{"padding":16,"alignItems":"center","justifyContent":"center"}
{"backgroundColor":"#242a38","borderRadius":10,"minHeight":44}
{"fontWeight":"700"}
{"color":"#e8eaf0","fontSize":14}

[Survived] ObjectLiteral
src/screens/SettingsScreen.tsx:309:30
     <ScrollView
       style={[styles.container, { backgroundColor: t.colors.bg, padding: t.spacing.xxl, gap: 14 }]}
       onTouchStart={touchActivity}
-      contentContainerStyle={{ paddingBottom: t.spacing.xxxl }}
+      contentContainerStyle={{}}
     >
       {/* Crisis help: one tap from here, works offline (see CrisisScreen). */}

[Killed] ConditionalExpression
src/screens/SettingsScreen.tsx:314:8
       {/* Crisis help: one tap from here, works offline (see CrisisScreen). */}
       <CrisisHelpButton onPress={() => navigation.navigate("Crisis")} />
 
-      {rejectedCount > 0 && (
+      {true && (
         <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}>
           <Text style={themed.rowText}>
killedBy: recovered entries surface is hidden when the rejected store is empty
statusReason: expected 'Need help now? Crisis resources 0 ent…' not to contain 'couldn\'t sync'

[Killed] LogicalOperator
src/screens/SettingsScreen.tsx:329:8
           />
         </View>
       )}
-      {quarantined && (
-        <Text style={themed.footnote}>
-          A damaged piece of the offline queue was set aside instead of deleted. New entries sync
-          normally.
-        </Text>
-      )}
+      {quarantined || <Text style={themed.footnote}>
+          A damaged piece of the offline queue was set aside instead of deleted. New entries sync
+          normally.
+        </Text>}
       {legacyQueueRecovery && (
         <View style={[styles.card, { backgroundColor: t.colors.card, borderColor: t.colors.border, borderWidth: 1, borderRadius: t.radius.lg }]} accessibilityRole="alert">
killedBy: recovered entries surface shows the quarantine notice when a corrupt queue payload was set aside
statusReason: expected 'Need help now? Crisis resources APPEA…' to contain 'damaged piece of the offline queue wa…'

[Killed] ObjectLiteral
src/screens/SettingsScreen.tsx:347:37
       {llmAvailable && (
         <>
           <Text style={themed.label}>Third-party AI analysis</Text>
-          <View style={[styles.row, { backgroundColor: t.colors.card, borderRadius: t.radius.md }]}>
+          <View style={[styles.row, {}]}>
             <Text style={themed.rowText}>
               Allow sending your (decrypted) entries to an external AI service for pattern analysis.
killedBy: SettingsScreen chrome pins the visual language of the screen
statusReason: style not rendered: {"backgroundColor":"#1a1e26","borderRadius":10}
rendered styles:
{"flex":1}
{"backgroundColor":"#0f1115","padding":24,"gap":14}
{"padding":16,"alignItems":"center","justifyContent":"center"}
{"backgroundColor":"#242a38","borderRadius":10,"minHeight":44}
{"fontWeight":"700"}
{"color":"#e8eaf0","fontSize":14}

[Killed] StringLiteral
src/screens/SettingsScreen.tsx:355:62
             <Switch
               value={llmEnabled}
               disabled={busy}
-              onValueChange={(enabled) => setPending({ kind: "llm", enabled })}
+              onValueChange={(enabled) => setPending({ kind: "", enabled })}
               trackColor={{ true: t.colors.primaryBright, false: t.colors.cardDeep }}
               accessibilityLabel="Allow third-party AI analysis"
killedBy: SettingsScreen chrome disables the switch and buttons while the verified consent save is busy, and resets after
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/screens/SettingsScreen.tsx:356:27
               value={llmEnabled}
               disabled={busy}
               onValueChange={(enabled) => setPending({ kind: "llm", enabled })}
-              trackColor={{ true: t.colors.primaryBright, false: t.colors.cardDeep }}
+              trackColor={{}}
               accessibilityLabel="Allow third-party AI analysis"
               accessibilityState={{ checked: llmEnabled, disabled: busy }}
killedBy: SettingsScreen chrome loads the stored URL, insecure consent and LLM state on mount
statusReason: expected {} to deeply equal { true: '#4f7cff', false: '#141821' }

[Killed] ArrayDeclaration
src/screens/SettingsScreen.tsx:364:22
         </>
       )}
       {pending && (
-        <View style={[styles.reauthCard, { backgroundColor: t.colors.cardDeep, borderRadius: t.radius.lg }]}>
+        <View style={[]}>
           <Text style={[styles.reauthTitle, { color: t.colors.text }]}>
             {pending.kind === "delete"
killedBy: SettingsScreen pins: node-exact style contracts the re-auth card and its title carry their full style arrays
statusReason: expected [] to deeply equal [ { padding: 16, gap: 12 }, { …(2) } ]

[Killed] EqualityOperator
src/screens/SettingsScreen.tsx:366:14
       {pending && (
         <View style={[styles.reauthCard, { backgroundColor: t.colors.cardDeep, borderRadius: t.radius.lg }]}>
           <Text style={[styles.reauthTitle, { color: t.colors.text }]}>
-            {pending.kind === "delete"
+            {pending.kind !== "delete"
               ? "Enter your password to delete everything"
               : `Enter your password to ${pending.enabled ? "enable" : "disable"} third-party AI analysis`}
killedBy: SettingsScreen pins: the password re-auth card a rejected password retries in place: card up, password cleared, busy reset
statusReason: expected 'Need help now? Crisis resources Third…' to contain 'Enter your password to enable'

[Killed] StringLiteral
src/screens/SettingsScreen.tsx:381:27
             textContentType="password"
           />
           <PrimaryButton
-            label={busy ? "Verifying…" : "Confirm with password"}
+            label={busy ? "" : "Confirm with password"}
             onPress={confirmWithPassword}
             disabled={!password}
killedBy: SettingsScreen pins: the password re-auth card a leaked second Confirm press while the verifier is busy is swallowed by the guard
statusReason: no Text node containing "Verifying…":

[Killed] EqualityOperator
src/screens/SettingsScreen.tsx:384:21
             label={busy ? "Verifying…" : "Confirm with password"}
             onPress={confirmWithPassword}
             disabled={!password}
-            danger={pending.kind === "delete"}
+            danger={pending.kind !== "delete"}
             accessibilityLabel="Confirm with password"
           />
killedBy: SettingsScreen pins: the password re-auth card the Confirm fill is danger red only for the delete kind (primary for llm)
statusReason: expected { backgroundColor: '#c0392b', …(1) } to deeply equal { backgroundColor: '#3b5bdb', …(1) }

[Survived] ArrayDeclaration
src/screens/SettingsScreen.tsx:404:22
           {(["system", "dark", "light"] as ThemeMode[]).map((mode) => (
             <TouchableOpacity
               key={mode}
-              style={[
-                styles.moodOptionLike,
-                {
-                  backgroundColor: themeMode === mode ? t.colors.primary : t.colors.cardDeep,
-                  borderRadius: t.radius.md,
-                  minHeight: 40,
-                },
-              ]}
+              style={[]}
               onPress={() => {
                 touchActivity();

[Survived] ObjectLiteral
src/screens/SettingsScreen.tsx:406:17
               key={mode}
               style={[
                 styles.moodOptionLike,
-                {
-                  backgroundColor: themeMode === mode ? t.colors.primary : t.colors.cardDeep,
-                  borderRadius: t.radius.md,
-                  minHeight: 40,
-                },
+                {},
               ]}
               onPress={() => {

[Killed] ConditionalExpression
src/screens/SettingsScreen.tsx:418:47
                 setThemeMode(mode);
               }}
               accessibilityRole="radio"
-              accessibilityState={{ selected: themeMode === mode }}
+              accessibilityState={{ selected: true }}
               accessibilityLabel={`Theme: ${mode}`}
             >
killedBy: theme radio initial value shows the provider default while the persisted read is in flight — never a palette-derived value
statusReason: expected { selected: true } to deeply equal { selected: false }

[Survived] ConditionalExpression
src/screens/SettingsScreen.tsx:422:49
               accessibilityLabel={`Theme: ${mode}`}
             >
               <Text style={{ color: themeMode === mode ? t.colors.onPrimary : t.colors.body, fontSize: 13 }}>
-                {mode === "system" ? "System" : mode === "dark" ? "Dark" : "Light"}
+                {mode === "system" ? "System" : true ? "Dark" : "Light"}
               </Text>
             </TouchableOpacity>

[Killed] BooleanLiteral
src/screens/SettingsScreen.tsx:439:10
             accessibilityLabel="Haptics"
           />
         </View>
-        {!reminders.available && (
+        {reminders.available && (
           <Text style={themed.footnote}>
             Daily reminders will appear here once the notification module is linked in the app build.
killedBy: About and Advanced sections the daily-reminder row is honest: no fake control until the native module is linked
statusReason: expected 'Need help now? Crisis resources APPEA…' to contain 'notification module is linked'

[Killed] ConditionalExpression
src/screens/SettingsScreen.tsx:439:10
             accessibilityLabel="Haptics"
           />
         </View>
-        {!reminders.available && (
-          <Text style={themed.footnote}>
-            Daily reminders will appear here once the notification module is linked in the app build.
-          </Text>
-        )}
+        {true}
         {!biometrics.available && (
           <Text style={themed.footnote}>
killedBy: About and Advanced sections the daily-reminder row is honest: no fake control until the native module is linked
statusReason: expected 'Need help now? Crisis resources APPEA…' to contain 'notification module is linked'

[Survived] ConditionalExpression
src/screens/SettingsScreen.tsx:444:10
             Daily reminders will appear here once the notification module is linked in the app build.
           </Text>
         )}
-        {!biometrics.available && (
-          <Text style={themed.footnote}>
-            Face/fingerprint unlock will appear here once the biometric module is linked in the app build.
-          </Text>
-        )}
+        {true}
       </View>
 
