[Killed] BooleanLiteral
src/haptics.ts:17:15
 import AsyncStorage from "@react-native-async-storage/async-storage";
 
 const HAPTICS_KEY = "@mindpattern/haptics.enabled";
-let enabled = true;
+let enabled = false;
 let loaded = false;
 
killedBy: haptics vibrates 10ms by default (the lightest selection pulse)
statusReason: expected "vi.fn()" to be called with arguments: [ 10 ]

Number of calls: 0

[Survived] BooleanLiteral
src/haptics.ts:18:14
 
 const HAPTICS_KEY = "@mindpattern/haptics.enabled";
 let enabled = true;
-let loaded = false;
+let loaded = true;
 
 export async function loadHapticsSetting(): Promise<boolean> {

[Killed] BlockStatement
src/haptics.ts:20:62
 let enabled = true;
 let loaded = false;
 
-export async function loadHapticsSetting(): Promise<boolean> {
-  try {
-    const stored = await AsyncStorage.getItem(HAPTICS_KEY);
-    enabled = stored !== "off";
-  } catch {
-    enabled = true;
-  }
-  loaded = true;
-  return enabled;
-}
+export async function loadHapticsSetting(): Promise<boolean> {}
 
 export async function setHapticsEnabled(on: boolean): Promise<void> {
killedBy: haptics a stored 'off' loads as disabled
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/haptics.ts:21:7
 let loaded = false;
 
 export async function loadHapticsSetting(): Promise<boolean> {
-  try {
-    const stored = await AsyncStorage.getItem(HAPTICS_KEY);
-    enabled = stored !== "off";
-  } catch {
+  try {} catch {
     enabled = true;
   }
killedBy: haptics a stored 'off' loads as disabled
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/haptics.ts:23:15
 export async function loadHapticsSetting(): Promise<boolean> {
   try {
     const stored = await AsyncStorage.getItem(HAPTICS_KEY);
-    enabled = stored !== "off";
+    enabled = true;
   } catch {
     enabled = true;
killedBy: haptics a stored 'off' loads as disabled
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/haptics.ts:23:15
 export async function loadHapticsSetting(): Promise<boolean> {
   try {
     const stored = await AsyncStorage.getItem(HAPTICS_KEY);
-    enabled = stored !== "off";
+    enabled = stored === "off";
   } catch {
     enabled = true;
killedBy: haptics a stored 'off' loads as disabled
statusReason: expected true to be false // Object.is equality

[NoCoverage] BlockStatement
src/haptics.ts:24:11
   try {
     const stored = await AsyncStorage.getItem(HAPTICS_KEY);
     enabled = stored !== "off";
-  } catch {
-    enabled = true;
-  }
+  } catch {}
   loaded = true;
   return enabled;

[NoCoverage] BooleanLiteral
src/haptics.ts:25:15
     const stored = await AsyncStorage.getItem(HAPTICS_KEY);
     enabled = stored !== "off";
   } catch {
-    enabled = true;
+    enabled = false;
   }
   loaded = true;

[Survived] BooleanLiteral
src/haptics.ts:27:12
   } catch {
     enabled = true;
   }
-  loaded = true;
+  loaded = false;
   return enabled;
 }

[Killed] BlockStatement
src/haptics.ts:31:69
   return enabled;
 }
 
-export async function setHapticsEnabled(on: boolean): Promise<void> {
-  enabled = on;
-  try {
-    await AsyncStorage.setItem(HAPTICS_KEY, on ? "on" : "off");
-  } catch {
-    // Persistence failure leaves the setting effective for this session.
-  }
-}
+export async function setHapticsEnabled(on: boolean): Promise<void> {}
 
 export function hapticsEnabled(): boolean {
killedBy: haptics disabling silences every call and persists (storage receives 'off')
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      10,

[Survived] BlockStatement
src/haptics.ts:33:7
 
 export async function setHapticsEnabled(on: boolean): Promise<void> {
   enabled = on;
-  try {
-    await AsyncStorage.setItem(HAPTICS_KEY, on ? "on" : "off");
-  } catch {
+  try {} catch {
     // Persistence failure leaves the setting effective for this session.
   }

[Survived] StringLiteral
src/haptics.ts:34:57
 export async function setHapticsEnabled(on: boolean): Promise<void> {
   enabled = on;
   try {
-    await AsyncStorage.setItem(HAPTICS_KEY, on ? "on" : "off");
+    await AsyncStorage.setItem(HAPTICS_KEY, on ? "on" : "");
   } catch {
     // Persistence failure leaves the setting effective for this session.

[Survived] StringLiteral
src/haptics.ts:34:50
 export async function setHapticsEnabled(on: boolean): Promise<void> {
   enabled = on;
   try {
-    await AsyncStorage.setItem(HAPTICS_KEY, on ? "on" : "off");
+    await AsyncStorage.setItem(HAPTICS_KEY, on ? "" : "off");
   } catch {
     // Persistence failure leaves the setting effective for this session.

[NoCoverage] BlockStatement
src/haptics.ts:40:43
   }
 }
 
-export function hapticsEnabled(): boolean {
-  return enabled;
-}
+export function hapticsEnabled(): boolean {}
 
 /** The one pulse the app uses: a 10ms tap. No patterns, no alerts. */

[Killed] BlockStatement
src/haptics.ts:45:37
 }
 
 /** The one pulse the app uses: a 10ms tap. No patterns, no alerts. */
-export function lightHaptic(): void {
-  if (!enabled) return;
-  try {
-    Vibration.vibrate(10);
-  } catch {
-    // Unsupported platform or permission: silence is fine.
-  }
-}
+export function lightHaptic(): void {}
 
killedBy: haptics vibrates 10ms by default (the lightest selection pulse)
statusReason: expected "vi.fn()" to be called with arguments: [ 10 ]

Number of calls: 0

[Killed] BooleanLiteral
src/haptics.ts:46:7
 
 /** The one pulse the app uses: a 10ms tap. No patterns, no alerts. */
 export function lightHaptic(): void {
-  if (!enabled) return;
+  if (enabled) return;
   try {
     Vibration.vibrate(10);
killedBy: haptics vibrates 10ms by default (the lightest selection pulse)
statusReason: expected "vi.fn()" to be called with arguments: [ 10 ]

Number of calls: 0

[Killed] ConditionalExpression
src/haptics.ts:46:7
 
 /** The one pulse the app uses: a 10ms tap. No patterns, no alerts. */
 export function lightHaptic(): void {
-  if (!enabled) return;
+  if (true) return;
   try {
     Vibration.vibrate(10);
killedBy: haptics vibrates 10ms by default (the lightest selection pulse)
statusReason: expected "vi.fn()" to be called with arguments: [ 10 ]

Number of calls: 0

[Killed] BlockStatement
src/haptics.ts:47:7
 /** The one pulse the app uses: a 10ms tap. No patterns, no alerts. */
 export function lightHaptic(): void {
   if (!enabled) return;
-  try {
-    Vibration.vibrate(10);
-  } catch {
+  try {} catch {
     // Unsupported platform or permission: silence is fine.
   }
killedBy: haptics vibrates 10ms by default (the lightest selection pulse)
statusReason: expected "vi.fn()" to be called with arguments: [ 10 ]

Number of calls: 0

[Killed] CallExpression
src/haptics.ts:48:5
 export function lightHaptic(): void {
   if (!enabled) return;
   try {
-    Vibration.vibrate(10);
+    ;
   } catch {
     // Unsupported platform or permission: silence is fine.
killedBy: haptics vibrates 10ms by default (the lightest selection pulse)
statusReason: expected "vi.fn()" to be called with arguments: [ 10 ]

Number of calls: 0
