[Killed] MethodExpression
src/moodLog.ts:162:21
   try {
     await serialized(async () => {
       const { days } = await read(keyCopy, userId);
-      const clean = Math.max(-1, Math.min(1, value));
+      const clean = Math.min(-1, Math.min(1, value));
       const existing = days.findIndex((d) => d.date === date);
       const prior = existing >= 0 ? days[existing] : undefined;
killedBy: moodLog records and returns days oldest-first
statusReason: expected [ -1, -1 ] to deeply equal [ -0.5, 0.25 ]

[Killed] ConditionalExpression
src/moodLog.ts:163:46
     await serialized(async () => {
       const { days } = await read(keyCopy, userId);
       const clean = Math.max(-1, Math.min(1, value));
-      const existing = days.findIndex((d) => d.date === date);
+      const existing = days.findIndex((d) => true);
       const prior = existing >= 0 ? days[existing] : undefined;
       const cleanEnergy =
killedBy: moodLog records and returns days oldest-first
statusReason: expected [ 0.25 ] to deeply equal [ -0.5, 0.25 ]

[Killed] EqualityOperator
src/moodLog.ts:163:46
     await serialized(async () => {
       const { days } = await read(keyCopy, userId);
       const clean = Math.max(-1, Math.min(1, value));
-      const existing = days.findIndex((d) => d.date === date);
+      const existing = days.findIndex((d) => d.date !== date);
       const prior = existing >= 0 ? days[existing] : undefined;
       const cleanEnergy =
killedBy: moodLog records and returns days oldest-first
statusReason: expected [ 0.25 ] to deeply equal [ -0.5, 0.25 ]

[Survived] EqualityOperator
src/moodLog.ts:164:21
       const { days } = await read(keyCopy, userId);
       const clean = Math.max(-1, Math.min(1, value));
       const existing = days.findIndex((d) => d.date === date);
-      const prior = existing >= 0 ? days[existing] : undefined;
+      const prior = existing < 0 ? days[existing] : undefined;
       const cleanEnergy =
         energy === null

[Survived] ConditionalExpression
src/moodLog.ts:164:21
       const { days } = await read(keyCopy, userId);
       const clean = Math.max(-1, Math.min(1, value));
       const existing = days.findIndex((d) => d.date === date);
-      const prior = existing >= 0 ? days[existing] : undefined;
+      const prior = true ? days[existing] : undefined;
       const cleanEnergy =
         energy === null

[Survived] EqualityOperator
src/moodLog.ts:166:9
       const existing = days.findIndex((d) => d.date === date);
       const prior = existing >= 0 ? days[existing] : undefined;
       const cleanEnergy =
-        energy === null
+        energy !== null
           ? undefined
           : typeof energy === "number" && Number.isFinite(energy)

[Survived] ConditionalExpression
src/moodLog.ts:166:9
       const existing = days.findIndex((d) => d.date === date);
       const prior = existing >= 0 ? days[existing] : undefined;
       const cleanEnergy =
-        energy === null
+        true
           ? undefined
           : typeof energy === "number" && Number.isFinite(energy)

[Survived] ConditionalExpression
src/moodLog.ts:168:13
       const cleanEnergy =
         energy === null
           ? undefined
-          : typeof energy === "number" && Number.isFinite(energy)
+          : false
             ? Math.max(-1, Math.min(1, energy))
             : prior?.energy;

[Survived] ConditionalExpression
src/moodLog.ts:168:13
       const cleanEnergy =
         energy === null
           ? undefined
-          : typeof energy === "number" && Number.isFinite(energy)
+          : true
             ? Math.max(-1, Math.min(1, energy))
             : prior?.energy;

[NoCoverage] MethodExpression
src/moodLog.ts:169:28
         energy === null
           ? undefined
           : typeof energy === "number" && Number.isFinite(energy)
-            ? Math.max(-1, Math.min(1, energy))
+            ? Math.max(-1, Math.max(1, energy))
             : prior?.energy;
       const day: MoodDay = cleanEnergy === undefined ? { date, value: clean } : { date, value: clean, energy: cleanEnergy };

[NoCoverage] MethodExpression
src/moodLog.ts:169:15
         energy === null
           ? undefined
           : typeof energy === "number" && Number.isFinite(energy)
-            ? Math.max(-1, Math.min(1, energy))
+            ? Math.min(-1, Math.min(1, energy))
             : prior?.energy;
       const day: MoodDay = cleanEnergy === undefined ? { date, value: clean } : { date, value: clean, energy: cleanEnergy };

[Killed] OptionalChaining
src/moodLog.ts:170:15
           ? undefined
           : typeof energy === "number" && Number.isFinite(energy)
             ? Math.max(-1, Math.min(1, energy))
-            : prior?.energy;
+            : prior.energy;
       const day: MoodDay = cleanEnergy === undefined ? { date, value: clean } : { date, value: clean, energy: cleanEnergy };
       if (existing >= 0) days[existing] = day;
killedBy: moodLog pins: MAX_DAYS write cap recording the 401st day drops exactly the oldest day (400 survive)
statusReason: Cannot read properties of undefined (reading 'energy')

[Survived] ConditionalExpression
src/moodLog.ts:171:28
           : typeof energy === "number" && Number.isFinite(energy)
             ? Math.max(-1, Math.min(1, energy))
             : prior?.energy;
-      const day: MoodDay = cleanEnergy === undefined ? { date, value: clean } : { date, value: clean, energy: cleanEnergy };
+      const day: MoodDay = true ? { date, value: clean } : { date, value: clean, energy: cleanEnergy };
       if (existing >= 0) days[existing] = day;
       else days.push(day);

[Survived] EqualityOperator
src/moodLog.ts:171:28
           : typeof energy === "number" && Number.isFinite(energy)
             ? Math.max(-1, Math.min(1, energy))
             : prior?.energy;
-      const day: MoodDay = cleanEnergy === undefined ? { date, value: clean } : { date, value: clean, energy: cleanEnergy };
+      const day: MoodDay = cleanEnergy !== undefined ? { date, value: clean } : { date, value: clean, energy: cleanEnergy };
       if (existing >= 0) days[existing] = day;
       else days.push(day);

[Killed] ConditionalExpression
src/moodLog.ts:172:11
             ? Math.max(-1, Math.min(1, energy))
             : prior?.energy;
       const day: MoodDay = cleanEnergy === undefined ? { date, value: clean } : { date, value: clean, energy: cleanEnergy };
-      if (existing >= 0) days[existing] = day;
+      if (true) days[existing] = day;
       else days.push(day);
       await write(keyCopy, userId, days);
killedBy: moodLog pins: MAX_DAYS write cap recording the 401st day drops exactly the oldest day (400 survive)
statusReason: expected [] to have a length of 400 but got +0

[Killed] EqualityOperator
src/moodLog.ts:172:11
             ? Math.max(-1, Math.min(1, energy))
             : prior?.energy;
       const day: MoodDay = cleanEnergy === undefined ? { date, value: clean } : { date, value: clean, energy: cleanEnergy };
-      if (existing >= 0) days[existing] = day;
+      if (existing > 0) days[existing] = day;
       else days.push(day);
       await write(keyCopy, userId, days);
killedBy: moodLog upserts by date — one value per day
statusReason: expected [ { date: '2026-09-04', …(1) }, …(1) ] to have a length of 1 but got 2

[Killed] CallExpression
src/moodLog.ts:173:12
             : prior?.energy;
       const day: MoodDay = cleanEnergy === undefined ? { date, value: clean } : { date, value: clean, energy: cleanEnergy };
       if (existing >= 0) days[existing] = day;
-      else days.push(day);
+      else ;
       await write(keyCopy, userId, days);
     });
killedBy: moodLog pins: MAX_DAYS write cap recording the 401st day drops exactly the oldest day (400 survive)
statusReason: expected [] to have a length of 400 but got +0

[Survived] BlockStatement
src/moodLog.ts:177:13
       await write(keyCopy, userId, days);
     });
   // Stryker disable next-line BlockStatement: the finally block only zeroizes the private key copy (memory hygiene, unobservable after return)
-  } finally {
-    // Stryker disable next-line CallExpression: zeroize only scribbles the private key copy — unobservable from any caller
-    zeroize(keyCopy);
-  }
+  } finally {}
 }
 

[Killed] BlockStatement
src/moodLog.ts:184:99
 }
 
 /** The most recent *days* mood entries, oldest first. */
-export async function recentMoods(dataKey: Buffer, userId: string, days = 30): Promise<MoodDay[]> {
-  const keyCopy = Buffer.from(dataKey);
-  try {
-    const readResult = await read(keyCopy, userId);
-    return readResult.days.slice(-days);
-  // Stryker disable next-line BlockStatement: the finally block only zeroizes the private key copy (memory hygiene, unobservable after return)
-  } finally {
-    // Stryker disable next-line CallExpression: zeroize only scribbles the private key copy — unobservable from any caller
-    zeroize(keyCopy);
-  }
-}
+export async function recentMoods(dataKey: Buffer, userId: string, days = 30): Promise<MoodDay[]> {}
 
 /** Consecutive writing days ending today (yesterday counts, with grace). */
killedBy: moodLog pins: strict date anchors in sanitize a date with junk before the YYYY-MM-DD body is dropped (leading ^ is strict)
statusReason: expected undefined to deeply equal [ { date: '2026-09-02', value: 0.4 } ]

[Killed] BlockStatement
src/moodLog.ts:186:7
 /** The most recent *days* mood entries, oldest first. */
 export async function recentMoods(dataKey: Buffer, userId: string, days = 30): Promise<MoodDay[]> {
   const keyCopy = Buffer.from(dataKey);
-  try {
-    const readResult = await read(keyCopy, userId);
-    return readResult.days.slice(-days);
-  // Stryker disable next-line BlockStatement: the finally block only zeroizes the private key copy (memory hygiene, unobservable after return)
-  } finally {
+  try {} finally {
     // Stryker disable next-line CallExpression: zeroize only scribbles the private key copy — unobservable from any caller
     zeroize(keyCopy);
killedBy: moodLog pins: strict date anchors in sanitize a date with junk before the YYYY-MM-DD body is dropped (leading ^ is strict)
statusReason: expected undefined to deeply equal [ { date: '2026-09-02', value: 0.4 } ]

[Killed] MethodExpression
src/moodLog.ts:188:12
   const keyCopy = Buffer.from(dataKey);
   try {
     const readResult = await read(keyCopy, userId);
-    return readResult.days.slice(-days);
+    return readResult.days;
   // Stryker disable next-line BlockStatement: the finally block only zeroizes the private key copy (memory hygiene, unobservable after return)
   } finally {
killedBy: moodLog pins: recentMoods window recentMoods(days) returns exactly the newest N days
statusReason: expected [ '2026-09-01', '2026-09-02', …(1) ] to deeply equal [ '2026-09-02', '2026-09-03' ]

[Killed] UnaryOperator
src/moodLog.ts:188:34
   const keyCopy = Buffer.from(dataKey);
   try {
     const readResult = await read(keyCopy, userId);
-    return readResult.days.slice(-days);
+    return readResult.days.slice(+days);
   // Stryker disable next-line BlockStatement: the finally block only zeroizes the private key copy (memory hygiene, unobservable after return)
   } finally {
killedBy: moodLog records and returns days oldest-first
statusReason: expected [] to deeply equal [ -0.5, 0.25 ]

[Killed] BlockStatement
src/moodLog.ts:197:105
 }
 
 /** Consecutive writing days ending today (yesterday counts, with grace). */
-export async function localStreak(dataKey: Buffer, userId: string, today = todayIso()): Promise<number> {
-  const keyCopy = Buffer.from(dataKey);
-  try {
-    const { days } = await read(keyCopy, userId);
-    // Stryker disable next-line ConditionalExpression: with the guard skipped, an empty days array leaves cursor null and the !cursor guard below returns the same 0
-    if (days.length === 0) return 0;
-    const set = new Set(days.map((d) => d.date));
-    let cursor = set.has(today) ? today : set.has(yesterday(today)) ? yesterday(today) : null;
-    // Stryker disable next-line ConditionalExpression: with the guard skipped, a null cursor falls into the while loop whose set.has(null) never matches — streak stays 0, the identical result
-    if (!cursor) return 0;
-    let streak = 0;
-    while (set.has(cursor)) {
-      streak += 1;
-      cursor = yesterday(cursor);
-    }
-    return streak;
-  // Stryker disable next-line BlockStatement: the finally block only zeroizes the private key copy (memory hygiene, unobservable after return)
-  } finally {
-    // Stryker disable next-line CallExpression: zeroize only scribbles the private key copy — unobservable from any caller
-    zeroize(keyCopy);
-  }
-}
+export async function localStreak(dataKey: Buffer, userId: string, today = todayIso()): Promise<number> {}
 
 /** Test seam: wipe the log (sign-out hygiene for tests and account switch). */
killedBy: moodLog a tampered blob degrades to empty, never throws
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
src/moodLog.ts:199:7
 /** Consecutive writing days ending today (yesterday counts, with grace). */
 export async function localStreak(dataKey: Buffer, userId: string, today = todayIso()): Promise<number> {
   const keyCopy = Buffer.from(dataKey);
-  try {
-    const { days } = await read(keyCopy, userId);
-    // Stryker disable next-line ConditionalExpression: with the guard skipped, an empty days array leaves cursor null and the !cursor guard below returns the same 0
-    if (days.length === 0) return 0;
-    const set = new Set(days.map((d) => d.date));
-    let cursor = set.has(today) ? today : set.has(yesterday(today)) ? yesterday(today) : null;
-    // Stryker disable next-line ConditionalExpression: with the guard skipped, a null cursor falls into the while loop whose set.has(null) never matches — streak stays 0, the identical result
-    if (!cursor) return 0;
-    let streak = 0;
-    while (set.has(cursor)) {
-      streak += 1;
-      cursor = yesterday(cursor);
-    }
-    return streak;
-  // Stryker disable next-line BlockStatement: the finally block only zeroizes the private key copy (memory hygiene, unobservable after return)
-  } finally {
+  try {} finally {
     // Stryker disable next-line CallExpression: zeroize only scribbles the private key copy — unobservable from any caller
     zeroize(keyCopy);
killedBy: moodLog a tampered blob degrades to empty, never throws
statusReason: expected undefined to be +0 // Object.is equality

[Killed] EqualityOperator
src/moodLog.ts:202:9
   try {
     const { days } = await read(keyCopy, userId);
     // Stryker disable next-line ConditionalExpression: with the guard skipped, an empty days array leaves cursor null and the !cursor guard below returns the same 0
-    if (days.length === 0) return 0;
+    if (days.length !== 0) return 0;
     const set = new Set(days.map((d) => d.date));
     let cursor = set.has(today) ? today : set.has(yesterday(today)) ? yesterday(today) : null;
killedBy: InsightsScreen pins: sparkline geometry and gating a one-day streak reads singular — exactly
statusReason: expected 'Keep writing — 1 day to your patterns…' to contain 'Writing streak: 1 day'

[Killed] ArrowFunction
src/moodLog.ts:203:34
     const { days } = await read(keyCopy, userId);
     // Stryker disable next-line ConditionalExpression: with the guard skipped, an empty days array leaves cursor null and the !cursor guard below returns the same 0
     if (days.length === 0) return 0;
-    const set = new Set(days.map((d) => d.date));
+    const set = new Set(days.map(() => undefined));
     let cursor = set.has(today) ? today : set.has(yesterday(today)) ? yesterday(today) : null;
     // Stryker disable next-line ConditionalExpression: with the guard skipped, a null cursor falls into the while loop whose set.has(null) never matches — streak stays 0, the identical result
killedBy: InsightsScreen pins: sparkline geometry and gating a one-day streak reads singular — exactly
statusReason: expected 'Keep writing — 1 day to your patterns…' to contain 'Writing streak: 1 day'

[Killed] BooleanLiteral
src/moodLog.ts:206:9
     const set = new Set(days.map((d) => d.date));
     let cursor = set.has(today) ? today : set.has(yesterday(today)) ? yesterday(today) : null;
     // Stryker disable next-line ConditionalExpression: with the guard skipped, a null cursor falls into the while loop whose set.has(null) never matches — streak stays 0, the identical result
-    if (!cursor) return 0;
+    if (cursor) return 0;
     let streak = 0;
     while (set.has(cursor)) {
killedBy: moodLog streak counts consecutive days ending today or yesterday
statusReason: expected +0 to be 3 // Object.is equality

[Killed] ConditionalExpression
src/moodLog.ts:208:12
     // Stryker disable next-line ConditionalExpression: with the guard skipped, a null cursor falls into the while loop whose set.has(null) never matches — streak stays 0, the identical result
     if (!cursor) return 0;
     let streak = 0;
-    while (set.has(cursor)) {
+    while (false) {
       streak += 1;
       cursor = yesterday(cursor);
killedBy: moodLog streak counts consecutive days ending today or yesterday
statusReason: expected +0 to be 3 // Object.is equality

[Timeout] BlockStatement
src/moodLog.ts:208:29
     // Stryker disable next-line ConditionalExpression: with the guard skipped, a null cursor falls into the while loop whose set.has(null) never matches — streak stays 0, the identical result
     if (!cursor) return 0;
     let streak = 0;
-    while (set.has(cursor)) {
-      streak += 1;
-      cursor = yesterday(cursor);
-    }
+    while (set.has(cursor)) {}
     return streak;
   // Stryker disable next-line BlockStatement: the finally block only zeroizes the private key copy (memory hygiene, unobservable after return)

[Killed] AssignmentOperator
src/moodLog.ts:209:7
     if (!cursor) return 0;
     let streak = 0;
     while (set.has(cursor)) {
-      streak += 1;
+      streak -= 1;
       cursor = yesterday(cursor);
     }
killedBy: moodLog streak counts consecutive days ending today or yesterday
statusReason: expected -3 to be 3 // Object.is equality

[Killed] BlockStatement
src/moodLog.ts:221:67
 }
 
 /** Test seam: wipe the log (sign-out hygiene for tests and account switch). */
-export async function clearMoodLog(userId: string): Promise<void> {
-  await AsyncStorage.removeItem(key(userId));
-}
+export async function clearMoodLog(userId: string): Promise<void> {}
 
killedBy: destructive delete requires two confirmations and the sign-in key
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA=",
