[Killed] CallExpression
src/offlineQueue.ts:269:7
   const ids = new Set(existing.map((item) => item.clientEntryId));
   for (const item of items) {
     if (!ids.has(item.clientEntryId)) {
-      existing.push(item);
+      ;
       ids.add(item.clientEntryId);
     }
killedBy: offline queue scope keeps rejected recovery scoped to the same account and origin
statusReason: expected [] to deeply equal [ 'a-rejected' ]

[Survived] CallExpression
src/offlineQueue.ts:270:7
   for (const item of items) {
     if (!ids.has(item.clientEntryId)) {
       existing.push(item);
-      ids.add(item.clientEntryId);
+      ;
     }
   }

[Killed] ConditionalExpression
src/offlineQueue.ts:273:7
       ids.add(item.clientEntryId);
     }
   }
-  if (!wipedSince(generation)) await writeItems(scope.rejected, existing);
+  if (false) await writeItems(scope.rejected, existing);
 }
 
killedBy: offline queue scope keeps rejected recovery scoped to the same account and origin
statusReason: expected [] to deeply equal [ 'a-rejected' ]

[Killed] BooleanLiteral
src/offlineQueue.ts:273:7
       ids.add(item.clientEntryId);
     }
   }
-  if (!wipedSince(generation)) await writeItems(scope.rejected, existing);
+  if (wipedSince(generation)) await writeItems(scope.rejected, existing);
 }
 
killedBy: offline queue scope keeps rejected recovery scoped to the same account and origin
statusReason: expected [] to deeply equal [ 'a-rejected' ]

[Killed] BlockStatement
src/offlineQueue.ts:276:81
   if (!wipedSince(generation)) await writeItems(scope.rejected, existing);
 }
 
-export async function quarantinedQueueExists(userId?: string): Promise<boolean> {
-  await migrateUnscopedLegacyData();
-  const scope = await scopeFor(await resolveUserId(userId));
-  return (await AsyncStorage.getItem(scope.quarantine)) !== null;
-}
+export async function quarantinedQueueExists(userId?: string): Promise<boolean> {}
 
 export async function rejectedEntries(userId?: string): Promise<QueuedEntry[]> {
killedBy: offline queue durability quarantines corrupt data in the current scope without touching another scope
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/offlineQueue.ts:279:10
 export async function quarantinedQueueExists(userId?: string): Promise<boolean> {
   await migrateUnscopedLegacyData();
   const scope = await scopeFor(await resolveUserId(userId));
-  return (await AsyncStorage.getItem(scope.quarantine)) !== null;
+  return false;
 }
 
killedBy: offline queue durability quarantines corrupt data in the current scope without touching another scope
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/offlineQueue.ts:279:10
 export async function quarantinedQueueExists(userId?: string): Promise<boolean> {
   await migrateUnscopedLegacyData();
   const scope = await scopeFor(await resolveUserId(userId));
-  return (await AsyncStorage.getItem(scope.quarantine)) !== null;
+  return (await AsyncStorage.getItem(scope.quarantine)) === null;
 }
 
killedBy: offline queue durability quarantines corrupt data in the current scope without touching another scope
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/offlineQueue.ts:282:80
   return (await AsyncStorage.getItem(scope.quarantine)) !== null;
 }
 
-export async function rejectedEntries(userId?: string): Promise<QueuedEntry[]> {
-  await migrateUnscopedLegacyData();
-  const scope = await scopeFor(await resolveUserId(userId));
-  return rejectedFor(scope);
-}
+export async function rejectedEntries(userId?: string): Promise<QueuedEntry[]> {}
 
 export async function rejectedEntryCount(userId?: string): Promise<number> {
killedBy: offline queue scope keeps rejected recovery scoped to the same account and origin
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/offlineQueue.ts:288:76
   return rejectedFor(scope);
 }
 
-export async function rejectedEntryCount(userId?: string): Promise<number> {
-  return (await rejectedEntries(userId)).length;
-}
+export async function rejectedEntryCount(userId?: string): Promise<number> {}
 
 export async function enqueue(item: QueuedEntry): Promise<void> {
killedBy: offline queue scope keeps rejected recovery scoped to the same account and origin
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
src/offlineQueue.ts:292:65
   return (await rejectedEntries(userId)).length;
 }
 
-export async function enqueue(item: QueuedEntry): Promise<void> {
-  await migrateUnscopedLegacyData();
-  const scope = await scopeFor(item.userId);
-  return serialized(async () => {
-    const generation = queueGeneration;
-    const queue = await readItems(scope.queue, scope, generation);
-    if (wipedSince(generation)) throw new QueueAbandonedError();
-    if (queue.length >= MAX_QUEUE_LENGTH) throw new QueueFullError();
-    // Scope owns the account id. Normalize it from the caller so a tampered
-    // record cannot poison another account's queue key.
-    queue.push({ ...item, userId: scope.userId });
-    if (wipedSince(generation)) throw new QueueAbandonedError();
-    await writeItems(scope.queue, queue);
-  });
-}
+export async function enqueue(item: QueuedEntry): Promise<void> {}
 
 function retryDelayMs(attempts: number): number {
killedBy: offline queue scope uses physically separate origin/account stores and never uploads a foreign scope
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/offlineQueue.ts:295:33
 export async function enqueue(item: QueuedEntry): Promise<void> {
   await migrateUnscopedLegacyData();
   const scope = await scopeFor(item.userId);
-  return serialized(async () => {
-    const generation = queueGeneration;
-    const queue = await readItems(scope.queue, scope, generation);
-    if (wipedSince(generation)) throw new QueueAbandonedError();
-    if (queue.length >= MAX_QUEUE_LENGTH) throw new QueueFullError();
-    // Scope owns the account id. Normalize it from the caller so a tampered
-    // record cannot poison another account's queue key.
-    queue.push({ ...item, userId: scope.userId });
-    if (wipedSince(generation)) throw new QueueAbandonedError();
-    await writeItems(scope.queue, queue);
-  });
+  return serialized(async () => {});
 }
 
killedBy: offline queue scope uses physically separate origin/account stores and never uploads a foreign scope
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/offlineQueue.ts:298:9
   return serialized(async () => {
     const generation = queueGeneration;
     const queue = await readItems(scope.queue, scope, generation);
-    if (wipedSince(generation)) throw new QueueAbandonedError();
+    if (true) throw new QueueAbandonedError();
     if (queue.length >= MAX_QUEUE_LENGTH) throw new QueueFullError();
     // Scope owns the account id. Normalize it from the caller so a tampered
killedBy: offline queue scope uses physically separate origin/account stores and never uploads a foreign scope
statusReason: the queue was cleared while saving — the entry was NOT queued

[Survived] ConditionalExpression
src/offlineQueue.ts:298:9
   return serialized(async () => {
     const generation = queueGeneration;
     const queue = await readItems(scope.queue, scope, generation);
-    if (wipedSince(generation)) throw new QueueAbandonedError();
+    if (false) throw new QueueAbandonedError();
     if (queue.length >= MAX_QUEUE_LENGTH) throw new QueueFullError();
     // Scope owns the account id. Normalize it from the caller so a tampered

[Killed] CallExpression
src/offlineQueue.ts:299:43
     const generation = queueGeneration;
     const queue = await readItems(scope.queue, scope, generation);
     if (wipedSince(generation)) throw new QueueAbandonedError();
-    if (queue.length >= MAX_QUEUE_LENGTH) throw new QueueFullError();
+    if (queue.length >= MAX_QUEUE_LENGTH) ;
     // Scope owns the account id. Normalize it from the caller so a tampered
     // record cannot poison another account's queue key.
killedBy: offline queue durability enforces a per-scope capacity and preserves every existing ciphertext
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
src/offlineQueue.ts:299:9
     const generation = queueGeneration;
     const queue = await readItems(scope.queue, scope, generation);
     if (wipedSince(generation)) throw new QueueAbandonedError();
-    if (queue.length >= MAX_QUEUE_LENGTH) throw new QueueFullError();
+    if (queue.length > MAX_QUEUE_LENGTH) throw new QueueFullError();
     // Scope owns the account id. Normalize it from the caller so a tampered
     // record cannot poison another account's queue key.
killedBy: queue regression pins has a hard per-scope bound rather than evicting the oldest entry
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ObjectLiteral
src/offlineQueue.ts:302:16
     if (queue.length >= MAX_QUEUE_LENGTH) throw new QueueFullError();
     // Scope owns the account id. Normalize it from the caller so a tampered
     // record cannot poison another account's queue key.
-    queue.push({ ...item, userId: scope.userId });
+    queue.push({});
     if (wipedSince(generation)) throw new QueueAbandonedError();
     await writeItems(scope.queue, queue);
killedBy: offline queue scope uses physically separate origin/account stores and never uploads a foreign scope
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/offlineQueue.ts:303:9
     // Scope owns the account id. Normalize it from the caller so a tampered
     // record cannot poison another account's queue key.
     queue.push({ ...item, userId: scope.userId });
-    if (wipedSince(generation)) throw new QueueAbandonedError();
+    if (true) throw new QueueAbandonedError();
     await writeItems(scope.queue, queue);
   });
killedBy: queue regression pins does not make a 409 duplicate into a rejected recovery item
statusReason: the queue was cleared while saving — the entry was NOT queued

[Survived] ConditionalExpression
src/offlineQueue.ts:303:9
     // Scope owns the account id. Normalize it from the caller so a tampered
     // record cannot poison another account's queue key.
     queue.push({ ...item, userId: scope.userId });
-    if (wipedSince(generation)) throw new QueueAbandonedError();
+    if (false) throw new QueueAbandonedError();
     await writeItems(scope.queue, queue);
   });

[Killed] MethodExpression
src/offlineQueue.ts:310:67
 
 function retryDelayMs(attempts: number): number {
-  const exponential = Math.min(RETRY_MAX_MS, RETRY_BASE_MS * 2 ** Math.min(attempts, 10));
+  const exponential = Math.min(RETRY_MAX_MS, RETRY_BASE_MS * 2 ** Math.max(attempts, 10));
   return Math.floor(exponential / 2 + Math.random() * (exponential / 2));
killedBy: flushQueueOnReconnect flushes again once the throttle window has passed
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] MethodExpression
src/offlineQueue.ts:310:23
 
 function retryDelayMs(attempts: number): number {
-  const exponential = Math.min(RETRY_MAX_MS, RETRY_BASE_MS * 2 ** Math.min(attempts, 10));
+  const exponential = Math.max(RETRY_MAX_MS, RETRY_BASE_MS * 2 ** Math.min(attempts, 10));
   return Math.floor(exponential / 2 + Math.random() * (exponential / 2));
killedBy: flush retry semantics (restored 2026-09-18) defers a retryable failure with exponential backoff and jitter
statusReason: expected 1789771249082 to be less than or equal to 1789770379582

[Killed] BlockStatement
src/offlineQueue.ts:323:58
   | { kind: "session-expired" }
   | { kind: "retry"; retryAfterMs?: number; stop: boolean };
 
-function isFutureDateRejection(error: ApiError): boolean {
-  return (error.code === undefined || error.code === "validation_error") && /future/i.test(error.message);
-}
+function isFutureDateRejection(error: ApiError): boolean {}
 
 function classifyError(error: unknown): FlushOutcome {
killedBy: mutation hardening (2026-09-18) treats an undefined-code 422 future-date rejection as retryable
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/offlineQueue.ts:324:11
   | { kind: "retry"; retryAfterMs?: number; stop: boolean };
 
 function isFutureDateRejection(error: ApiError): boolean {
-  return (error.code === undefined || error.code === "validation_error") && /future/i.test(error.message);
+  return (false || error.code === "validation_error") && /future/i.test(error.message);
 }
 
killedBy: mutation hardening (2026-09-18) treats an undefined-code 422 future-date rejection as retryable
statusReason: expected +0 to be 1 // Object.is equality

[Killed] LogicalOperator
src/offlineQueue.ts:324:10
   | { kind: "retry"; retryAfterMs?: number; stop: boolean };
 
 function isFutureDateRejection(error: ApiError): boolean {
-  return (error.code === undefined || error.code === "validation_error") && /future/i.test(error.message);
+  return error.code === undefined || error.code === "validation_error" || /future/i.test(error.message);
 }
 
killedBy: offline queue scope keeps rejected recovery scoped to the same account and origin
statusReason: expected [] to deeply equal [ 'a-rejected' ]

[Killed] BlockStatement
src/offlineQueue.ts:327:54
   return (error.code === undefined || error.code === "validation_error") && /future/i.test(error.message);
 }
 
-function classifyError(error: unknown): FlushOutcome {
-  if (!(error instanceof ApiError)) return { kind: "retry", stop: true };
-  if (error.status === 409) return { kind: "duplicate" };
-  if (error.status === 401) return { kind: "session-expired" };
-  if (error.status === 429) return { kind: "retry", retryAfterMs: error.retryAfterMs, stop: true };
-  if (error.status === 422 && isFutureDateRejection(error)) return { kind: "retry", stop: false };
-  if (error.status === 413) return { kind: "reject-and-stop" };
-  if (error.status >= 400 && error.status < 500) return { kind: "reject" };
-  return { kind: "retry", stop: error.status === 0 };
-}
+function classifyError(error: unknown): FlushOutcome {}
 
 /** Upload due items for exactly one origin/account scope. */
killedBy: queue regression pins does not make a 409 duplicate into a rejected recovery item
statusReason: Cannot read properties of undefined (reading 'kind')

[Killed] ConditionalExpression
src/offlineQueue.ts:328:7
 }
 
 function classifyError(error: unknown): FlushOutcome {
-  if (!(error instanceof ApiError)) return { kind: "retry", stop: true };
+  if (true) return { kind: "retry", stop: true };
   if (error.status === 409) return { kind: "duplicate" };
   if (error.status === 401) return { kind: "session-expired" };
killedBy: offline queue scope keeps rejected recovery scoped to the same account and origin
statusReason: expected [] to deeply equal [ 'a-rejected' ]

[Killed] ConditionalExpression
src/offlineQueue.ts:328:7
 }
 
 function classifyError(error: unknown): FlushOutcome {
-  if (!(error instanceof ApiError)) return { kind: "retry", stop: true };
+  if (false) return { kind: "retry", stop: true };
   if (error.status === 409) return { kind: "duplicate" };
   if (error.status === 401) return { kind: "session-expired" };
killedBy: mutation hardening (2026-09-18) stops after a 413/429/network failure but continues through 5xx and 409
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
src/offlineQueue.ts:329:7
 
 function classifyError(error: unknown): FlushOutcome {
   if (!(error instanceof ApiError)) return { kind: "retry", stop: true };
-  if (error.status === 409) return { kind: "duplicate" };
+  if (error.status !== 409) return { kind: "duplicate" };
   if (error.status === 401) return { kind: "session-expired" };
   if (error.status === 429) return { kind: "retry", retryAfterMs: error.retryAfterMs, stop: true };
killedBy: offline queue scope keeps rejected recovery scoped to the same account and origin
statusReason: expected [] to deeply equal [ 'a-rejected' ]

[Killed] ConditionalExpression
src/offlineQueue.ts:329:7
 
 function classifyError(error: unknown): FlushOutcome {
   if (!(error instanceof ApiError)) return { kind: "retry", stop: true };
-  if (error.status === 409) return { kind: "duplicate" };
+  if (true) return { kind: "duplicate" };
   if (error.status === 401) return { kind: "session-expired" };
   if (error.status === 429) return { kind: "retry", retryAfterMs: error.retryAfterMs, stop: true };
killedBy: offline queue scope keeps rejected recovery scoped to the same account and origin
statusReason: expected [] to deeply equal [ 'a-rejected' ]

[Killed] EqualityOperator
src/offlineQueue.ts:330:7
 function classifyError(error: unknown): FlushOutcome {
   if (!(error instanceof ApiError)) return { kind: "retry", stop: true };
   if (error.status === 409) return { kind: "duplicate" };
-  if (error.status === 401) return { kind: "session-expired" };
+  if (error.status !== 401) return { kind: "session-expired" };
   if (error.status === 429) return { kind: "retry", retryAfterMs: error.retryAfterMs, stop: true };
   if (error.status === 422 && isFutureDateRejection(error)) return { kind: "retry", stop: false };
killedBy: queue regression pins keeps a non-validation 422 terminal even when its message says future
statusReason: session expired mid-flush — unsent entries were preserved for recovery

[Killed] ConditionalExpression
src/offlineQueue.ts:330:7
 function classifyError(error: unknown): FlushOutcome {
   if (!(error instanceof ApiError)) return { kind: "retry", stop: true };
   if (error.status === 409) return { kind: "duplicate" };
-  if (error.status === 401) return { kind: "session-expired" };
+  if (false) return { kind: "session-expired" };
   if (error.status === 429) return { kind: "retry", retryAfterMs: error.retryAfterMs, stop: true };
   if (error.status === 422 && isFutureDateRejection(error)) return { kind: "retry", stop: false };
killedBy: offline queue scope moves only the current scope to recovery after an authentic 401
statusReason: promise resolved "+0" instead of rejecting

[Killed] ConditionalExpression
src/offlineQueue.ts:331:7
   if (!(error instanceof ApiError)) return { kind: "retry", stop: true };
   if (error.status === 409) return { kind: "duplicate" };
   if (error.status === 401) return { kind: "session-expired" };
-  if (error.status === 429) return { kind: "retry", retryAfterMs: error.retryAfterMs, stop: true };
+  if (true) return { kind: "retry", retryAfterMs: error.retryAfterMs, stop: true };
   if (error.status === 422 && isFutureDateRejection(error)) return { kind: "retry", stop: false };
   if (error.status === 413) return { kind: "reject-and-stop" };
killedBy: queue regression pins keeps a non-validation 422 terminal even when its message says future
statusReason: expected [] to deeply equal [ 'bad' ]

[Killed] EqualityOperator
src/offlineQueue.ts:331:7
   if (!(error instanceof ApiError)) return { kind: "retry", stop: true };
   if (error.status === 409) return { kind: "duplicate" };
   if (error.status === 401) return { kind: "session-expired" };
-  if (error.status === 429) return { kind: "retry", retryAfterMs: error.retryAfterMs, stop: true };
+  if (error.status !== 429) return { kind: "retry", retryAfterMs: error.retryAfterMs, stop: true };
   if (error.status === 422 && isFutureDateRejection(error)) return { kind: "retry", stop: false };
   if (error.status === 413) return { kind: "reject-and-stop" };
killedBy: offline queue scope keeps rejected recovery scoped to the same account and origin
statusReason: expected [] to deeply equal [ 'a-rejected' ]

[Killed] ConditionalExpression
src/offlineQueue.ts:332:7
   if (error.status === 409) return { kind: "duplicate" };
   if (error.status === 401) return { kind: "session-expired" };
   if (error.status === 429) return { kind: "retry", retryAfterMs: error.retryAfterMs, stop: true };
-  if (error.status === 422 && isFutureDateRejection(error)) return { kind: "retry", stop: false };
+  if (false) return { kind: "retry", stop: false };
   if (error.status === 413) return { kind: "reject-and-stop" };
   if (error.status >= 400 && error.status < 500) return { kind: "reject" };
killedBy: mutation hardening (2026-09-18) treats an undefined-code 422 future-date rejection as retryable
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/offlineQueue.ts:332:7
   if (error.status === 409) return { kind: "duplicate" };
   if (error.status === 401) return { kind: "session-expired" };
   if (error.status === 429) return { kind: "retry", retryAfterMs: error.retryAfterMs, stop: true };
-  if (error.status === 422 && isFutureDateRejection(error)) return { kind: "retry", stop: false };
+  if (true) return { kind: "retry", stop: false };
   if (error.status === 413) return { kind: "reject-and-stop" };
   if (error.status >= 400 && error.status < 500) return { kind: "reject" };
killedBy: offline queue scope keeps rejected recovery scoped to the same account and origin
statusReason: expected [] to deeply equal [ 'a-rejected' ]

[Killed] ConditionalExpression
src/offlineQueue.ts:333:7
   if (error.status === 401) return { kind: "session-expired" };
   if (error.status === 429) return { kind: "retry", retryAfterMs: error.retryAfterMs, stop: true };
   if (error.status === 422 && isFutureDateRejection(error)) return { kind: "retry", stop: false };
-  if (error.status === 413) return { kind: "reject-and-stop" };
+  if (false) return { kind: "reject-and-stop" };
   if (error.status >= 400 && error.status < 500) return { kind: "reject" };
   return { kind: "retry", stop: error.status === 0 };
killedBy: mutation hardening (2026-09-18) stops after a 413/429/network failure but continues through 5xx and 409
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/offlineQueue.ts:333:7
   if (error.status === 401) return { kind: "session-expired" };
   if (error.status === 429) return { kind: "retry", retryAfterMs: error.retryAfterMs, stop: true };
   if (error.status === 422 && isFutureDateRejection(error)) return { kind: "retry", stop: false };
-  if (error.status === 413) return { kind: "reject-and-stop" };
+  if (true) return { kind: "reject-and-stop" };
   if (error.status >= 400 && error.status < 500) return { kind: "reject" };
   return { kind: "retry", stop: error.status === 0 };
killedBy: flush retry semantics (restored 2026-09-18) defers a retryable failure with exponential backoff and jitter
statusReason: Cannot read properties of null (reading 'items')

[Killed] EqualityOperator
src/offlineQueue.ts:334:30
   if (error.status === 429) return { kind: "retry", retryAfterMs: error.retryAfterMs, stop: true };
   if (error.status === 422 && isFutureDateRejection(error)) return { kind: "retry", stop: false };
   if (error.status === 413) return { kind: "reject-and-stop" };
-  if (error.status >= 400 && error.status < 500) return { kind: "reject" };
+  if (error.status >= 400 && error.status >= 500) return { kind: "reject" };
   return { kind: "retry", stop: error.status === 0 };
 }
killedBy: queue regression pins keeps a non-validation 422 terminal even when its message says future
statusReason: expected [] to deeply equal [ 'bad' ]

[Killed] EqualityOperator
src/offlineQueue.ts:334:7
   if (error.status === 429) return { kind: "retry", retryAfterMs: error.retryAfterMs, stop: true };
   if (error.status === 422 && isFutureDateRejection(error)) return { kind: "retry", stop: false };
   if (error.status === 413) return { kind: "reject-and-stop" };
-  if (error.status >= 400 && error.status < 500) return { kind: "reject" };
+  if (error.status > 400 && error.status < 500) return { kind: "reject" };
   return { kind: "retry", stop: error.status === 0 };
 }
killedBy: flush retry semantics (restored 2026-09-18) moves the item to the rejected store on 413 (stop) and plain 4xx (terminal)
statusReason: expected [ 'a-too-big' ] to deeply equal [ 'a-too-big', 'a-bad' ]

[Killed] ConditionalExpression
src/offlineQueue.ts:335:33
   if (error.status === 422 && isFutureDateRejection(error)) return { kind: "retry", stop: false };
   if (error.status === 413) return { kind: "reject-and-stop" };
   if (error.status >= 400 && error.status < 500) return { kind: "reject" };
-  return { kind: "retry", stop: error.status === 0 };
+  return { kind: "retry", stop: true };
 }
 
killedBy: mutation hardening (2026-09-18) stops after a 413/429/network failure but continues through 5xx and 409
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] EqualityOperator
src/offlineQueue.ts:335:33
   if (error.status === 422 && isFutureDateRejection(error)) return { kind: "retry", stop: false };
   if (error.status === 413) return { kind: "reject-and-stop" };
   if (error.status >= 400 && error.status < 500) return { kind: "reject" };
-  return { kind: "retry", stop: error.status === 0 };
+  return { kind: "retry", stop: error.status !== 0 };
 }
 
killedBy: mutation hardening (2026-09-18) stops after a 413/429/network failure but continues through 5xx and 409
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/offlineQueue.ts:350:9
     // stay queued (intact) for their own origin and can never be uploaded
     // under a different origin's credentials. The request-level pin below
     // closes the same window between this check and the send itself.
-    if (scope.origin !== (await currentOrigin())) return sent;
+    if (false) return sent;
     const peek = await serialized(async () => {
       const generation = queueGeneration;
killedBy: cross-origin upload containment (2026-09-18 audit) stops the flush when the selected origin moves between iterations
statusReason: expected 2 to be 1 // Object.is equality

[Killed] EqualityOperator
src/offlineQueue.ts:350:9
     // stay queued (intact) for their own origin and can never be uploaded
     // under a different origin's credentials. The request-level pin below
     // closes the same window between this check and the send itself.
-    if (scope.origin !== (await currentOrigin())) return sent;
+    if (scope.origin === (await currentOrigin())) return sent;
     const peek = await serialized(async () => {
       const generation = queueGeneration;
killedBy: offline queue scope uses physically separate origin/account stores and never uploads a foreign scope
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/offlineQueue.ts:351:47
     // under a different origin's credentials. The request-level pin below
     // closes the same window between this check and the send itself.
     if (scope.origin !== (await currentOrigin())) return sent;
-    const peek = await serialized(async () => {
-      const generation = queueGeneration;
-      const queue = await readItems(scope.queue, scope, generation);
-      const item = queue.find((entry) => entry.notBefore === undefined || entry.notBefore <= Date.now());
-      return { generation, item };
-    });
+    const peek = await serialized(async () => {});
     const item = peek.item;
     if (!item) return sent;
killedBy: offline queue scope uses physically separate origin/account stores and never uploads a foreign scope
statusReason: Cannot read properties of undefined (reading 'item')

[Killed] ArrowFunction
src/offlineQueue.ts:354:31
     const peek = await serialized(async () => {
       const generation = queueGeneration;
       const queue = await readItems(scope.queue, scope, generation);
-      const item = queue.find((entry) => entry.notBefore === undefined || entry.notBefore <= Date.now());
+      const item = queue.find(() => undefined);
       return { generation, item };
     });
killedBy: offline queue scope uses physically separate origin/account stores and never uploads a foreign scope
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/offlineQueue.ts:354:75
     const peek = await serialized(async () => {
       const generation = queueGeneration;
       const queue = await readItems(scope.queue, scope, generation);
-      const item = queue.find((entry) => entry.notBefore === undefined || entry.notBefore <= Date.now());
+      const item = queue.find((entry) => entry.notBefore === undefined || entry.notBefore > Date.now());
       return { generation, item };
     });
killedBy: flush retry semantics (restored 2026-09-18) defers a retryable failure with exponential backoff and jitter
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ObjectLiteral
src/offlineQueue.ts:355:14
       const generation = queueGeneration;
       const queue = await readItems(scope.queue, scope, generation);
       const item = queue.find((entry) => entry.notBefore === undefined || entry.notBefore <= Date.now());
-      return { generation, item };
+      return {};
     });
     const item = peek.item;
killedBy: offline queue scope uses physically separate origin/account stores and never uploads a foreign scope
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/offlineQueue.ts:358:9
       return { generation, item };
     });
     const item = peek.item;
-    if (!item) return sent;
+    if (item) return sent;
 
     let outcome: FlushOutcome;
killedBy: offline queue scope uses physically separate origin/account stores and never uploads a foreign scope
statusReason: expected +0 to be 1 // Object.is equality
