[Killed] CallExpression
src/offlineQueue.ts:448:9
     for (const item of rejected) {
       if (ids.has(item.clientEntryId)) continue;
       if (queue.length >= MAX_QUEUE_LENGTH) {
-        stillRejected.push(item);
+        ;
         continue;
       }
killedBy: mutation hardening (2026-09-18) requeueRejected is a no-op for an empty store, skips queued ids, and respects capacity
statusReason: expected null to be truthy

[Killed] CallExpression
src/offlineQueue.ts:452:7
         continue;
       }
       const { attempts: _attempts, notBefore: _notBefore, ...fresh } = item;
-      queue.push(fresh);
+      ;
       ids.add(item.clientEntryId);
       moved += 1;
killedBy: offline queue scope keeps rejected recovery scoped to the same account and origin
statusReason: expected +0 to be 1 // Object.is equality

[Survived] CallExpression
src/offlineQueue.ts:453:7
       }
       const { attempts: _attempts, notBefore: _notBefore, ...fresh } = item;
       queue.push(fresh);
-      ids.add(item.clientEntryId);
+      ;
       moved += 1;
     }

[Killed] AssignmentOperator
src/offlineQueue.ts:454:7
       const { attempts: _attempts, notBefore: _notBefore, ...fresh } = item;
       queue.push(fresh);
       ids.add(item.clientEntryId);
-      moved += 1;
+      moved -= 1;
     }
     if (wipedSince(generation)) return 0;
killedBy: offline queue scope keeps rejected recovery scoped to the same account and origin
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/offlineQueue.ts:456:9
       ids.add(item.clientEntryId);
       moved += 1;
     }
-    if (wipedSince(generation)) return 0;
+    if (true) return 0;
     await writeItems(scope.queue, queue);
     if (wipedSince(generation)) return 0;
killedBy: offline queue scope keeps rejected recovery scoped to the same account and origin
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ConditionalExpression
src/offlineQueue.ts:456:9
       ids.add(item.clientEntryId);
       moved += 1;
     }
-    if (wipedSince(generation)) return 0;
+    if (false) return 0;
     await writeItems(scope.queue, queue);
     if (wipedSince(generation)) return 0;

[Killed] ConditionalExpression
src/offlineQueue.ts:458:9
     }
     if (wipedSince(generation)) return 0;
     await writeItems(scope.queue, queue);
-    if (wipedSince(generation)) return 0;
+    if (true) return 0;
     await writeItems(scope.rejected, stillRejected);
     return moved;
killedBy: offline queue scope keeps rejected recovery scoped to the same account and origin
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ConditionalExpression
src/offlineQueue.ts:458:9
     }
     if (wipedSince(generation)) return 0;
     await writeItems(scope.queue, queue);
-    if (wipedSince(generation)) return 0;
+    if (false) return 0;
     await writeItems(scope.rejected, stillRejected);
     return moved;

[Killed] BlockStatement
src/offlineQueue.ts:467:62
 const RECONNECT_FLUSH_MIN_INTERVAL_MS = 10_000;
 let lastReconnectFlushAt = 0;
 
-export async function flushQueueOnReconnect(): Promise<void> {
-  const now = Date.now();
-  if (now - lastReconnectFlushAt < RECONNECT_FLUSH_MIN_INTERVAL_MS) return;
-  lastReconnectFlushAt = now;
-  const userId = await api.getUserId();
-  if (!userId || (await queueLength(userId)) === 0) return;
-  await flushQueue(userId).catch(() => {});
-}
+export async function flushQueueOnReconnect(): Promise<void> {}
 
 /** Delete only this account's data for the currently selected origin.
killedBy: flushQueueOnReconnect flushes a non-empty queue when a session exists
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] EqualityOperator
src/offlineQueue.ts:469:7
 
 export async function flushQueueOnReconnect(): Promise<void> {
   const now = Date.now();
-  if (now - lastReconnectFlushAt < RECONNECT_FLUSH_MIN_INTERVAL_MS) return;
+  if (now - lastReconnectFlushAt >= RECONNECT_FLUSH_MIN_INTERVAL_MS) return;
   lastReconnectFlushAt = now;
   const userId = await api.getUserId();
killedBy: flushQueueOnReconnect flushes a non-empty queue when a session exists
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/offlineQueue.ts:469:7
 
 export async function flushQueueOnReconnect(): Promise<void> {
   const now = Date.now();
-  if (now - lastReconnectFlushAt < RECONNECT_FLUSH_MIN_INTERVAL_MS) return;
+  if (true) return;
   lastReconnectFlushAt = now;
   const userId = await api.getUserId();
killedBy: flushQueueOnReconnect flushes a non-empty queue when a session exists
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] LogicalOperator
src/offlineQueue.ts:472:7
   if (now - lastReconnectFlushAt < RECONNECT_FLUSH_MIN_INTERVAL_MS) return;
   lastReconnectFlushAt = now;
   const userId = await api.getUserId();
-  if (!userId || (await queueLength(userId)) === 0) return;
+  if (!userId && (await queueLength(userId)) === 0) return;
   await flushQueue(userId).catch(() => {});
 }
killedBy: flushQueueOnReconnect does nothing when signed out or when the queue is empty
statusReason: cannot access an offline queue without an account id

[Killed] BooleanLiteral
src/offlineQueue.ts:472:7
   if (now - lastReconnectFlushAt < RECONNECT_FLUSH_MIN_INTERVAL_MS) return;
   lastReconnectFlushAt = now;
   const userId = await api.getUserId();
-  if (!userId || (await queueLength(userId)) === 0) return;
+  if (userId || (await queueLength(userId)) === 0) return;
   await flushQueue(userId).catch(() => {});
 }
killedBy: flushQueueOnReconnect flushes a non-empty queue when a session exists
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/offlineQueue.ts:481:66
  * deleting account is the device owner in every realistic upgrade path,
  * and right-to-erasure must not leave their pre-upgrade ciphertext on the
  * device indefinitely. */
-export async function clearQueue(userId?: string): Promise<void> {
-  await migrateUnscopedLegacyData();
-  const scope = await scopeFor(await resolveUserId(userId));
-  // Stryker disable next-line AssignmentOperator: same rationale as abortInFlightFlush — direction of the generation change is unobservable through the inequality fence
-  queueGeneration += 1;
-  await AsyncStorage.multiRemove([scope.queue, scope.rejected, scope.quarantine, LEGACY_RECOVERY_KEY]);
-}
+export async function clearQueue(userId?: string): Promise<void> {}
 
 export async function queueLength(userId?: string): Promise<number> {
killedBy: flushQueueOnReconnect does nothing when signed out or when the queue is empty
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "r-1",

[Killed] BlockStatement
src/offlineQueue.ts:489:69
   await AsyncStorage.multiRemove([scope.queue, scope.rejected, scope.quarantine, LEGACY_RECOVERY_KEY]);
 }
 
-export async function queueLength(userId?: string): Promise<number> {
-  await migrateUnscopedLegacyData();
-  const scope = await scopeFor(await resolveUserId(userId));
-  return serialized(async () => (await readItems(scope.queue, scope, queueGeneration)).length);
-}
+export async function queueLength(userId?: string): Promise<number> {}
 
 /** A visible, non-uploadable indication for an upgrade that found old global
killedBy: offline queue scope uses physically separate origin/account stores and never uploads a foreign scope
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ArrowFunction
src/offlineQueue.ts:492:21
 export async function queueLength(userId?: string): Promise<number> {
   await migrateUnscopedLegacyData();
   const scope = await scopeFor(await resolveUserId(userId));
-  return serialized(async () => (await readItems(scope.queue, scope, queueGeneration)).length);
+  return serialized(() => undefined);
 }
 
killedBy: queue regression pins does not make a 409 duplicate into a rejected recovery item
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
src/offlineQueue.ts:498:66
 /** A visible, non-uploadable indication for an upgrade that found old global
  * queue bytes. This lets Settings tell the user the bytes were preserved
  * without ever assigning them to the wrong account/server. */
-export async function hasLegacyQueueRecovery(): Promise<boolean> {
-  await migrateUnscopedLegacyData();
-  return (await AsyncStorage.getItem(LEGACY_RECOVERY_KEY)) !== null;
-}
+export async function hasLegacyQueueRecovery(): Promise<boolean> {}
 
killedBy: offline queue durability preserves pre-v2 global bytes without assigning them to the current server
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/offlineQueue.ts:500:10
  * without ever assigning them to the wrong account/server. */
 export async function hasLegacyQueueRecovery(): Promise<boolean> {
   await migrateUnscopedLegacyData();
-  return (await AsyncStorage.getItem(LEGACY_RECOVERY_KEY)) !== null;
+  return (await AsyncStorage.getItem(LEGACY_RECOVERY_KEY)) === null;
 }
 
killedBy: offline queue durability preserves pre-v2 global bytes without assigning them to the current server
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/offlineQueue.ts:500:10
  * without ever assigning them to the wrong account/server. */
 export async function hasLegacyQueueRecovery(): Promise<boolean> {
   await migrateUnscopedLegacyData();
-  return (await AsyncStorage.getItem(LEGACY_RECOVERY_KEY)) !== null;
+  return true;
 }
 
killedBy: offline queue durability erases preserved legacy bytes with the deleting account (right to erasure)
statusReason: expected true to be false // Object.is equality
