[Killed] ArithmeticOperator
src/screens/HistoryScreen.tsx:56:26
 /** Keep manual history loading genuinely bounded: at most 500 ciphertext
  * rows / five requests can become decrypted plaintext in this screen. */
 const MAX_HISTORY_SERVER_PAGES = 5;
-const MAX_HISTORY_ROWS = SERVER_PAGE_SIZE * MAX_HISTORY_SERVER_PAGES;
+const MAX_HISTORY_ROWS = SERVER_PAGE_SIZE / MAX_HISTORY_SERVER_PAGES;
 const SNIPPET_CHARS = 140;
 /** Same payload cap as the Entry screen. */
killedBy: HistoryScreen list uses the server's byte-page continuation to load older history
statusReason: expected last "vi.fn()" call to have been called with [ { limit: 100, offset: 1, …(1) } ]

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:82:54
 /** "2026-09-03" → "Thursday, September 3, 2026". The locale is pinned so
  *  every device renders the same shape; a garbage date falls back to the
  *  raw string instead of crashing the row. */
-export function formatEntryDate(iso: string): string {
-  const parsed = new Date(`${iso}T00:00:00`);
-  if (Number.isNaN(parsed.getTime())) return iso;
-  return parsed.toLocaleDateString("en-US", { weekday: "long", year: "numeric", month: "long", day: "numeric" });
-}
+export function formatEntryDate(iso: string): string {}
 
 function snippetOf(text: string): string {
killedBy: HistoryScreen list renders past entries decrypted on-device, newest day first
statusReason: expected [ 'Entry from undefined', …(2) ] to include 'Entry from Thursday, September 3, 2026'

[Killed] StringLiteral
src/screens/HistoryScreen.tsx:83:27
  *  every device renders the same shape; a garbage date falls back to the
  *  raw string instead of crashing the row. */
 export function formatEntryDate(iso: string): string {
-  const parsed = new Date(`${iso}T00:00:00`);
+  const parsed = new Date(``);
   if (Number.isNaN(parsed.getTime())) return iso;
   return parsed.toLocaleDateString("en-US", { weekday: "long", year: "numeric", month: "long", day: "numeric" });
killedBy: HistoryScreen list renders past entries decrypted on-device, newest day first
statusReason: expected [ 'Entry from 2026-09-03', …(2) ] to include 'Entry from Thursday, September 3, 2026'

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:84:7
  *  raw string instead of crashing the row. */
 export function formatEntryDate(iso: string): string {
   const parsed = new Date(`${iso}T00:00:00`);
-  if (Number.isNaN(parsed.getTime())) return iso;
+  if (false) return iso;
   return parsed.toLocaleDateString("en-US", { weekday: "long", year: "numeric", month: "long", day: "numeric" });
 }
killedBy: formatEntryDate renders friendly dates and survives garbage
statusReason: expected 'Invalid Date' to be 'not-a-date' // Object.is equality

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:84:7
  *  raw string instead of crashing the row. */
 export function formatEntryDate(iso: string): string {
   const parsed = new Date(`${iso}T00:00:00`);
-  if (Number.isNaN(parsed.getTime())) return iso;
+  if (true) return iso;
   return parsed.toLocaleDateString("en-US", { weekday: "long", year: "numeric", month: "long", day: "numeric" });
 }
killedBy: HistoryScreen list renders past entries decrypted on-device, newest day first
statusReason: expected [ 'Entry from 2026-09-03', …(2) ] to include 'Entry from Thursday, September 3, 2026'

[Killed] StringLiteral
src/screens/HistoryScreen.tsx:85:56
 export function formatEntryDate(iso: string): string {
   const parsed = new Date(`${iso}T00:00:00`);
   if (Number.isNaN(parsed.getTime())) return iso;
-  return parsed.toLocaleDateString("en-US", { weekday: "long", year: "numeric", month: "long", day: "numeric" });
+  return parsed.toLocaleDateString("en-US", { weekday: "", year: "numeric", month: "long", day: "numeric" });
 }
 
killedBy: HistoryScreen list renders past entries decrypted on-device, newest day first
statusReason: Value  out of range for Date.prototype.toLocaleDateString options property weekday

[Killed] StringLiteral
src/screens/HistoryScreen.tsx:85:70
 export function formatEntryDate(iso: string): string {
   const parsed = new Date(`${iso}T00:00:00`);
   if (Number.isNaN(parsed.getTime())) return iso;
-  return parsed.toLocaleDateString("en-US", { weekday: "long", year: "numeric", month: "long", day: "numeric" });
+  return parsed.toLocaleDateString("en-US", { weekday: "long", year: "", month: "long", day: "numeric" });
 }
 
killedBy: HistoryScreen list renders past entries decrypted on-device, newest day first
statusReason: Value  out of range for Date.prototype.toLocaleDateString options property year

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:88:42
   return parsed.toLocaleDateString("en-US", { weekday: "long", year: "numeric", month: "long", day: "numeric" });
 }
 
-function snippetOf(text: string): string {
-  const flat = text.replace(/\s+/g, " ").trim();
-  return flat.length > SNIPPET_CHARS ? `${flat.slice(0, SNIPPET_CHARS)}…` : flat;
-}
+function snippetOf(text: string): string {}
 
 /** The payload's sentiment rides inside the encrypted blob, but the server
killedBy: HistoryScreen list renders past entries decrypted on-device, newest day first
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' to contain 'third day'

[Killed] MethodExpression
src/screens/HistoryScreen.tsx:89:16
 }
 
 function snippetOf(text: string): string {
-  const flat = text.replace(/\s+/g, " ").trim();
+  const flat = text.replace(/\s+/g, " ");
   return flat.length > SNIPPET_CHARS ? `${flat.slice(0, SNIPPET_CHARS)}…` : flat;
 }
killedBy: HistoryScreen pins: snippetOf normalization and boundary collapses runs of whitespace to single spaces, trims the ends — exact node text
statusReason: expected [ '‹', 'September 2026', '›', …(42) ] to include 'padded entry'

[Killed] Regex
src/screens/HistoryScreen.tsx:89:29
 }
 
 function snippetOf(text: string): string {
-  const flat = text.replace(/\s+/g, " ").trim();
+  const flat = text.replace(/\S+/g, " ").trim();
   return flat.length > SNIPPET_CHARS ? `${flat.slice(0, SNIPPET_CHARS)}…` : flat;
 }
killedBy: HistoryScreen list renders past entries decrypted on-device, newest day first
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' to contain 'third day'

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:90:10
 
 function snippetOf(text: string): string {
   const flat = text.replace(/\s+/g, " ").trim();
-  return flat.length > SNIPPET_CHARS ? `${flat.slice(0, SNIPPET_CHARS)}…` : flat;
+  return true ? `${flat.slice(0, SNIPPET_CHARS)}…` : flat;
 }
 
killedBy: HistoryScreen pins: snippetOf normalization and boundary collapses runs of whitespace to single spaces, trims the ends — exact node text
statusReason: expected [ '‹', 'September 2026', '›', …(42) ] to include 'padded entry'

[Killed] EqualityOperator
src/screens/HistoryScreen.tsx:90:10
 
 function snippetOf(text: string): string {
   const flat = text.replace(/\s+/g, " ").trim();
-  return flat.length > SNIPPET_CHARS ? `${flat.slice(0, SNIPPET_CHARS)}…` : flat;
+  return flat.length <= SNIPPET_CHARS ? `${flat.slice(0, SNIPPET_CHARS)}…` : flat;
 }
 
killedBy: HistoryScreen pins: snippetOf normalization and boundary collapses runs of whitespace to single spaces, trims the ends — exact node text
statusReason: expected [ '‹', 'September 2026', '›', …(42) ] to include 'padded entry'

[Killed] BooleanLiteral
src/screens/HistoryScreen.tsx:98:36
  *  other rendered value: type-check, clamp. */
 function sanitizeSentiment(value: unknown): number | null {
-  if (typeof value !== "number" || !Number.isFinite(value)) return null;
+  if (typeof value !== "number" || Number.isFinite(value)) return null;
   return Math.max(-1, Math.min(1, value));
 }
killedBy: HistoryScreen pins: badge chrome the mood badge carries its exact style array and accent meta text
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/screens/HistoryScreen.tsx:98:7
  *  other rendered value: type-check, clamp. */
 function sanitizeSentiment(value: unknown): number | null {
-  if (typeof value !== "number" || !Number.isFinite(value)) return null;
+  if (typeof value === "number" || !Number.isFinite(value)) return null;
   return Math.max(-1, Math.min(1, value));
 }
killedBy: HistoryScreen list a crafted payload sentiment is clamped before it ever renders
statusReason: expected [] to deeply equal [ 'Mood: Light' ]

[Killed] MethodExpression
src/screens/HistoryScreen.tsx:99:23
 function sanitizeSentiment(value: unknown): number | null {
   if (typeof value !== "number" || !Number.isFinite(value)) return null;
-  return Math.max(-1, Math.min(1, value));
+  return Math.max(-1, Math.max(1, value));
 }
 
killedBy: HistoryScreen mood badges the entry's own check-in pick wins; the device-local log is the fallback
statusReason: expected [ 'Mood: Good', 'Mood: Light', …(1) ] to deeply equal [ 'Mood: Good', 'Mood: Heavy', …(1) ]

[Killed] UnaryOperator
src/screens/HistoryScreen.tsx:99:19
 function sanitizeSentiment(value: unknown): number | null {
   if (typeof value !== "number" || !Number.isFinite(value)) return null;
-  return Math.max(-1, Math.min(1, value));
+  return Math.max(+1, Math.min(1, value));
 }
 
killedBy: HistoryScreen mood badges the entry's own check-in pick wins; the device-local log is the fallback
statusReason: expected [ 'Mood: Good', 'Mood: Light', …(1) ] to deeply equal [ 'Mood: Good', 'Mood: Heavy', …(1) ]

[Survived] BooleanLiteral
src/screens/HistoryScreen.tsx:116:42
   const [unreadable, setUnreadable] = useState(0);
   const [shown, setShown] = useState(PAGE_SIZE);
   const [nextOffset, setNextOffset] = useState<number | null>(null);
-  const [hasMore, setHasMore] = useState(false);
+  const [hasMore, setHasMore] = useState(true);
   const [historyLimitReached, setHistoryLimitReached] = useState(false);
   const [loadingMore, setLoadingMore] = useState(false);

[Survived] BooleanLiteral
src/screens/HistoryScreen.tsx:117:66
   const [shown, setShown] = useState(PAGE_SIZE);
   const [nextOffset, setNextOffset] = useState<number | null>(null);
   const [hasMore, setHasMore] = useState(false);
-  const [historyLimitReached, setHistoryLimitReached] = useState(false);
+  const [historyLimitReached, setHistoryLimitReached] = useState(true);
   const [loadingMore, setLoadingMore] = useState(false);
   const [logMoods, setLogMoods] = useState<Record<string, number>>({});

[Killed] BooleanLiteral
src/screens/HistoryScreen.tsx:118:50
   const [nextOffset, setNextOffset] = useState<number | null>(null);
   const [hasMore, setHasMore] = useState(false);
   const [historyLimitReached, setHistoryLimitReached] = useState(false);
-  const [loadingMore, setLoadingMore] = useState(false);
+  const [loadingMore, setLoadingMore] = useState(true);
   const [logMoods, setLogMoods] = useState<Record<string, number>>({});
   /** Search + calendar filter (2026-09-17): plain-text query and a tapped
killedBy: HistoryScreen list uses the server's byte-page continuation to load older history
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' to contain 'Load older entries'

[Killed] BooleanLiteral
src/screens/HistoryScreen.tsx:125:36
    *  phone. Both reset on reload. */
   const [query, setQuery] = useState("");
   const [dayFilter, setDayFilter] = useState<string | null>(null);
-  const [busy, setBusy] = useState(false);
+  const [busy, setBusy] = useState(true);
   const [status, setStatus] = useState<string | null>(null);
killedBy: HistoryScreen detail opens the full text with the friendly date and returns to the list
statusReason: expected 'Thursday, September 3, 2026 the whole…' to contain 'Delete this entry'

[Killed] BooleanLiteral
src/screens/HistoryScreen.tsx:134:26
   const statusTimer = useRef<ReturnType<typeof setTimeout> | null>(null);
   // Double-tap guard: two presses inside one frame both pass a state-only
   // check (the Entry screen's savingRef pattern) — the ref is synchronous.
-  const busyRef = useRef(false);
+  const busyRef = useRef(true);
   const loadingMoreRef = useRef(false);
   /** Synchronous guard for a stale native tap while a fresh page-one request
killedBy: HistoryScreen delete is a calm double confirmation — and only then hits the server
statusReason: expected "vi.fn()" to be called with arguments: [ 'e-2026-09-03-bbb' ]

Number of calls: 0

[Killed] BooleanLiteral
src/screens/HistoryScreen.tsx:135:33
   // Double-tap guard: two presses inside one frame both pass a state-only
   // check (the Entry screen's savingRef pattern) — the ref is synchronous.
   const busyRef = useRef(false);
-  const loadingMoreRef = useRef(false);
+  const loadingMoreRef = useRef(true);
   /** Synchronous guard for a stale native tap while a fresh page-one request
    * is pending. State alone is batched, so it cannot protect that window. */
killedBy: HistoryScreen list uses the server's byte-page continuation to load older history
statusReason: expected last "vi.fn()" call to have been called with [ { limit: 100, offset: 1, …(1) } ]

[Survived] BooleanLiteral
src/screens/HistoryScreen.tsx:138:38
   const loadingMoreRef = useRef(false);
   /** Synchronous guard for a stale native tap while a fresh page-one request
    * is pending. State alone is batched, so it cannot protect that window. */
-  const historyReloadingRef = useRef(false);
+  const historyReloadingRef = useRef(true);
   // These are mutable mirrors of the history cap. State updates are batched,
   // so refs close the brief post-response window where a rapid extra tap

[Survived] BooleanLiteral
src/screens/HistoryScreen.tsx:144:34
   // could otherwise start a sixth request before the disabled UI commits.
   const loadedServerPagesRef = useRef(0);
   const loadedCiphertextRowsRef = useRef(0);
-  const historyLimitRef = useRef(false);
+  const historyLimitRef = useRef(true);
   /** A modern server gives every page in one history walk the same strict
    * decimal revision. Null means the connected (older) server is headerless

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:154:67
   const historyLoadEpochRef = useRef(0);
 
   /** Transient confirmation ("Entry deleted"); replaces itself cleanly. */
-  const showStatus = (message: string, tone: InlineStatusTone) => {
-    if (statusTimer.current) clearTimeout(statusTimer.current);
-    setStatusTone(tone);
-    setStatus(message);
-    statusTimer.current = setTimeout(() => setStatus(null), STATUS_MS);
-  };
+  const showStatus = (message: string, tone: InlineStatusTone) => {};
 
   const load = useCallback(async (afterRevisionConflict = false) => {
killedBy: HistoryScreen list restarts cleanly from page one when the snapshot changes while loading older history
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' to contain 'Reloading the latest history from the…'

[Killed] CallExpression
src/screens/HistoryScreen.tsx:155:30
 
   /** Transient confirmation ("Entry deleted"); replaces itself cleanly. */
   const showStatus = (message: string, tone: InlineStatusTone) => {
-    if (statusTimer.current) clearTimeout(statusTimer.current);
+    if (statusTimer.current) ;
     setStatusTone(tone);
     setStatus(message);
killedBy: HistoryScreen pins: status-line lifetime (fake timers) a new status replaces the old timer, and the line clears after 2 600 ms
statusReason: expected 'Wednesday, September 2, 2026 second e…' to contain 'Updated ✓'

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:155:9
 
   /** Transient confirmation ("Entry deleted"); replaces itself cleanly. */
   const showStatus = (message: string, tone: InlineStatusTone) => {
-    if (statusTimer.current) clearTimeout(statusTimer.current);
+    if (false) clearTimeout(statusTimer.current);
     setStatusTone(tone);
     setStatus(message);
killedBy: HistoryScreen pins: status-line lifetime (fake timers) a new status replaces the old timer, and the line clears after 2 600 ms
statusReason: expected 'Wednesday, September 2, 2026 second e…' to contain 'Updated ✓'

[Killed] CallExpression
src/screens/HistoryScreen.tsx:156:5
   /** Transient confirmation ("Entry deleted"); replaces itself cleanly. */
   const showStatus = (message: string, tone: InlineStatusTone) => {
     if (statusTimer.current) clearTimeout(statusTimer.current);
-    setStatusTone(tone);
+    ;
     setStatus(message);
     statusTimer.current = setTimeout(() => setStatus(null), STATUS_MS);
killedBy: HistoryScreen pins: edit semantics the 'Updated ✓' status is success-colored
statusReason: expected { color: '#8a91a3', fontSize: 13 } to deeply equal { color: '#59c98a', fontSize: 13 }

[Killed] CallExpression
src/screens/HistoryScreen.tsx:157:5
   const showStatus = (message: string, tone: InlineStatusTone) => {
     if (statusTimer.current) clearTimeout(statusTimer.current);
     setStatusTone(tone);
-    setStatus(message);
+    ;
     statusTimer.current = setTimeout(() => setStatus(null), STATUS_MS);
   };
killedBy: HistoryScreen pins: edit semantics an entry of exactly 100 000 characters still saves (strict > cap)
statusReason: expected 'Thursday, September 3, 2026 xxxxxxxxx…' to contain 'Updated ✓'

[Killed] ArrowFunction
src/screens/HistoryScreen.tsx:158:38
     if (statusTimer.current) clearTimeout(statusTimer.current);
     setStatusTone(tone);
     setStatus(message);
-    statusTimer.current = setTimeout(() => setStatus(null), STATUS_MS);
+    statusTimer.current = setTimeout(() => undefined, STATUS_MS);
   };
 
killedBy: HistoryScreen pins: status-line lifetime (fake timers) a new status replaces the old timer, and the line clears after 2 600 ms
statusReason: expected 'Wednesday, September 2, 2026 second e…' not to contain 'Updated ✓'

[Killed] BooleanLiteral
src/screens/HistoryScreen.tsx:161:59
     statusTimer.current = setTimeout(() => setStatus(null), STATUS_MS);
   };
 
-  const load = useCallback(async (afterRevisionConflict = false) => {
+  const load = useCallback(async (afterRevisionConflict = true) => {
     const loadEpoch = ++historyLoadEpochRef.current;
     // Initial pages deliberately do not carry expected_revision: they obtain
killedBy: HistoryScreen pins: pagination reloading with entries on screen shows no spinner — only a first load may
statusReason: expected [ ReactTestInstance{ …(1) } ] to have a length of +0 but got 1

[Survived] UpdateOperator
src/screens/HistoryScreen.tsx:162:23
   };
 
   const load = useCallback(async (afterRevisionConflict = false) => {
-    const loadEpoch = ++historyLoadEpochRef.current;
+    const loadEpoch = --historyLoadEpochRef.current;
     // Initial pages deliberately do not carry expected_revision: they obtain
     // the snapshot token for this walk. A legacy server returns no token.

[Survived] BooleanLiteral
src/screens/HistoryScreen.tsx:166:35
     // Initial pages deliberately do not carry expected_revision: they obtain
     // the snapshot token for this walk. A legacy server returns no token.
     entriesRevisionRef.current = null;
-    historyReloadingRef.current = true;
+    historyReloadingRef.current = false;
     setLoading(true);
     setError(null);

[Killed] BooleanLiteral
src/screens/HistoryScreen.tsx:167:16
     // the snapshot token for this walk. A legacy server returns no token.
     entriesRevisionRef.current = null;
     historyReloadingRef.current = true;
-    setLoading(true);
+    setLoading(false);
     setError(null);
     setOffline(false);
killedBy: HistoryScreen list shows a spinner while the first load is in flight
statusReason: expected 0 to be greater than 0

[Killed] CallExpression
src/screens/HistoryScreen.tsx:168:5
     entriesRevisionRef.current = null;
     historyReloadingRef.current = true;
     setLoading(true);
-    setError(null);
+    ;
     setOffline(false);
     // An initial request replaces the paging walk. Hide its old continuation
killedBy: HistoryScreen list a server failure shows calm copy with an alert role and a retry
statusReason: expected 'The server hit a problem — try again …' not to contain 'try again in a moment'

[Killed] BooleanLiteral
src/screens/HistoryScreen.tsx:169:16
     historyReloadingRef.current = true;
     setLoading(true);
     setError(null);
-    setOffline(false);
+    setOffline(true);
     // An initial request replaces the paging walk. Hide its old continuation
     // synchronously so it cannot append to the new page-one snapshot.
killedBy: HistoryScreen list shows a spinner while the first load is in flight
statusReason: expected 0 to be greater than 0

[Survived] CallExpression
src/screens/HistoryScreen.tsx:172:5
     setOffline(false);
     // An initial request replaces the paging walk. Hide its old continuation
     // synchronously so it cannot append to the new page-one snapshot.
-    setNextOffset(null);
+    ;
     setHasMore(false);
     setHistoryLimitReached(false);

[Survived] BooleanLiteral
src/screens/HistoryScreen.tsx:173:16
     // An initial request replaces the paging walk. Hide its old continuation
     // synchronously so it cannot append to the new page-one snapshot.
     setNextOffset(null);
-    setHasMore(false);
+    setHasMore(true);
     setHistoryLimitReached(false);
     loadedServerPagesRef.current = 0;

[Survived] BooleanLiteral
src/screens/HistoryScreen.tsx:174:28
     // synchronously so it cannot append to the new page-one snapshot.
     setNextOffset(null);
     setHasMore(false);
-    setHistoryLimitReached(false);
+    setHistoryLimitReached(true);
     loadedServerPagesRef.current = 0;
     loadedCiphertextRowsRef.current = 0;

[Survived] BooleanLiteral
src/screens/HistoryScreen.tsx:177:31
     setHistoryLimitReached(false);
     loadedServerPagesRef.current = 0;
     loadedCiphertextRowsRef.current = 0;
-    historyLimitRef.current = false;
+    historyLimitRef.current = true;
     if (afterRevisionConflict) {
       // Never retain a mixture of the old and new snapshot while the restart

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:178:9
     loadedServerPagesRef.current = 0;
     loadedCiphertextRowsRef.current = 0;
     historyLimitRef.current = false;
-    if (afterRevisionConflict) {
+    if (true) {
       // Never retain a mixture of the old and new snapshot while the restart
       // is in flight. The person sees an explicit status below rather than a
killedBy: HistoryScreen pins: pagination reloading with entries on screen shows no spinner — only a first load may
statusReason: expected [ ReactTestInstance{ …(1) } ] to have a length of +0 but got 1

[Survived] BlockStatement
src/screens/HistoryScreen.tsx:178:32
     loadedServerPagesRef.current = 0;
     loadedCiphertextRowsRef.current = 0;
     historyLimitRef.current = false;
-    if (afterRevisionConflict) {
-      // Never retain a mixture of the old and new snapshot while the restart
-      // is in flight. The person sees an explicit status below rather than a
-      // plausible-looking but incomplete journal.
-      setEntries([]);
-      setUnreadable(0);
-      setShown(PAGE_SIZE);
-      setQuery("");
-      setDayFilter(null);
-      setLogMoods({});
-    }
+    if (afterRevisionConflict) {}
     try {
       const userId = await api.getUserId();

[Survived] CallExpression
src/screens/HistoryScreen.tsx:183:7
       // is in flight. The person sees an explicit status below rather than a
       // plausible-looking but incomplete journal.
       setEntries([]);
-      setUnreadable(0);
+      ;
       setShown(PAGE_SIZE);
       setQuery("");

[Survived] CallExpression
src/screens/HistoryScreen.tsx:184:7
       // plausible-looking but incomplete journal.
       setEntries([]);
       setUnreadable(0);
-      setShown(PAGE_SIZE);
+      ;
       setQuery("");
       setDayFilter(null);

[Survived] CallExpression
src/screens/HistoryScreen.tsx:186:7
       setUnreadable(0);
       setShown(PAGE_SIZE);
       setQuery("");
-      setDayFilter(null);
+      ;
       setLogMoods({});
     }

[Survived] CallExpression
src/screens/HistoryScreen.tsx:187:7
       setShown(PAGE_SIZE);
       setQuery("");
       setDayFilter(null);
-      setLogMoods({});
+      ;
     }
     try {

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:191:11
     }
     try {
       const userId = await api.getUserId();
-      if (loadEpoch !== historyLoadEpochRef.current) return;
+      if (true) return;
       if (!userId) throw new Error("account id missing — sign in again");
       const page = await api.listEntriesPage({
killedBy: HistoryScreen pins: snippetOf normalization and boundary collapses runs of whitespace to single spaces, trims the ends — exact node text
statusReason: expected [ …(2) ] to include 'padded entry'

[Killed] EqualityOperator
src/screens/HistoryScreen.tsx:191:11
     }
     try {
       const userId = await api.getUserId();
-      if (loadEpoch !== historyLoadEpochRef.current) return;
+      if (loadEpoch === historyLoadEpochRef.current) return;
       if (!userId) throw new Error("account id missing — sign in again");
       const page = await api.listEntriesPage({
killedBy: HistoryScreen pins: snippetOf normalization and boundary collapses runs of whitespace to single spaces, trims the ends — exact node text
statusReason: expected [ …(2) ] to include 'padded entry'

[Killed] BooleanLiteral
src/screens/HistoryScreen.tsx:192:11
     try {
       const userId = await api.getUserId();
       if (loadEpoch !== historyLoadEpochRef.current) return;
-      if (!userId) throw new Error("account id missing — sign in again");
+      if (userId) throw new Error("account id missing — sign in again");
       const page = await api.listEntriesPage({
         limit: SERVER_PAGE_SIZE,
killedBy: HistoryScreen pins: snippetOf normalization and boundary collapses runs of whitespace to single spaces, trims the ends — exact node text
statusReason: expected [ …(3) ] to include 'padded entry'

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:192:11
     try {
       const userId = await api.getUserId();
       if (loadEpoch !== historyLoadEpochRef.current) return;
-      if (!userId) throw new Error("account id missing — sign in again");
+      if (true) throw new Error("account id missing — sign in again");
       const page = await api.listEntriesPage({
         limit: SERVER_PAGE_SIZE,
killedBy: HistoryScreen pins: snippetOf normalization and boundary collapses runs of whitespace to single spaces, trims the ends — exact node text
statusReason: expected [ …(3) ] to include 'padded entry'

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:198:11
         offset: 0,
         pageBytes: ENTRY_PAGE_BYTES,
       });
-      if (loadEpoch !== historyLoadEpochRef.current) return;
+      if (true) return;
       const rows = page.entries;
       const decrypted: HistoryEntry[] = [];
killedBy: HistoryScreen pins: snippetOf normalization and boundary collapses runs of whitespace to single spaces, trims the ends — exact node text
statusReason: expected [ …(2) ] to include 'padded entry'

[Killed] EqualityOperator
src/screens/HistoryScreen.tsx:198:11
         offset: 0,
         pageBytes: ENTRY_PAGE_BYTES,
       });
-      if (loadEpoch !== historyLoadEpochRef.current) return;
+      if (loadEpoch === historyLoadEpochRef.current) return;
       const rows = page.entries;
       const decrypted: HistoryEntry[] = [];
killedBy: HistoryScreen list renders past entries decrypted on-device, newest day first
statusReason: expected 'No entries yet. What you write each d…' to contain 'third day'

[Killed] ArrayDeclaration
src/screens/HistoryScreen.tsx:200:41
       });
       if (loadEpoch !== historyLoadEpochRef.current) return;
       const rows = page.entries;
-      const decrypted: HistoryEntry[] = [];
+      const decrypted: HistoryEntry[] = ["Stryker was here"];
       let failed = 0;
       for (const row of rows) {
killedBy: HistoryScreen list renders past entries decrypted on-device, newest day first
statusReason: expected 'Cannot read properties of undefined (…' to contain 'third day'

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:202:31
       const rows = page.entries;
       const decrypted: HistoryEntry[] = [];
       let failed = 0;
-      for (const row of rows) {
-        try {
-          const payload = decryptEntry(vault.get(), userId, row.client_entry_id, row.blob);
-          decrypted.push({
-            clientEntryId: row.client_entry_id,
-            entryDate: typeof row.entry_date === "string" ? row.entry_date : "",
-            receivedAt: typeof row.received_at === "string" ? row.received_at : "",
-            text: typeof payload.text === "string" ? payload.text : "",
-            sentiment: sanitizeSentiment(payload.sentiment),
-          });
-        } catch {
-          // Tampered or wrong-key blob: skipped (never rendered raw), and
-          // counted so the user knows the list is short by exactly that many.
-          failed += 1;
-        }
-      }
+      for (const row of rows) {}
       // Newest day first; same-day entries order by server arrival.
       decrypted.sort((a, b) => b.entryDate.localeCompare(a.entryDate) || b.receivedAt.localeCompare(a.receivedAt));
killedBy: HistoryScreen list renders past entries decrypted on-device, newest day first
statusReason: expected 'No entries yet. What you write each d…' to contain 'third day'
