[Killed] BooleanLiteral
src/screens/HistoryScreen.tsx:273:22
     void load();
     // Returning from another screen (e.g. after writing) reloads — but the
     // focus event also fires on first mount, so skip exactly that one.
-    let firstFocus = true;
+    let firstFocus = false;
     const focusSub = typeof navigation?.addListener === "function"
       ? (navigation.addListener("focus", () => {
killedBy: HistoryScreen focus reload and crisis access returning to the screen reloads; the first (mount) focus event does not double-load
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] OptionalChaining
src/screens/HistoryScreen.tsx:274:29
     // Returning from another screen (e.g. after writing) reloads — but the
     // focus event also fires on first mount, so skip exactly that one.
     let firstFocus = true;
-    const focusSub = typeof navigation?.addListener === "function"
+    const focusSub = typeof navigation.addListener === "function"
       ? (navigation.addListener("focus", () => {
           if (firstFocus) {
killedBy: HistoryScreen pins: focus subscription renders without a navigation prop at all
statusReason: Cannot read properties of undefined (reading 'addListener')

[Killed] EqualityOperator
src/screens/HistoryScreen.tsx:274:22
     // Returning from another screen (e.g. after writing) reloads — but the
     // focus event also fires on first mount, so skip exactly that one.
     let firstFocus = true;
-    const focusSub = typeof navigation?.addListener === "function"
+    const focusSub = typeof navigation?.addListener !== "function"
       ? (navigation.addListener("focus", () => {
           if (firstFocus) {
killedBy: HistoryScreen list renders past entries decrypted on-device, newest day first
statusReason: navigation.addListener is not a function

[Killed] OptionalChaining
src/screens/HistoryScreen.tsx:284:7
         }) as (() => void) | undefined)
       : undefined;
     return () => {
-      focusSub?.();
+      focusSub();
       if (statusTimer.current) clearTimeout(statusTimer.current);
killedBy: HistoryScreen list shows a spinner while the first load is in flight
statusReason: focusSub is not a function

[Killed] EqualityOperator
src/screens/HistoryScreen.tsx:299:9
   // press on whatever screen is on top.
   const backSub = useRef<{ remove: () => void } | null>(null);
   useEffect(() => {
-    if (mode.kind === "list") return;
+    if (mode.kind !== "list") return;
     const onBack = () => {
       setMode({ kind: "list" });
killedBy: HistoryScreen Android hardware back (focus-scoped) back while focused in detail mode returns to the list (behavior unchanged)
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:299:9
   // press on whatever screen is on top.
   const backSub = useRef<{ remove: () => void } | null>(null);
   useEffect(() => {
-    if (mode.kind === "list") return;
+    if (true) return;
     const onBack = () => {
       setMode({ kind: "list" });
killedBy: HistoryScreen Android hardware back (focus-scoped) back while focused in detail mode returns to the list (behavior unchanged)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:300:26
   const backSub = useRef<{ remove: () => void } | null>(null);
   useEffect(() => {
     if (mode.kind === "list") return;
-    const onBack = () => {
-      setMode({ kind: "list" });
-      return true;
-    };
+    const onBack = () => {};
     const addBack = () => {
       backSub.current?.remove();
killedBy: HistoryScreen Android hardware back (focus-scoped) back while focused in detail mode returns to the list (behavior unchanged)
statusReason: expected undefined to be true // Object.is equality

[Killed] ObjectLiteral
src/screens/HistoryScreen.tsx:301:15
   useEffect(() => {
     if (mode.kind === "list") return;
     const onBack = () => {
-      setMode({ kind: "list" });
+      setMode({});
       return true;
     };
killedBy: HistoryScreen Android hardware back (focus-scoped) back while focused in detail mode returns to the list (behavior unchanged)
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/screens/HistoryScreen.tsx:302:14
     if (mode.kind === "list") return;
     const onBack = () => {
       setMode({ kind: "list" });
-      return true;
+      return false;
     };
     const addBack = () => {
killedBy: HistoryScreen Android hardware back (focus-scoped) back while focused in detail mode returns to the list (behavior unchanged)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:304:27
       setMode({ kind: "list" });
       return true;
     };
-    const addBack = () => {
-      backSub.current?.remove();
-      backSub.current = BackHandler.addEventListener("hardwareBackPress", onBack);
-    };
+    const addBack = () => {};
     const removeBack = () => {
       backSub.current?.remove();
killedBy: HistoryScreen Android hardware back (focus-scoped) back while focused in detail mode returns to the list (behavior unchanged)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] OptionalChaining
src/screens/HistoryScreen.tsx:305:7
       return true;
     };
     const addBack = () => {
-      backSub.current?.remove();
+      backSub.current.remove();
       backSub.current = BackHandler.addEventListener("hardwareBackPress", onBack);
     };
killedBy: HistoryScreen list long entries collapse to a one-line snippet with an ellipsis
statusReason: Cannot read properties of null (reading 'remove')

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:308:30
       backSub.current?.remove();
       backSub.current = BackHandler.addEventListener("hardwareBackPress", onBack);
     };
-    const removeBack = () => {
-      backSub.current?.remove();
-      backSub.current = null;
-    };
+    const removeBack = () => {};
     addBack(); // the mode left "list" while this screen was focused
     const subs: Array<() => void> = [];
killedBy: HistoryScreen Android hardware back (focus-scoped) back while focused in detail mode returns to the list (behavior unchanged)
statusReason: expected 1 to be +0 // Object.is equality

[Survived] OptionalChaining
src/screens/HistoryScreen.tsx:309:7
       backSub.current = BackHandler.addEventListener("hardwareBackPress", onBack);
     };
     const removeBack = () => {
-      backSub.current?.remove();
+      backSub.current.remove();
       backSub.current = null;
     };

[Killed] CallExpression
src/screens/HistoryScreen.tsx:312:5
       backSub.current?.remove();
       backSub.current = null;
     };
-    addBack(); // the mode left "list" while this screen was focused
+    ; // the mode left "list" while this screen was focused
     const subs: Array<() => void> = [];
     if (typeof navigation?.addListener === "function") {
killedBy: HistoryScreen Android hardware back (focus-scoped) back while focused in detail mode returns to the list (behavior unchanged)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArrayDeclaration
src/screens/HistoryScreen.tsx:313:37
       backSub.current = null;
     };
     addBack(); // the mode left "list" while this screen was focused
-    const subs: Array<() => void> = [];
+    const subs: Array<() => void> = ["Stryker was here"];
     if (typeof navigation?.addListener === "function") {
       subs.push(
killedBy: HistoryScreen mood badges the entry's own check-in pick wins; the device-local log is the fallback
statusReason: off is not a function

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:314:56
     };
     addBack(); // the mode left "list" while this screen was focused
     const subs: Array<() => void> = [];
-    if (typeof navigation?.addListener === "function") {
-      subs.push(
-        navigation.addListener("focus", addBack) as () => void,
-        navigation.addListener("blur", removeBack) as () => void,
-      );
-    }
+    if (typeof navigation?.addListener === "function") {}
     return () => {
       for (const off of subs) off();
killedBy: HistoryScreen Android hardware back (focus-scoped) blur releases the back press for whichever screen is on top; focus reclaims it
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:314:9
     };
     addBack(); // the mode left "list" while this screen was focused
     const subs: Array<() => void> = [];
-    if (typeof navigation?.addListener === "function") {
+    if (true) {
       subs.push(
         navigation.addListener("focus", addBack) as () => void,
killedBy: HistoryScreen list long entries collapse to a one-line snippet with an ellipsis
statusReason: navigation.addListener is not a function

[Killed] CallExpression
src/screens/HistoryScreen.tsx:315:7
     addBack(); // the mode left "list" while this screen was focused
     const subs: Array<() => void> = [];
     if (typeof navigation?.addListener === "function") {
-      subs.push(
-        navigation.addListener("focus", addBack) as () => void,
-        navigation.addListener("blur", removeBack) as () => void,
-      );
+      ;
     }
     return () => {
killedBy: HistoryScreen Android hardware back (focus-scoped) blur releases the back press for whichever screen is on top; focus reclaims it
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:320:18
         navigation.addListener("blur", removeBack) as () => void,
       );
     }
-    return () => {
-      for (const off of subs) off();
-      removeBack();
-    };
+    return () => {};
   }, [mode.kind, navigation]);
 
killedBy: HistoryScreen Android hardware back (focus-scoped) back while focused in detail mode returns to the list (behavior unchanged)
statusReason: expected 1 to be +0 // Object.is equality

[Survived] CallExpression
src/screens/HistoryScreen.tsx:321:31
       );
     }
     return () => {
-      for (const off of subs) off();
+      for (const off of subs) ;
       removeBack();
     };

[Killed] CallExpression
src/screens/HistoryScreen.tsx:322:7
     }
     return () => {
       for (const off of subs) off();
-      removeBack();
+      ;
     };
   }, [mode.kind, navigation]);
killedBy: HistoryScreen Android hardware back (focus-scoped) back while focused in detail mode returns to the list (behavior unchanged)
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
src/screens/HistoryScreen.tsx:330:78
    * and calendar labels below make clear that they cover downloaded history,
    * rather than silently decrypting a whole account in the background. */
   const loadOlder = async () => {
-    if (historyReloadingRef.current || loadingMoreRef.current || !hasMore || nextOffset === null) return;
+    if (historyReloadingRef.current || loadingMoreRef.current || !hasMore || nextOffset !== null) return;
     const remainingRows = MAX_HISTORY_ROWS - loadedCiphertextRowsRef.current;
     if (
killedBy: HistoryScreen list uses the server's byte-page continuation to load older history
statusReason: expected last "vi.fn()" call to have been called with [ { limit: 100, offset: 1, …(1) } ]

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:330:9
    * and calendar labels below make clear that they cover downloaded history,
    * rather than silently decrypting a whole account in the background. */
   const loadOlder = async () => {
-    if (historyReloadingRef.current || loadingMoreRef.current || !hasMore || nextOffset === null) return;
+    if (true) return;
     const remainingRows = MAX_HISTORY_ROWS - loadedCiphertextRowsRef.current;
     if (
killedBy: HistoryScreen list uses the server's byte-page continuation to load older history
statusReason: expected last "vi.fn()" call to have been called with [ { limit: 100, offset: 1, …(1) } ]

[Survived] ArithmeticOperator
src/screens/HistoryScreen.tsx:331:27
    * rather than silently decrypting a whole account in the background. */
   const loadOlder = async () => {
     if (historyReloadingRef.current || loadingMoreRef.current || !hasMore || nextOffset === null) return;
-    const remainingRows = MAX_HISTORY_ROWS - loadedCiphertextRowsRef.current;
+    const remainingRows = MAX_HISTORY_ROWS + loadedCiphertextRowsRef.current;
     if (
       historyLimitRef.current ||

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:333:7
     if (historyReloadingRef.current || loadingMoreRef.current || !hasMore || nextOffset === null) return;
     const remainingRows = MAX_HISTORY_ROWS - loadedCiphertextRowsRef.current;
     if (
-      historyLimitRef.current ||
-      loadedServerPagesRef.current >= MAX_HISTORY_SERVER_PAGES ||
-      remainingRows <= 0
+      true
     ) {
       historyLimitRef.current = true;
killedBy: HistoryScreen list uses the server's byte-page continuation to load older history
statusReason: expected last "vi.fn()" call to have been called with [ { limit: 100, offset: 1, …(1) } ]

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:333:7
     if (historyReloadingRef.current || loadingMoreRef.current || !hasMore || nextOffset === null) return;
     const remainingRows = MAX_HISTORY_ROWS - loadedCiphertextRowsRef.current;
     if (
-      historyLimitRef.current ||
-      loadedServerPagesRef.current >= MAX_HISTORY_SERVER_PAGES ||
-      remainingRows <= 0
+      false
     ) {
       historyLimitRef.current = true;
killedBy: HistoryScreen list caps manual history downloads and clearly says when more remains on the server
statusReason: expected "vi.fn()" to be called 5 times, but got 6 times

[Killed] EqualityOperator
src/screens/HistoryScreen.tsx:334:7
     const remainingRows = MAX_HISTORY_ROWS - loadedCiphertextRowsRef.current;
     if (
       historyLimitRef.current ||
-      loadedServerPagesRef.current >= MAX_HISTORY_SERVER_PAGES ||
+      loadedServerPagesRef.current < MAX_HISTORY_SERVER_PAGES ||
       remainingRows <= 0
     ) {
killedBy: HistoryScreen list uses the server's byte-page continuation to load older history
statusReason: expected last "vi.fn()" call to have been called with [ { limit: 100, offset: 1, …(1) } ]

[Survived] EqualityOperator
src/screens/HistoryScreen.tsx:334:7
     const remainingRows = MAX_HISTORY_ROWS - loadedCiphertextRowsRef.current;
     if (
       historyLimitRef.current ||
-      loadedServerPagesRef.current >= MAX_HISTORY_SERVER_PAGES ||
+      loadedServerPagesRef.current > MAX_HISTORY_SERVER_PAGES ||
       remainingRows <= 0
     ) {

[Killed] EqualityOperator
src/screens/HistoryScreen.tsx:335:7
     if (
       historyLimitRef.current ||
       loadedServerPagesRef.current >= MAX_HISTORY_SERVER_PAGES ||
-      remainingRows <= 0
+      remainingRows > 0
     ) {
       historyLimitRef.current = true;
killedBy: HistoryScreen list uses the server's byte-page continuation to load older history
statusReason: expected last "vi.fn()" call to have been called with [ { limit: 100, offset: 1, …(1) } ]

[Survived] ConditionalExpression
src/screens/HistoryScreen.tsx:335:7
     if (
       historyLimitRef.current ||
       loadedServerPagesRef.current >= MAX_HISTORY_SERVER_PAGES ||
-      remainingRows <= 0
+      false
     ) {
       historyLimitRef.current = true;

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:336:7
       historyLimitRef.current ||
       loadedServerPagesRef.current >= MAX_HISTORY_SERVER_PAGES ||
       remainingRows <= 0
-    ) {
-      historyLimitRef.current = true;
-      setHistoryLimitReached(true);
-      return;
-    }
+    ) {}
     loadingMoreRef.current = true;
     setLoadingMore(true);
killedBy: HistoryScreen list caps manual history downloads and clearly says when more remains on the server
statusReason: expected "vi.fn()" to be called 5 times, but got 6 times

[Survived] BooleanLiteral
src/screens/HistoryScreen.tsx:337:33
       loadedServerPagesRef.current >= MAX_HISTORY_SERVER_PAGES ||
       remainingRows <= 0
     ) {
-      historyLimitRef.current = true;
+      historyLimitRef.current = false;
       setHistoryLimitReached(true);
       return;

[Survived] BooleanLiteral
src/screens/HistoryScreen.tsx:338:30
       remainingRows <= 0
     ) {
       historyLimitRef.current = true;
-      setHistoryLimitReached(true);
+      setHistoryLimitReached(false);
       return;
     }

[Survived] BooleanLiteral
src/screens/HistoryScreen.tsx:341:30
       setHistoryLimitReached(true);
       return;
     }
-    loadingMoreRef.current = true;
+    loadingMoreRef.current = false;
     setLoadingMore(true);
     const loadEpoch = historyLoadEpochRef.current;

[Survived] BooleanLiteral
src/screens/HistoryScreen.tsx:342:20
       return;
     }
     loadingMoreRef.current = true;
-    setLoadingMore(true);
+    setLoadingMore(false);
     const loadEpoch = historyLoadEpochRef.current;
     const expectedRevision = entriesRevisionRef.current;

[Killed] MethodExpression
src/screens/HistoryScreen.tsx:351:16
       if (!userId) throw new Error("account id missing — sign in again");
       const offset = nextOffset;
       const page = await api.listEntriesPage({
-        limit: Math.min(SERVER_PAGE_SIZE, remainingRows),
+        limit: Math.max(SERVER_PAGE_SIZE, remainingRows),
         offset,
         pageBytes: ENTRY_PAGE_BYTES,
killedBy: HistoryScreen list uses the server's byte-page continuation to load older history
statusReason: expected last "vi.fn()" call to have been called with [ { limit: 100, offset: 1, …(1) } ]

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:354:13
         limit: Math.min(SERVER_PAGE_SIZE, remainingRows),
         offset,
         pageBytes: ENTRY_PAGE_BYTES,
-        ...(expectedRevision === null ? {} : { expectedRevision }),
+        ...(false ? {} : { expectedRevision }),
       });
       if (loadEpoch !== historyLoadEpochRef.current) return;
killedBy: HistoryScreen list uses the server's byte-page continuation to load older history
statusReason: expected last "vi.fn()" call to have been called with [ { limit: 100, offset: 1, …(1) } ]

[Killed] EqualityOperator
src/screens/HistoryScreen.tsx:354:13
         limit: Math.min(SERVER_PAGE_SIZE, remainingRows),
         offset,
         pageBytes: ENTRY_PAGE_BYTES,
-        ...(expectedRevision === null ? {} : { expectedRevision }),
+        ...(expectedRevision !== null ? {} : { expectedRevision }),
       });
       if (loadEpoch !== historyLoadEpochRef.current) return;
killedBy: HistoryScreen list uses the server's byte-page continuation to load older history
statusReason: expected last "vi.fn()" call to have been called with [ { limit: 100, offset: 1, …(1) } ]

[Killed] LogicalOperator
src/screens/HistoryScreen.tsx:357:32
         ...(expectedRevision === null ? {} : { expectedRevision }),
       });
       if (loadEpoch !== historyLoadEpochRef.current) return;
-      const receivedRevision = page.revision ?? null;
+      const receivedRevision = page.revision && null;
       if (
         (expectedRevision === null && receivedRevision !== null) ||
killedBy: HistoryScreen list carries a modern snapshot revision exactly across an older-page request
statusReason: expected 'No entries yet. What you write each d…' to contain 'older snapshot'

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:359:9
       if (loadEpoch !== historyLoadEpochRef.current) return;
       const receivedRevision = page.revision ?? null;
       if (
-        (expectedRevision === null && receivedRevision !== null) ||
-        (expectedRevision !== null && receivedRevision !== expectedRevision)
+        true
       ) {
         // The page client normally catches this first. Retain a UI-level
killedBy: HistoryScreen list uses the server's byte-page continuation to load older history
statusReason: expected last "vi.fn()" call to have been called with [ { limit: 100, offset: 1, …(1) } ]

[Killed] EqualityOperator
src/screens/HistoryScreen.tsx:359:39
       if (loadEpoch !== historyLoadEpochRef.current) return;
       const receivedRevision = page.revision ?? null;
       if (
-        (expectedRevision === null && receivedRevision !== null) ||
+        (expectedRevision === null && receivedRevision === null) ||
         (expectedRevision !== null && receivedRevision !== expectedRevision)
       ) {
killedBy: HistoryScreen list uses the server's byte-page continuation to load older history
statusReason: expected last "vi.fn()" call to have been called with [ { limit: 100, offset: 1, …(1) } ]

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:360:39
       const receivedRevision = page.revision ?? null;
       if (
         (expectedRevision === null && receivedRevision !== null) ||
-        (expectedRevision !== null && receivedRevision !== expectedRevision)
+        (expectedRevision !== null && true)
       ) {
         // The page client normally catches this first. Retain a UI-level
killedBy: HistoryScreen list carries a modern snapshot revision exactly across an older-page request
statusReason: expected 'No entries yet. What you write each d…' to contain 'older snapshot'

[Killed] LogicalOperator
src/screens/HistoryScreen.tsx:360:10
       const receivedRevision = page.revision ?? null;
       if (
         (expectedRevision === null && receivedRevision !== null) ||
-        (expectedRevision !== null && receivedRevision !== expectedRevision)
+        (expectedRevision !== null || receivedRevision !== expectedRevision)
       ) {
         // The page client normally catches this first. Retain a UI-level
killedBy: HistoryScreen list carries a modern snapshot revision exactly across an older-page request
statusReason: expected 'No entries yet. What you write each d…' to contain 'older snapshot'

[NoCoverage] BlockStatement
src/screens/HistoryScreen.tsx:361:9
       if (
         (expectedRevision === null && receivedRevision !== null) ||
         (expectedRevision !== null && receivedRevision !== expectedRevision)
-      ) {
-        // The page client normally catches this first. Retain a UI-level
-        // guard so a future alternate client/mock cannot append a page from a
-        // different snapshot (including a mixed legacy/modern deployment).
-        showStatus(SNAPSHOT_RELOAD_STATUS, "neutral");
-        void load(true);
-        return;
-      }
+      ) {}
       const rows = page.entries;
       const incoming: HistoryEntry[] = [];

[NoCoverage] BooleanLiteral
src/screens/HistoryScreen.tsx:366:19
         // guard so a future alternate client/mock cannot append a page from a
         // different snapshot (including a mixed legacy/modern deployment).
         showStatus(SNAPSHOT_RELOAD_STATUS, "neutral");
-        void load(true);
+        void load(false);
         return;
       }

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:372:31
       const rows = page.entries;
       const incoming: HistoryEntry[] = [];
       let failed = 0;
-      for (const row of rows) {
-        try {
-          const payload = decryptEntry(vault.get(), userId, row.client_entry_id, row.blob);
-          incoming.push({
-            clientEntryId: row.client_entry_id,
-            entryDate: typeof row.entry_date === "string" ? row.entry_date : "",
-            receivedAt: typeof row.received_at === "string" ? row.received_at : "",
-            text: typeof payload.text === "string" ? payload.text : "",
-            sentiment: sanitizeSentiment(payload.sentiment),
-          });
-        } catch {
-          failed += 1;
-        }
-      }
+      for (const row of rows) {}
       setEntries((previous) => {
         const byId = new Map(previous.map((entry) => [entry.clientEntryId, entry]));
killedBy: HistoryScreen list uses the server's byte-page continuation to load older history
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' to contain 'second page'

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:373:13
       const incoming: HistoryEntry[] = [];
       let failed = 0;
       for (const row of rows) {
-        try {
-          const payload = decryptEntry(vault.get(), userId, row.client_entry_id, row.blob);
-          incoming.push({
-            clientEntryId: row.client_entry_id,
-            entryDate: typeof row.entry_date === "string" ? row.entry_date : "",
-            receivedAt: typeof row.received_at === "string" ? row.received_at : "",
-            text: typeof payload.text === "string" ? payload.text : "",
-            sentiment: sanitizeSentiment(payload.sentiment),
-          });
-        } catch {
+        try {} catch {
           failed += 1;
         }
killedBy: HistoryScreen list uses the server's byte-page continuation to load older history
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' to contain 'second page'

[Survived] ConditionalExpression
src/screens/HistoryScreen.tsx:378:25
           incoming.push({
             clientEntryId: row.client_entry_id,
             entryDate: typeof row.entry_date === "string" ? row.entry_date : "",
-            receivedAt: typeof row.received_at === "string" ? row.received_at : "",
+            receivedAt: false ? row.received_at : "",
             text: typeof payload.text === "string" ? payload.text : "",
             sentiment: sanitizeSentiment(payload.sentiment),

[NoCoverage] BlockStatement
src/screens/HistoryScreen.tsx:382:17
             text: typeof payload.text === "string" ? payload.text : "",
             sentiment: sanitizeSentiment(payload.sentiment),
           });
-        } catch {
-          failed += 1;
-        }
+        } catch {}
       }
       setEntries((previous) => {

[NoCoverage] AssignmentOperator
src/screens/HistoryScreen.tsx:383:11
             sentiment: sanitizeSentiment(payload.sentiment),
           });
         } catch {
-          failed += 1;
+          failed -= 1;
         }
       }

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:386:32
           failed += 1;
         }
       }
-      setEntries((previous) => {
-        const byId = new Map(previous.map((entry) => [entry.clientEntryId, entry]));
-        for (const entry of incoming) byId.set(entry.clientEntryId, entry);
-        return [...byId.values()].sort((a, b) => b.entryDate.localeCompare(a.entryDate) || b.receivedAt.localeCompare(a.receivedAt));
-      });
+      setEntries((previous) => {});
       setUnreadable((previous) => previous + failed);
       setNextOffset(page.nextOffset);
killedBy: HistoryScreen list uses the server's byte-page continuation to load older history
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/screens/HistoryScreen.tsx:387:43
         }
       }
       setEntries((previous) => {
-        const byId = new Map(previous.map((entry) => [entry.clientEntryId, entry]));
+        const byId = new Map(previous.map(() => undefined));
         for (const entry of incoming) byId.set(entry.clientEntryId, entry);
         return [...byId.values()].sort((a, b) => b.entryDate.localeCompare(a.entryDate) || b.receivedAt.localeCompare(a.receivedAt));
killedBy: HistoryScreen list uses the server's byte-page continuation to load older history
statusReason: Iterator value undefined is not an entry object

[Killed] ArrayDeclaration
src/screens/HistoryScreen.tsx:387:54
         }
       }
       setEntries((previous) => {
-        const byId = new Map(previous.map((entry) => [entry.clientEntryId, entry]));
+        const byId = new Map(previous.map((entry) => []));
         for (const entry of incoming) byId.set(entry.clientEntryId, entry);
         return [...byId.values()].sort((a, b) => b.entryDate.localeCompare(a.entryDate) || b.receivedAt.localeCompare(a.receivedAt));
killedBy: HistoryScreen list uses the server's byte-page continuation to load older history
statusReason: Cannot read properties of undefined (reading 'entryDate')

[Killed] CallExpression
src/screens/HistoryScreen.tsx:388:39
       }
       setEntries((previous) => {
         const byId = new Map(previous.map((entry) => [entry.clientEntryId, entry]));
-        for (const entry of incoming) byId.set(entry.clientEntryId, entry);
+        for (const entry of incoming) ;
         return [...byId.values()].sort((a, b) => b.entryDate.localeCompare(a.entryDate) || b.receivedAt.localeCompare(a.receivedAt));
       });
killedBy: HistoryScreen list uses the server's byte-page continuation to load older history
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' to contain 'second page'

[Survived] LogicalOperator
src/screens/HistoryScreen.tsx:389:50
       setEntries((previous) => {
         const byId = new Map(previous.map((entry) => [entry.clientEntryId, entry]));
         for (const entry of incoming) byId.set(entry.clientEntryId, entry);
-        return [...byId.values()].sort((a, b) => b.entryDate.localeCompare(a.entryDate) || b.receivedAt.localeCompare(a.receivedAt));
+        return [...byId.values()].sort((a, b) => b.entryDate.localeCompare(a.entryDate) && b.receivedAt.localeCompare(a.receivedAt));
       });
       setUnreadable((previous) => previous + failed);

[Survived] ArrowFunction
src/screens/HistoryScreen.tsx:389:40
       setEntries((previous) => {
         const byId = new Map(previous.map((entry) => [entry.clientEntryId, entry]));
         for (const entry of incoming) byId.set(entry.clientEntryId, entry);
-        return [...byId.values()].sort((a, b) => b.entryDate.localeCompare(a.entryDate) || b.receivedAt.localeCompare(a.receivedAt));
+        return [...byId.values()].sort(() => undefined);
       });
       setUnreadable((previous) => previous + failed);
