[Survived] ArrowFunction
src/screens/HistoryScreen.tsx:391:21
         for (const entry of incoming) byId.set(entry.clientEntryId, entry);
         return [...byId.values()].sort((a, b) => b.entryDate.localeCompare(a.entryDate) || b.receivedAt.localeCompare(a.receivedAt));
       });
-      setUnreadable((previous) => previous + failed);
+      setUnreadable(() => undefined);
       setNextOffset(page.nextOffset);
       setHasMore(page.nextOffset !== null);

[Survived] ArithmeticOperator
src/screens/HistoryScreen.tsx:391:35
         for (const entry of incoming) byId.set(entry.clientEntryId, entry);
         return [...byId.values()].sort((a, b) => b.entryDate.localeCompare(a.entryDate) || b.receivedAt.localeCompare(a.receivedAt));
       });
-      setUnreadable((previous) => previous + failed);
+      setUnreadable((previous) => previous - failed);
       setNextOffset(page.nextOffset);
       setHasMore(page.nextOffset !== null);

[Survived] CallExpression
src/screens/HistoryScreen.tsx:392:7
         return [...byId.values()].sort((a, b) => b.entryDate.localeCompare(a.entryDate) || b.receivedAt.localeCompare(a.receivedAt));
       });
       setUnreadable((previous) => previous + failed);
-      setNextOffset(page.nextOffset);
+      ;
       setHasMore(page.nextOffset !== null);
       entriesRevisionRef.current = receivedRevision;

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:393:18
       });
       setUnreadable((previous) => previous + failed);
       setNextOffset(page.nextOffset);
-      setHasMore(page.nextOffset !== null);
+      setHasMore(true);
       entriesRevisionRef.current = receivedRevision;
       const nextPageCount = loadedServerPagesRef.current + 1;
killedBy: HistoryScreen list uses the server's byte-page continuation to load older history
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' not to contain 'Load older entries'

[Killed] ArithmeticOperator
src/screens/HistoryScreen.tsx:395:29
       setNextOffset(page.nextOffset);
       setHasMore(page.nextOffset !== null);
       entriesRevisionRef.current = receivedRevision;
-      const nextPageCount = loadedServerPagesRef.current + 1;
+      const nextPageCount = loadedServerPagesRef.current - 1;
       const nextRowCount = loadedCiphertextRowsRef.current + rows.length;
       loadedServerPagesRef.current = nextPageCount;
killedBy: HistoryScreen list caps manual history downloads and clearly says when more remains on the server
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' to contain 'safe download limit (500 entries or 5…'

[Survived] ArithmeticOperator
src/screens/HistoryScreen.tsx:396:28
       setHasMore(page.nextOffset !== null);
       entriesRevisionRef.current = receivedRevision;
       const nextPageCount = loadedServerPagesRef.current + 1;
-      const nextRowCount = loadedCiphertextRowsRef.current + rows.length;
+      const nextRowCount = loadedCiphertextRowsRef.current - rows.length;
       loadedServerPagesRef.current = nextPageCount;
       loadedCiphertextRowsRef.current = nextRowCount;

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:400:9
       loadedServerPagesRef.current = nextPageCount;
       loadedCiphertextRowsRef.current = nextRowCount;
       historyLimitRef.current =
-        page.nextOffset !== null &&
-        (nextPageCount >= MAX_HISTORY_SERVER_PAGES || nextRowCount >= MAX_HISTORY_ROWS);
+        false;
       setHistoryLimitReached(historyLimitRef.current);
       // Reveal the just loaded rows, rather than making a second tap feel
killedBy: HistoryScreen list caps manual history downloads and clearly says when more remains on the server
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' to contain 'safe download limit (500 entries or 5…'

[Killed] LogicalOperator
src/screens/HistoryScreen.tsx:400:9
       loadedServerPagesRef.current = nextPageCount;
       loadedCiphertextRowsRef.current = nextRowCount;
       historyLimitRef.current =
-        page.nextOffset !== null &&
-        (nextPageCount >= MAX_HISTORY_SERVER_PAGES || nextRowCount >= MAX_HISTORY_ROWS);
+        page.nextOffset !== null || nextPageCount >= MAX_HISTORY_SERVER_PAGES || nextRowCount >= MAX_HISTORY_ROWS;
       setHistoryLimitReached(historyLimitRef.current);
       // Reveal the just loaded rows, rather than making a second tap feel
killedBy: HistoryScreen list caps manual history downloads and clearly says when more remains on the server
statusReason: no Text node containing "Load older entries":

[Killed] LogicalOperator
src/screens/HistoryScreen.tsx:401:10
       loadedCiphertextRowsRef.current = nextRowCount;
       historyLimitRef.current =
         page.nextOffset !== null &&
-        (nextPageCount >= MAX_HISTORY_SERVER_PAGES || nextRowCount >= MAX_HISTORY_ROWS);
+        (nextPageCount >= MAX_HISTORY_SERVER_PAGES && nextRowCount >= MAX_HISTORY_ROWS);
       setHistoryLimitReached(historyLimitRef.current);
       // Reveal the just loaded rows, rather than making a second tap feel
killedBy: HistoryScreen list caps manual history downloads and clearly says when more remains on the server
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' to contain 'safe download limit (500 entries or 5…'

[Killed] EqualityOperator
src/screens/HistoryScreen.tsx:401:10
       loadedCiphertextRowsRef.current = nextRowCount;
       historyLimitRef.current =
         page.nextOffset !== null &&
-        (nextPageCount >= MAX_HISTORY_SERVER_PAGES || nextRowCount >= MAX_HISTORY_ROWS);
+        (nextPageCount > MAX_HISTORY_SERVER_PAGES || nextRowCount >= MAX_HISTORY_ROWS);
       setHistoryLimitReached(historyLimitRef.current);
       // Reveal the just loaded rows, rather than making a second tap feel
killedBy: HistoryScreen list caps manual history downloads and clearly says when more remains on the server
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' to contain 'safe download limit (500 entries or 5…'

[Killed] CallExpression
src/screens/HistoryScreen.tsx:402:7
       historyLimitRef.current =
         page.nextOffset !== null &&
         (nextPageCount >= MAX_HISTORY_SERVER_PAGES || nextRowCount >= MAX_HISTORY_ROWS);
-      setHistoryLimitReached(historyLimitRef.current);
+      ;
       // Reveal the just loaded rows, rather than making a second tap feel
       // like nothing happened.
killedBy: HistoryScreen list caps manual history downloads and clearly says when more remains on the server
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' to contain 'safe download limit (500 entries or 5…'

[Killed] ArrowFunction
src/screens/HistoryScreen.tsx:405:16
       setHistoryLimitReached(historyLimitRef.current);
       // Reveal the just loaded rows, rather than making a second tap feel
       // like nothing happened.
-      setShown((previous) => previous + SERVER_PAGE_SIZE);
+      setShown(() => undefined);
     } catch (err) {
       if (loadEpoch !== historyLoadEpochRef.current) return;
killedBy: HistoryScreen list caps manual history downloads and clearly says when more remains on the server
statusReason: no Text node containing "Load older entries":
‹ | September 2026 | › | M | T | W | T | F | S | S | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 | 11 | 12 | 13 | 14 | 15 | 16 | 17 | 18 | 19 | 20 | 21 | 22 | 23 | 24 | 25 | 26 | 27 | 28 | 29 | 30 | 2026-09-02 | cap page 2 | 2026-09-01 | cap page 1 | Need help now? Crisis resources

[Killed] ArithmeticOperator
src/screens/HistoryScreen.tsx:405:30
       setHistoryLimitReached(historyLimitRef.current);
       // Reveal the just loaded rows, rather than making a second tap feel
       // like nothing happened.
-      setShown((previous) => previous + SERVER_PAGE_SIZE);
+      setShown((previous) => previous - SERVER_PAGE_SIZE);
     } catch (err) {
       if (loadEpoch !== historyLoadEpochRef.current) return;
killedBy: HistoryScreen list uses the server's byte-page continuation to load older history
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' to contain 'second page'

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:406:19
       // Reveal the just loaded rows, rather than making a second tap feel
       // like nothing happened.
       setShown((previous) => previous + SERVER_PAGE_SIZE);
-    } catch (err) {
-      if (loadEpoch !== historyLoadEpochRef.current) return;
-      if (err instanceof ApiError && err.status === 409) {
-        showStatus(SNAPSHOT_RELOAD_STATUS, "neutral");
-        void load(true);
-      } else {
-        Alert.alert("Could not load older entries", requestFailureCopy(err));
-      }
-    } finally {
+    } catch (err) {} finally {
       loadingMoreRef.current = false;
       setLoadingMore(false);
killedBy: HistoryScreen list restarts cleanly from page one when the snapshot changes while loading older history
statusReason: expected 3rd "vi.fn()" call to have been called with [ { limit: 100, offset: +0, …(1) } ], but called only 2 times

[Killed] EqualityOperator
src/screens/HistoryScreen.tsx:408:38
       setShown((previous) => previous + SERVER_PAGE_SIZE);
     } catch (err) {
       if (loadEpoch !== historyLoadEpochRef.current) return;
-      if (err instanceof ApiError && err.status === 409) {
+      if (err instanceof ApiError && err.status !== 409) {
         showStatus(SNAPSHOT_RELOAD_STATUS, "neutral");
         void load(true);
killedBy: HistoryScreen list restarts cleanly from page one when the snapshot changes while loading older history
statusReason: expected 3rd "vi.fn()" call to have been called with [ { limit: 100, offset: +0, …(1) } ], but called only 2 times

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:408:58
       setShown((previous) => previous + SERVER_PAGE_SIZE);
     } catch (err) {
       if (loadEpoch !== historyLoadEpochRef.current) return;
-      if (err instanceof ApiError && err.status === 409) {
-        showStatus(SNAPSHOT_RELOAD_STATUS, "neutral");
-        void load(true);
-      } else {
+      if (err instanceof ApiError && err.status === 409) {} else {
         Alert.alert("Could not load older entries", requestFailureCopy(err));
       }
killedBy: HistoryScreen list restarts cleanly from page one when the snapshot changes while loading older history
statusReason: expected 3rd "vi.fn()" call to have been called with [ { limit: 100, offset: +0, …(1) } ], but called only 2 times

[NoCoverage] BlockStatement
src/screens/HistoryScreen.tsx:411:14
       if (err instanceof ApiError && err.status === 409) {
         showStatus(SNAPSHOT_RELOAD_STATUS, "neutral");
         void load(true);
-      } else {
-        Alert.alert("Could not load older entries", requestFailureCopy(err));
-      }
+      } else {}
     } finally {
       loadingMoreRef.current = false;

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:414:15
       } else {
         Alert.alert("Could not load older entries", requestFailureCopy(err));
       }
-    } finally {
-      loadingMoreRef.current = false;
-      setLoadingMore(false);
-    }
+    } finally {}
   };
 
killedBy: HistoryScreen list caps manual history downloads and clearly says when more remains on the server
statusReason: no Text node containing "Load older entries":

[Killed] BooleanLiteral
src/screens/HistoryScreen.tsx:415:32
         Alert.alert("Could not load older entries", requestFailureCopy(err));
       }
     } finally {
-      loadingMoreRef.current = false;
+      loadingMoreRef.current = true;
       setLoadingMore(false);
     }
killedBy: HistoryScreen list caps manual history downloads and clearly says when more remains on the server
statusReason: expected "vi.fn()" to be called 5 times, but got 2 times

[Killed] BooleanLiteral
src/screens/HistoryScreen.tsx:416:22
       }
     } finally {
       loadingMoreRef.current = false;
-      setLoadingMore(false);
+      setLoadingMore(true);
     }
   };
killedBy: HistoryScreen list caps manual history downloads and clearly says when more remains on the server
statusReason: no Text node containing "Load older entries":

[Killed] ArrowFunction
src/screens/HistoryScreen.tsx:422:22
 
   /** Badge value: the entry's own check-in pick first, the mood log's day
    *  value as fallback; undefined = no badge (never a verdict). */
-  const badgeValue = (entry: HistoryEntry): number | undefined =>
-    entry.sentiment ?? logMoods[entry.entryDate];
+  const badgeValue = () => undefined;
 
   const runDelete = async (entry: HistoryEntry) => {
killedBy: HistoryScreen list a crafted payload sentiment is clamped before it ever renders
statusReason: expected [] to deeply equal [ 'Mood: Light' ]

[Killed] LogicalOperator
src/screens/HistoryScreen.tsx:423:5
   /** Badge value: the entry's own check-in pick first, the mood log's day
    *  value as fallback; undefined = no badge (never a verdict). */
   const badgeValue = (entry: HistoryEntry): number | undefined =>
-    entry.sentiment ?? logMoods[entry.entryDate];
+    entry.sentiment && logMoods[entry.entryDate];
 
   const runDelete = async (entry: HistoryEntry) => {
killedBy: HistoryScreen list a failing mood-log read still renders the entries — just without fallback badges
statusReason: expected [ 'Mood: Okay' ] to have a length of +0 but got 1

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:426:9
     entry.sentiment ?? logMoods[entry.entryDate];
 
   const runDelete = async (entry: HistoryEntry) => {
-    if (busyRef.current) return;
+    if (false) return;
     busyRef.current = true;
     setBusy(true);
killedBy: HistoryScreen delete a double-tap on the final confirmation deletes once (the busy guard)
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:426:9
     entry.sentiment ?? logMoods[entry.entryDate];
 
   const runDelete = async (entry: HistoryEntry) => {
-    if (busyRef.current) return;
+    if (true) return;
     busyRef.current = true;
     setBusy(true);
killedBy: HistoryScreen delete is a calm double confirmation — and only then hits the server
statusReason: expected "vi.fn()" to be called with arguments: [ 'e-2026-09-03-bbb' ]

Number of calls: 0

[Killed] BooleanLiteral
src/screens/HistoryScreen.tsx:427:23
 
   const runDelete = async (entry: HistoryEntry) => {
     if (busyRef.current) return;
-    busyRef.current = true;
+    busyRef.current = false;
     setBusy(true);
     try {
killedBy: HistoryScreen delete a double-tap on the final confirmation deletes once (the busy guard)
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BooleanLiteral
src/screens/HistoryScreen.tsx:428:13
   const runDelete = async (entry: HistoryEntry) => {
     if (busyRef.current) return;
     busyRef.current = true;
-    setBusy(true);
+    setBusy(false);
     try {
       await api.deleteEntry(entry.clientEntryId);
killedBy: HistoryScreen pins: delete flow while the delete is in flight the screen is busy
statusReason: expected { disabled: false } to deeply equal { disabled: true }

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:429:9
     if (busyRef.current) return;
     busyRef.current = true;
     setBusy(true);
-    try {
-      await api.deleteEntry(entry.clientEntryId);
-      setEntries((prev) => prev.filter((e) => e.clientEntryId !== entry.clientEntryId));
-      // Stryker disable next-line ObjectLiteral,StringLiteral: nothing compares mode.kind to "list" — the mutated state fails the edit/detail checks and falls through to the identical list return
-      setMode({ kind: "list" });
-      // Stryker disable next-line StringLiteral: InlineStatus only branches on tone === "ok"; tone "" colors exactly like "neutral"
-      showStatus("Entry deleted", "neutral");
-    } catch (err) {
+    try {} catch (err) {
       if (err instanceof ApiError && err.status === 404) {
         // Already gone server-side: the end state the user asked for.
killedBy: HistoryScreen delete is a calm double confirmation — and only then hits the server
statusReason: expected "vi.fn()" to be called with arguments: [ 'e-2026-09-03-bbb' ]

Number of calls: 0

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:431:47
     setBusy(true);
     try {
       await api.deleteEntry(entry.clientEntryId);
-      setEntries((prev) => prev.filter((e) => e.clientEntryId !== entry.clientEntryId));
+      setEntries((prev) => prev.filter((e) => true));
       // Stryker disable next-line ObjectLiteral,StringLiteral: nothing compares mode.kind to "list" — the mutated state fails the edit/detail checks and falls through to the identical list return
       setMode({ kind: "list" });
killedBy: HistoryScreen delete is a calm double confirmation — and only then hits the server
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' to contain 'No entries yet.'

[Killed] MethodExpression
src/screens/HistoryScreen.tsx:431:28
     setBusy(true);
     try {
       await api.deleteEntry(entry.clientEntryId);
-      setEntries((prev) => prev.filter((e) => e.clientEntryId !== entry.clientEntryId));
+      setEntries((prev) => prev);
       // Stryker disable next-line ObjectLiteral,StringLiteral: nothing compares mode.kind to "list" — the mutated state fails the edit/detail checks and falls through to the identical list return
       setMode({ kind: "list" });
killedBy: HistoryScreen delete is a calm double confirmation — and only then hits the server
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' to contain 'No entries yet.'

[Killed] CallExpression
src/screens/HistoryScreen.tsx:433:7
       await api.deleteEntry(entry.clientEntryId);
       setEntries((prev) => prev.filter((e) => e.clientEntryId !== entry.clientEntryId));
       // Stryker disable next-line ObjectLiteral,StringLiteral: nothing compares mode.kind to "list" — the mutated state fails the edit/detail checks and falls through to the identical list return
-      setMode({ kind: "list" });
+      ;
       // Stryker disable next-line StringLiteral: InlineStatus only branches on tone === "ok"; tone "" colors exactly like "neutral"
       showStatus("Entry deleted", "neutral");
killedBy: HistoryScreen delete is a calm double confirmation — and only then hits the server
statusReason: expected 'Thursday, September 3, 2026 to be rem…' to contain 'No entries yet.'

[Killed] CallExpression
src/screens/HistoryScreen.tsx:435:7
       // Stryker disable next-line ObjectLiteral,StringLiteral: nothing compares mode.kind to "list" — the mutated state fails the edit/detail checks and falls through to the identical list return
       setMode({ kind: "list" });
       // Stryker disable next-line StringLiteral: InlineStatus only branches on tone === "ok"; tone "" colors exactly like "neutral"
-      showStatus("Entry deleted", "neutral");
+      ;
     } catch (err) {
       if (err instanceof ApiError && err.status === 404) {
killedBy: HistoryScreen delete is a calm double confirmation — and only then hits the server
statusReason: expected 'No entries yet. What you write each d…' to contain 'Entry deleted'

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:436:19
       setMode({ kind: "list" });
       // Stryker disable next-line StringLiteral: InlineStatus only branches on tone === "ok"; tone "" colors exactly like "neutral"
       showStatus("Entry deleted", "neutral");
-    } catch (err) {
-      if (err instanceof ApiError && err.status === 404) {
-        // Already gone server-side: the end state the user asked for.
-        setEntries((prev) => prev.filter((e) => e.clientEntryId !== entry.clientEntryId));
-        // Stryker disable next-line ObjectLiteral,StringLiteral: nothing compares mode.kind to "list" — the mutated state falls through to the identical list return
-        setMode({ kind: "list" });
-        // Stryker disable next-line StringLiteral: InlineStatus only branches on tone === "ok"; tone "" colors exactly like "neutral"
-        showStatus("Entry deleted", "neutral");
-      } else if (err instanceof ApiError && err.status === 0) {
-        Alert.alert(
-          "Needs a connection",
-          "Deleting removes the entry from the server, so it can't run offline. Connect and try again — nothing was changed.",
-        );
-      } else {
-        Alert.alert("Could not delete", requestFailureCopy(err));
-      }
-    } finally {
+    } catch (err) {} finally {
       busyRef.current = false;
       setBusy(false);
killedBy: HistoryScreen pins: delete flow a 404 removes exactly the target entry — siblings stay
statusReason: expected 'Thursday, September 3, 2026 target en…' not to contain 'target entry'

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:437:11
       // Stryker disable next-line StringLiteral: InlineStatus only branches on tone === "ok"; tone "" colors exactly like "neutral"
       showStatus("Entry deleted", "neutral");
     } catch (err) {
-      if (err instanceof ApiError && err.status === 404) {
+      if (true) {
         // Already gone server-side: the end state the user asked for.
         setEntries((prev) => prev.filter((e) => e.clientEntryId !== entry.clientEntryId));
killedBy: HistoryScreen delete an offline delete changes nothing and says so
statusReason: expected 'Final confirmation' to be 'Needs a connection' // Object.is equality

[Killed] EqualityOperator
src/screens/HistoryScreen.tsx:437:38
       // Stryker disable next-line StringLiteral: InlineStatus only branches on tone === "ok"; tone "" colors exactly like "neutral"
       showStatus("Entry deleted", "neutral");
     } catch (err) {
-      if (err instanceof ApiError && err.status === 404) {
+      if (err instanceof ApiError && err.status !== 404) {
         // Already gone server-side: the end state the user asked for.
         setEntries((prev) => prev.filter((e) => e.clientEntryId !== entry.clientEntryId));
killedBy: HistoryScreen delete an offline delete changes nothing and says so
statusReason: expected 'Final confirmation' to be 'Needs a connection' // Object.is equality

[Killed] ArrowFunction
src/screens/HistoryScreen.tsx:439:42
     } catch (err) {
       if (err instanceof ApiError && err.status === 404) {
         // Already gone server-side: the end state the user asked for.
-        setEntries((prev) => prev.filter((e) => e.clientEntryId !== entry.clientEntryId));
+        setEntries((prev) => prev.filter(() => undefined));
         // Stryker disable next-line ObjectLiteral,StringLiteral: nothing compares mode.kind to "list" — the mutated state falls through to the identical list return
         setMode({ kind: "list" });
killedBy: HistoryScreen pins: delete flow a 404 removes exactly the target entry — siblings stay
statusReason: expected 'No entries yet. What you write each d…' to contain 'sibling entry'

[Killed] EqualityOperator
src/screens/HistoryScreen.tsx:439:49
     } catch (err) {
       if (err instanceof ApiError && err.status === 404) {
         // Already gone server-side: the end state the user asked for.
-        setEntries((prev) => prev.filter((e) => e.clientEntryId !== entry.clientEntryId));
+        setEntries((prev) => prev.filter((e) => e.clientEntryId === entry.clientEntryId));
         // Stryker disable next-line ObjectLiteral,StringLiteral: nothing compares mode.kind to "list" — the mutated state falls through to the identical list return
         setMode({ kind: "list" });
killedBy: HistoryScreen delete a 404 delete is already the goal state — the row goes quietly
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' to contain 'No entries yet.'

[Killed] CallExpression
src/screens/HistoryScreen.tsx:441:9
         // Already gone server-side: the end state the user asked for.
         setEntries((prev) => prev.filter((e) => e.clientEntryId !== entry.clientEntryId));
         // Stryker disable next-line ObjectLiteral,StringLiteral: nothing compares mode.kind to "list" — the mutated state falls through to the identical list return
-        setMode({ kind: "list" });
+        ;
         // Stryker disable next-line StringLiteral: InlineStatus only branches on tone === "ok"; tone "" colors exactly like "neutral"
         showStatus("Entry deleted", "neutral");
killedBy: HistoryScreen delete a 404 delete is already the goal state — the row goes quietly
statusReason: expected 'Thursday, September 3, 2026 to be rem…' to contain 'No entries yet.'

[Killed] EqualityOperator
src/screens/HistoryScreen.tsx:444:45
         setMode({ kind: "list" });
         // Stryker disable next-line StringLiteral: InlineStatus only branches on tone === "ok"; tone "" colors exactly like "neutral"
         showStatus("Entry deleted", "neutral");
-      } else if (err instanceof ApiError && err.status === 0) {
+      } else if (err instanceof ApiError && err.status !== 0) {
         Alert.alert(
           "Needs a connection",
killedBy: HistoryScreen delete an offline delete changes nothing and says so
statusReason: expected 'Could not delete' to be 'Needs a connection' // Object.is equality

[Killed] LogicalOperator
src/screens/HistoryScreen.tsx:444:18
         setMode({ kind: "list" });
         // Stryker disable next-line StringLiteral: InlineStatus only branches on tone === "ok"; tone "" colors exactly like "neutral"
         showStatus("Entry deleted", "neutral");
-      } else if (err instanceof ApiError && err.status === 0) {
+      } else if (err instanceof ApiError || err.status === 0) {
         Alert.alert(
           "Needs a connection",
killedBy: HistoryScreen delete other delete failures surface calm copy and keep the entry
statusReason: expected 'Needs a connection' to be 'Could not delete' // Object.is equality

[Killed] StringLiteral
src/screens/HistoryScreen.tsx:447:11
       } else if (err instanceof ApiError && err.status === 0) {
         Alert.alert(
           "Needs a connection",
-          "Deleting removes the entry from the server, so it can't run offline. Connect and try again — nothing was changed.",
+          "",
         );
       } else {
killedBy: HistoryScreen delete an offline delete changes nothing and says so
statusReason: expected '' to contain 'can\'t run offline'

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:449:14
           "Needs a connection",
           "Deleting removes the entry from the server, so it can't run offline. Connect and try again — nothing was changed.",
         );
-      } else {
-        Alert.alert("Could not delete", requestFailureCopy(err));
-      }
+      } else {}
     } finally {
       busyRef.current = false;
killedBy: HistoryScreen delete other delete failures surface calm copy and keep the entry
statusReason: expected 'Final confirmation' to be 'Could not delete' // Object.is equality

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:452:15
       } else {
         Alert.alert("Could not delete", requestFailureCopy(err));
       }
-    } finally {
-      busyRef.current = false;
-      setBusy(false);
-    }
+    } finally {}
   };
 
killedBy: HistoryScreen edit (atomic replacement) a live status line is replaced, not stacked, by the next one
statusReason: no Text node containing "Save changes":
Wednesday, September 2, 2026 | Cancel | Need help now? Crisis resources

[Killed] BooleanLiteral
src/screens/HistoryScreen.tsx:453:25
         Alert.alert("Could not delete", requestFailureCopy(err));
       }
     } finally {
-      busyRef.current = false;
+      busyRef.current = true;
       setBusy(false);
     }
killedBy: HistoryScreen edit (atomic replacement) a live status line is replaced, not stacked, by the next one
statusReason: expected 'Wednesday, September 2, 2026 Save cha…' to contain 'Updated ✓'

[Killed] BooleanLiteral
src/screens/HistoryScreen.tsx:454:15
       }
     } finally {
       busyRef.current = false;
-      setBusy(false);
+      setBusy(true);
     }
   };
killedBy: HistoryScreen edit (atomic replacement) a live status line is replaced, not stacked, by the next one
statusReason: no Text node containing "Save changes":
Wednesday, September 2, 2026 | Cancel | Need help now? Crisis resources

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:460:50
 
   /** Calm double confirmation: scope first ("every device"), permanence
    *  second. Neither dialog rushes or shames. */
-  const confirmDelete = (entry: HistoryEntry) => {
-    Alert.alert(
-      "Delete this entry?",
-      "This removes the entry from your journal on every device. This can't be undone.",
-      [
-        { text: "Cancel", style: "cancel" },
-        {
-          text: "Delete",
-          style: "destructive",
-          onPress: () =>
-            Alert.alert("Final confirmation", "Deleting is permanent — there is no copy anywhere to restore from.", [
-              { text: "Cancel", style: "cancel" },
-              { text: "Delete permanently", style: "destructive", onPress: () => void runDelete(entry) },
-            ]),
-        },
-      ],
-    );
-  };
+  const confirmDelete = (entry: HistoryEntry) => {};
 
   const startEdit = (entry: HistoryEntry) => {
killedBy: HistoryScreen delete is a calm double confirmation — and only then hits the server
statusReason: Alert.alert was never called

[Killed] StringLiteral
src/screens/HistoryScreen.tsx:462:7
    *  second. Neither dialog rushes or shames. */
   const confirmDelete = (entry: HistoryEntry) => {
     Alert.alert(
-      "Delete this entry?",
+      "",
       "This removes the entry from your journal on every device. This can't be undone.",
       [
killedBy: HistoryScreen delete is a calm double confirmation — and only then hits the server
statusReason: expected '' to be 'Delete this entry?' // Object.is equality
