[Killed] StringLiteral
src/screens/HistoryScreen.tsx:465:34
       "Delete this entry?",
       "This removes the entry from your journal on every device. This can't be undone.",
       [
-        { text: "Cancel", style: "cancel" },
+        { text: "Cancel", style: "" },
         {
           text: "Delete",
killedBy: HistoryScreen pins: delete flow both dialogs mark their destructive buttons exactly
statusReason: expected [ { text: 'Cancel', style: '' }, …(1) ] to deeply equal [ { text: 'Cancel', …(1) }, …(1) ]

[Killed] ObjectLiteral
src/screens/HistoryScreen.tsx:466:9
       "This removes the entry from your journal on every device. This can't be undone.",
       [
         { text: "Cancel", style: "cancel" },
-        {
-          text: "Delete",
-          style: "destructive",
-          onPress: () =>
-            Alert.alert("Final confirmation", "Deleting is permanent — there is no copy anywhere to restore from.", [
-              { text: "Cancel", style: "cancel" },
-              { text: "Delete permanently", style: "destructive", onPress: () => void runDelete(entry) },
-            ]),
-        },
+        {},
       ],
     );
killedBy: HistoryScreen delete is a calm double confirmation — and only then hits the server
statusReason: no alert button "Delete"; buttons: [{"text":"Cancel","style":"cancel"},{}]

[Killed] StringLiteral
src/screens/HistoryScreen.tsx:467:17
       [
         { text: "Cancel", style: "cancel" },
         {
-          text: "Delete",
+          text: "",
           style: "destructive",
           onPress: () =>
killedBy: HistoryScreen delete is a calm double confirmation — and only then hits the server
statusReason: no alert button "Delete"; buttons: [{"text":"Cancel","style":"cancel"},{"text":"","style":"destructive"}]

[Killed] StringLiteral
src/screens/HistoryScreen.tsx:468:18
         { text: "Cancel", style: "cancel" },
         {
           text: "Delete",
-          style: "destructive",
+          style: "",
           onPress: () =>
             Alert.alert("Final confirmation", "Deleting is permanent — there is no copy anywhere to restore from.", [
killedBy: HistoryScreen pins: delete flow both dialogs mark their destructive buttons exactly
statusReason: expected [ { text: 'Cancel', …(1) }, …(1) ] to deeply equal [ { text: 'Cancel', …(1) }, …(1) ]

[Killed] ArrowFunction
src/screens/HistoryScreen.tsx:469:20
         {
           text: "Delete",
           style: "destructive",
-          onPress: () =>
-            Alert.alert("Final confirmation", "Deleting is permanent — there is no copy anywhere to restore from.", [
-              { text: "Cancel", style: "cancel" },
-              { text: "Delete permanently", style: "destructive", onPress: () => void runDelete(entry) },
-            ]),
+          onPress: () => undefined,
         },
       ],
killedBy: HistoryScreen pins: delete flow while the delete is in flight the screen is busy
statusReason: no alert button "Delete permanently"; buttons: [{"text":"Cancel","style":"cancel"},{"text":"Delete","style":"destructive"}]

[Killed] StringLiteral
src/screens/HistoryScreen.tsx:471:40
           style: "destructive",
           onPress: () =>
             Alert.alert("Final confirmation", "Deleting is permanent — there is no copy anywhere to restore from.", [
-              { text: "Cancel", style: "cancel" },
+              { text: "Cancel", style: "" },
               { text: "Delete permanently", style: "destructive", onPress: () => void runDelete(entry) },
             ]),
killedBy: HistoryScreen pins: delete flow both dialogs mark their destructive buttons exactly
statusReason: expected [ { text: 'Cancel', style: '' }, …(1) ] to deeply equal [ { text: 'Cancel', …(1) }, …(1) ]

[Killed] ArrowFunction
src/screens/HistoryScreen.tsx:472:76
           onPress: () =>
             Alert.alert("Final confirmation", "Deleting is permanent — there is no copy anywhere to restore from.", [
               { text: "Cancel", style: "cancel" },
-              { text: "Delete permanently", style: "destructive", onPress: () => void runDelete(entry) },
+              { text: "Delete permanently", style: "destructive", onPress: () => undefined },
             ]),
         },
killedBy: HistoryScreen pins: delete flow while the delete is in flight the screen is busy
statusReason: expected { disabled: false } to deeply equal { disabled: true }

[Killed] StringLiteral
src/screens/HistoryScreen.tsx:472:52
           onPress: () =>
             Alert.alert("Final confirmation", "Deleting is permanent — there is no copy anywhere to restore from.", [
               { text: "Cancel", style: "cancel" },
-              { text: "Delete permanently", style: "destructive", onPress: () => void runDelete(entry) },
+              { text: "Delete permanently", style: "", onPress: () => void runDelete(entry) },
             ]),
         },
killedBy: HistoryScreen pins: delete flow both dialogs mark their destructive buttons exactly
statusReason: expected [ { text: 'Cancel', …(1) }, { …(3) } ] to deeply equal [ { text: 'Cancel', …(1) }, …(1) ]

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:479:46
     );
   };
 
-  const startEdit = (entry: HistoryEntry) => {
-    setDraft(entry.text);
-    setMode({ kind: "edit", entry });
-  };
+  const startEdit = (entry: HistoryEntry) => {};
 
   const saveEdit = async (entry: HistoryEntry) => {
killedBy: HistoryScreen edit (atomic replacement) atomically replaces the stable id — same date and chosen mood are preserved
statusReason: editor not open

[Killed] CallExpression
src/screens/HistoryScreen.tsx:480:5
   };
 
   const startEdit = (entry: HistoryEntry) => {
-    setDraft(entry.text);
+    ;
     setMode({ kind: "edit", entry });
   };
killedBy: HistoryScreen pins: edit semantics a draft that trims to the padded original is the unchanged no-op
statusReason: expected 'Thursday, September 3, 2026 Save chan…' to contain 'Edit this entry'

[Killed] ObjectLiteral
src/screens/HistoryScreen.tsx:481:13
 
   const startEdit = (entry: HistoryEntry) => {
     setDraft(entry.text);
-    setMode({ kind: "edit", entry });
+    setMode({});
   };
 
killedBy: HistoryScreen edit (atomic replacement) atomically replaces the stable id — same date and chosen mood are preserved
statusReason: editor not open

[Killed] MethodExpression
src/screens/HistoryScreen.tsx:485:21
   };
 
   const saveEdit = async (entry: HistoryEntry) => {
-    const trimmed = draft.trim();
+    const trimmed = draft;
     if (!trimmed || busyRef.current) return;
     if (trimmed.length > MAX_ENTRY_CHARS) {
killedBy: HistoryScreen edit (atomic replacement) a blank draft fired straight through the handler is a no-op
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "e-2026-09-03-bbb",

[Killed] BooleanLiteral
src/screens/HistoryScreen.tsx:486:9
 
   const saveEdit = async (entry: HistoryEntry) => {
     const trimmed = draft.trim();
-    if (!trimmed || busyRef.current) return;
+    if (trimmed || busyRef.current) return;
     if (trimmed.length > MAX_ENTRY_CHARS) {
       Alert.alert("Entry too long", `Entries are limited to ${MAX_ENTRY_CHARS.toLocaleString()} characters.`);
killedBy: HistoryScreen pins: edit semantics an entry of exactly 100 000 characters still saves (strict > cap)
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:486:9
 
   const saveEdit = async (entry: HistoryEntry) => {
     const trimmed = draft.trim();
-    if (!trimmed || busyRef.current) return;
+    if (false) return;
     if (trimmed.length > MAX_ENTRY_CHARS) {
       Alert.alert("Entry too long", `Entries are limited to ${MAX_ENTRY_CHARS.toLocaleString()} characters.`);
killedBy: HistoryScreen edit (atomic replacement) a double-tap on Save changes saves once (the busy guard)
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:487:43
   const saveEdit = async (entry: HistoryEntry) => {
     const trimmed = draft.trim();
     if (!trimmed || busyRef.current) return;
-    if (trimmed.length > MAX_ENTRY_CHARS) {
-      Alert.alert("Entry too long", `Entries are limited to ${MAX_ENTRY_CHARS.toLocaleString()} characters.`);
-      return;
-    }
+    if (trimmed.length > MAX_ENTRY_CHARS) {}
     // Nothing actually changed: back to the entry, no server round-trip.
     if (trimmed === entry.text.trim()) {
killedBy: HistoryScreen edit (atomic replacement) the editor enforces the same 100k cap as the Entry screen
statusReason: expected "vi.fn()" to be called with arguments: [ 'Entry too long', …(1) ]

Number of calls: 0

[Killed] EqualityOperator
src/screens/HistoryScreen.tsx:487:9
   const saveEdit = async (entry: HistoryEntry) => {
     const trimmed = draft.trim();
     if (!trimmed || busyRef.current) return;
-    if (trimmed.length > MAX_ENTRY_CHARS) {
+    if (trimmed.length <= MAX_ENTRY_CHARS) {
       Alert.alert("Entry too long", `Entries are limited to ${MAX_ENTRY_CHARS.toLocaleString()} characters.`);
       return;
killedBy: HistoryScreen edit (atomic replacement) atomically replaces the stable id — same date and chosen mood are preserved
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:492:9
       return;
     }
     // Nothing actually changed: back to the entry, no server round-trip.
-    if (trimmed === entry.text.trim()) {
+    if (true) {
       setMode({ kind: "detail", entry });
       return;
killedBy: HistoryScreen edit (atomic replacement) atomically replaces the stable id — same date and chosen mood are preserved
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:492:9
       return;
     }
     // Nothing actually changed: back to the entry, no server round-trip.
-    if (trimmed === entry.text.trim()) {
+    if (false) {
       setMode({ kind: "detail", entry });
       return;
killedBy: HistoryScreen edit (atomic replacement) saving an unchanged edit is a no-op straight back to the entry
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "e-2026-09-03-bbb",

[Killed] BooleanLiteral
src/screens/HistoryScreen.tsx:496:23
       setMode({ kind: "detail", entry });
       return;
     }
-    busyRef.current = true;
+    busyRef.current = false;
     setBusy(true);
     try {
killedBy: HistoryScreen edit (atomic replacement) a double-tap on Save changes saves once (the busy guard)
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:500:11
     setBusy(true);
     try {
       const userId = await api.getUserId();
-      if (!userId) {
+      if (false) {
         Alert.alert("Session damaged", "Account id missing — please sign in again. Your text is still on screen.");
         return;
killedBy: HistoryScreen pins: edit semantics the session-damaged alert carries its full message
statusReason: Alert.alert was never called

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:500:20
     setBusy(true);
     try {
       const userId = await api.getUserId();
-      if (!userId) {
-        Alert.alert("Session damaged", "Account id missing — please sign in again. Your text is still on screen.");
-        return;
-      }
+      if (!userId) {}
       // The same id is deliberately retained: it is part of the ciphertext
       // AAD, and the backend replaces this one record atomically.
killedBy: HistoryScreen edit (atomic replacement) editing requires a stored account id — the text stays on screen
statusReason: Alert.alert was never called

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:507:11
       // The same id is deliberately retained: it is part of the ciphertext
       // AAD, and the backend replaces this one record atomically.
       const { blobB64 } = encryptEntry(vault.get(), userId, entry.clientEntryId, trimmed, entry.entryDate, entry.sentiment);
-      try {
-        await api.updateEntry(entry.clientEntryId, blobB64, entry.entryDate);
-      } catch (err) {
+      try {} catch (err) {
         if (err instanceof ApiError && err.status === 0) {
           Alert.alert(
killedBy: HistoryScreen edit (atomic replacement) atomically replaces the stable id — same date and chosen mood are preserved
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:509:21
       const { blobB64 } = encryptEntry(vault.get(), userId, entry.clientEntryId, trimmed, entry.entryDate, entry.sentiment);
       try {
         await api.updateEntry(entry.clientEntryId, blobB64, entry.entryDate);
-      } catch (err) {
-        if (err instanceof ApiError && err.status === 0) {
-          Alert.alert(
-            "Needs a connection",
-            "Updating needs a connection. Your original entry and this text are both still safe; try again when connected.",
-          );
-        } else {
-          Alert.alert("Could not update", `${requestFailureCopy(err)} Your original entry is unchanged and this text is still on screen.`);
-        }
-        return;
-      }
+      } catch (err) {}
       // Keep the device-local mood log in step with the day's newest text.
       void recordMood(vault.get().dataKey, userId, entry.entryDate, entry.sentiment ?? localSentiment(trimmed)).catch(
killedBy: HistoryScreen pins: edit semantics a failed edit resets the busy state — the editor unlocks and a retry completes
statusReason: Alert.alert was never called

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:510:13
       try {
         await api.updateEntry(entry.clientEntryId, blobB64, entry.entryDate);
       } catch (err) {
-        if (err instanceof ApiError && err.status === 0) {
+        if (true) {
           Alert.alert(
             "Needs a connection",
killedBy: HistoryScreen edit (atomic replacement) a 404 from atomic replacement preserves the draft and original
statusReason: expected 'Needs a connection' to be 'Could not update' // Object.is equality

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:510:58
       try {
         await api.updateEntry(entry.clientEntryId, blobB64, entry.entryDate);
       } catch (err) {
-        if (err instanceof ApiError && err.status === 0) {
-          Alert.alert(
-            "Needs a connection",
-            "Updating needs a connection. Your original entry and this text are both still safe; try again when connected.",
-          );
-        } else {
+        if (err instanceof ApiError && err.status === 0) {} else {
           Alert.alert("Could not update", `${requestFailureCopy(err)} Your original entry is unchanged and this text is still on screen.`);
         }
killedBy: HistoryScreen edit (atomic replacement) an offline edit keeps both the original and the typed replacement
statusReason: Alert.alert was never called

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:515:16
             "Needs a connection",
             "Updating needs a connection. Your original entry and this text are both still safe; try again when connected.",
           );
-        } else {
-          Alert.alert("Could not update", `${requestFailureCopy(err)} Your original entry is unchanged and this text is still on screen.`);
-        }
+        } else {}
         return;
       }
killedBy: HistoryScreen edit (atomic replacement) a 404 from atomic replacement preserves the draft and original
statusReason: Alert.alert was never called

[Killed] LogicalOperator
src/screens/HistoryScreen.tsx:521:69
         return;
       }
       // Keep the device-local mood log in step with the day's newest text.
-      void recordMood(vault.get().dataKey, userId, entry.entryDate, entry.sentiment ?? localSentiment(trimmed)).catch(
+      void recordMood(vault.get().dataKey, userId, entry.entryDate, entry.sentiment && localSentiment(trimmed)).catch(
         () => {},
       );
killedBy: HistoryScreen edit (atomic replacement) atomically replaces the stable id — same date and chosen mood are preserved
statusReason: expected +0 to be -1 // Object.is equality

[Killed] ArrowFunction
src/screens/HistoryScreen.tsx:525:18
         () => {},
       );
       const updated: HistoryEntry = { ...entry, text: trimmed };
-      setEntries((prev) => prev.map((e) => (e.clientEntryId === entry.clientEntryId ? updated : e)));
+      setEntries(() => undefined);
       setMode({ kind: "detail", entry: updated });
       showStatus("Updated ✓", "ok");
killedBy: HistoryScreen edit (atomic replacement) editing one entry leaves the others exactly as they were
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/screens/HistoryScreen.tsx:525:37
         () => {},
       );
       const updated: HistoryEntry = { ...entry, text: trimmed };
-      setEntries((prev) => prev.map((e) => (e.clientEntryId === entry.clientEntryId ? updated : e)));
+      setEntries((prev) => prev.map(() => undefined));
       setMode({ kind: "detail", entry: updated });
       showStatus("Updated ✓", "ok");
killedBy: HistoryScreen edit (atomic replacement) editing one entry leaves the others exactly as they were
statusReason: Cannot read properties of undefined (reading 'entryDate')

[Killed] StringLiteral
src/screens/HistoryScreen.tsx:526:23
       );
       const updated: HistoryEntry = { ...entry, text: trimmed };
       setEntries((prev) => prev.map((e) => (e.clientEntryId === entry.clientEntryId ? updated : e)));
-      setMode({ kind: "detail", entry: updated });
+      setMode({ kind: "", entry: updated });
       showStatus("Updated ✓", "ok");
     } catch (err) {
killedBy: HistoryScreen edit (atomic replacement) editing one entry leaves the others exactly as they were
statusReason: no Text node containing "Back to history":

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:528:19
       setEntries((prev) => prev.map((e) => (e.clientEntryId === entry.clientEntryId ? updated : e)));
       setMode({ kind: "detail", entry: updated });
       showStatus("Updated ✓", "ok");
-    } catch (err) {
-      Alert.alert("Could not update", requestFailureCopy(err));
-    } finally {
+    } catch (err) {} finally {
       busyRef.current = false;
       setBusy(false);
killedBy: HistoryScreen edit (atomic replacement) a locked vault mid-edit reports honestly instead of crashing
statusReason: Alert.alert was never called

[Killed] StringLiteral
src/screens/HistoryScreen.tsx:529:19
       setMode({ kind: "detail", entry: updated });
       showStatus("Updated ✓", "ok");
     } catch (err) {
-      Alert.alert("Could not update", requestFailureCopy(err));
+      Alert.alert("", requestFailureCopy(err));
     } finally {
       busyRef.current = false;
killedBy: HistoryScreen edit (atomic replacement) a locked vault mid-edit reports honestly instead of crashing
statusReason: expected '' to be 'Could not update' // Object.is equality

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:530:15
       showStatus("Updated ✓", "ok");
     } catch (err) {
       Alert.alert("Could not update", requestFailureCopy(err));
-    } finally {
-      busyRef.current = false;
-      setBusy(false);
-    }
+    } finally {}
   };
 
killedBy: HistoryScreen pins: edit semantics a failed edit resets the busy state — the editor unlocks and a retry completes
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:536:68
     }
   };
 
-  const badge = (entry: HistoryEntry): React.JSX.Element | null => {
-    const value = badgeValue(entry);
-    if (value === undefined) return null;
-    const label = moodLabel(value);
-    return (
-      <View
-        style={[styles.badge, { backgroundColor: t.colors.cardDeep, borderRadius: t.radius.md }]}
-        accessibilityRole="text"
-        accessibilityLabel={`Mood: ${label}`}
-      >
-        <Text style={{ color: t.colors.accent, fontSize: t.type.meta.fontSize }}>{label}</Text>
-      </View>
-    );
-  };
+  const badge = (entry: HistoryEntry): React.JSX.Element | null => {};
 
   if (mode.kind === "edit") {
killedBy: HistoryScreen pins: badge chrome the mood badge carries its exact style array and accent meta text
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:538:9
 
   const badge = (entry: HistoryEntry): React.JSX.Element | null => {
     const value = badgeValue(entry);
-    if (value === undefined) return null;
+    if (false) return null;
     const label = moodLabel(value);
     return (
killedBy: HistoryScreen pins: mood-log fallback lifecycle a failing log read on reload DROPS the previous fallback badges
statusReason: expected [ 'Mood: Heavy' ] to have a length of +0 but got 1

[Killed] EqualityOperator
src/screens/HistoryScreen.tsx:538:9
 
   const badge = (entry: HistoryEntry): React.JSX.Element | null => {
     const value = badgeValue(entry);
-    if (value === undefined) return null;
+    if (value !== undefined) return null;
     const label = moodLabel(value);
     return (
killedBy: HistoryScreen pins: badge chrome the mood badge carries its exact style array and accent meta text
statusReason: expected [] to have a length of 1 but got +0

[Killed] ObjectLiteral
src/screens/HistoryScreen.tsx:542:31
     const label = moodLabel(value);
     return (
       <View
-        style={[styles.badge, { backgroundColor: t.colors.cardDeep, borderRadius: t.radius.md }]}
+        style={[styles.badge, {}]}
         accessibilityRole="text"
         accessibilityLabel={`Mood: ${label}`}
killedBy: HistoryScreen pins: badge chrome the mood badge carries its exact style array and accent meta text
statusReason: expected [ { paddingVertical: 4, …(1) }, {} ] to deeply equal [ { paddingVertical: 4, …(1) }, …(1) ]

[Killed] StringLiteral
src/screens/HistoryScreen.tsx:544:29
       <View
         style={[styles.badge, { backgroundColor: t.colors.cardDeep, borderRadius: t.radius.md }]}
         accessibilityRole="text"
-        accessibilityLabel={`Mood: ${label}`}
+        accessibilityLabel={``}
       >
         <Text style={{ color: t.colors.accent, fontSize: t.type.meta.fontSize }}>{label}</Text>
killedBy: HistoryScreen pins: badge chrome the mood badge carries its exact style array and accent meta text
statusReason: expected [] to have a length of 1 but got +0

[Killed] ObjectLiteral
src/screens/HistoryScreen.tsx:546:22
         accessibilityRole="text"
         accessibilityLabel={`Mood: ${label}`}
       >
-        <Text style={{ color: t.colors.accent, fontSize: t.type.meta.fontSize }}>{label}</Text>
+        <Text style={{}}>{label}</Text>
       </View>
     );
killedBy: HistoryScreen pins: badge chrome the mood badge carries its exact style array and accent meta text
statusReason: expected {} to deeply equal { color: '#7f9bff', fontSize: 12 }

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:551:7
     );
   };
 
-  if (mode.kind === "edit") {
+  if (true) {
     const { entry } = mode;
     return (
killedBy: HistoryScreen pins: snippetOf normalization and boundary collapses runs of whitespace to single spaces, trims the ends — exact node text
statusReason: Cannot read properties of undefined (reading 'entryDate')

[Killed] EqualityOperator
src/screens/HistoryScreen.tsx:551:7
     );
   };
 
-  if (mode.kind === "edit") {
+  if (mode.kind !== "edit") {
     const { entry } = mode;
     return (
killedBy: HistoryScreen pins: snippetOf normalization and boundary collapses runs of whitespace to single spaces, trims the ends — exact node text
statusReason: Cannot read properties of undefined (reading 'entryDate')

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:554:59
   if (mode.kind === "edit") {
     const { entry } = mode;
     return (
-      <KeyboardAvoidingView style={styles.flex} behavior={Platform.OS === "ios" ? "padding" : undefined}>
+      <KeyboardAvoidingView style={styles.flex} behavior={true ? "padding" : undefined}>
         <ScrollView
           style={[styles.flex, { backgroundColor: t.colors.bg }]}
killedBy: HistoryScreen edit (atomic replacement) the editor uses the padding keyboard behavior on iOS and none on Android
statusReason: expected 'padding' to be undefined

[Killed] EqualityOperator
src/screens/HistoryScreen.tsx:554:59
   if (mode.kind === "edit") {
     const { entry } = mode;
     return (
-      <KeyboardAvoidingView style={styles.flex} behavior={Platform.OS === "ios" ? "padding" : undefined}>
+      <KeyboardAvoidingView style={styles.flex} behavior={Platform.OS !== "ios" ? "padding" : undefined}>
         <ScrollView
           style={[styles.flex, { backgroundColor: t.colors.bg }]}
killedBy: HistoryScreen edit (atomic replacement) the editor uses the padding keyboard behavior on iOS and none on Android
statusReason: expected undefined to be 'padding' // Object.is equality

[Killed] ArrayDeclaration
src/screens/HistoryScreen.tsx:556:18
     return (
       <KeyboardAvoidingView style={styles.flex} behavior={Platform.OS === "ios" ? "padding" : undefined}>
         <ScrollView
-          style={[styles.flex, { backgroundColor: t.colors.bg }]}
+          style={[]}
           contentContainerStyle={{ padding: t.spacing.xl, gap: t.spacing.lg }}
           keyboardDismissMode="on-drag"
killedBy: HistoryScreen pins: editor chrome the edit screen carries its full style contract and privacy props
statusReason: expected [] to deeply equal [ { flex: 1 }, …(1) ]

[Killed] ArrayDeclaration
src/screens/HistoryScreen.tsx:565:20
             {formatEntryDate(entry.entryDate)}
           </Text>
           <TextInput
-            style={[
-              styles.input,
-              {
-                backgroundColor: t.colors.card,
-                color: t.colors.text,
-                borderRadius: t.radius.lg,
-                padding: t.spacing.lg,
-                fontSize: t.type.bodyLarge.fontSize,
-              },
-            ]}
+            style={[]}
             multiline
             value={draft}
killedBy: HistoryScreen pins: editor chrome the edit screen carries its full style contract and privacy props
statusReason: expected [] to deeply equal [ { minHeight: 140, …(1) }, { …(5) } ]

[Killed] BooleanLiteral
src/screens/HistoryScreen.tsx:577:23
             ]}
             multiline
             value={draft}
-            editable={!busy}
+            editable={busy}
             onChangeText={(next) => {
               touchActivity();
killedBy: HistoryScreen pins: editor chrome the edit screen carries its full style contract and privacy props
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:578:37
             multiline
             value={draft}
             editable={!busy}
-            onChangeText={(next) => {
-              touchActivity();
-              setDraft(next);
-            }}
+            onChangeText={(next) => {}}
             accessibilityLabel="Edit entry"
             // Privacy: keep journal text out of keyboard suggestion caches.
killedBy: HistoryScreen pins: editor chrome the edit screen carries its full style contract and privacy props
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] CallExpression
src/screens/HistoryScreen.tsx:579:15
             value={draft}
             editable={!busy}
             onChangeText={(next) => {
-              touchActivity();
+              ;
               setDraft(next);
             }}
killedBy: HistoryScreen pins: editor chrome the edit screen carries its full style contract and privacy props
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] CallExpression
src/screens/HistoryScreen.tsx:580:15
             editable={!busy}
             onChangeText={(next) => {
               touchActivity();
-              setDraft(next);
+              ;
             }}
             accessibilityLabel="Edit entry"
killedBy: HistoryScreen pins: editor chrome the character counter appears only strictly above 90 000, with its exact style
statusReason: expected 'Thursday, September 3, 2026 Save chan…' to contain '90,001 / 100,000'

[Killed] BooleanLiteral
src/screens/HistoryScreen.tsx:584:26
             }}
             accessibilityLabel="Edit entry"
             // Privacy: keep journal text out of keyboard suggestion caches.
-            autoCorrect={false}
+            autoCorrect={true}
             spellCheck={false}
             autoCapitalize="sentences"
killedBy: HistoryScreen pins: editor chrome the edit screen carries its full style contract and privacy props
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/screens/HistoryScreen.tsx:585:25
             accessibilityLabel="Edit entry"
             // Privacy: keep journal text out of keyboard suggestion caches.
             autoCorrect={false}
-            spellCheck={false}
+            spellCheck={true}
             autoCapitalize="sentences"
             textContentType="none"
killedBy: HistoryScreen pins: editor chrome the edit screen carries its full style contract and privacy props
statusReason: expected true to be false // Object.is equality
