[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:589:12
             autoCapitalize="sentences"
             textContentType="none"
           />
-          {draft.length > SHOW_COUNT_ABOVE && (
-            <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize, textAlign: "right" }}>
-              {draft.length.toLocaleString()} / {MAX_ENTRY_CHARS.toLocaleString()}
-            </Text>
-          )}
+          {false}
           <PrimaryButton
             label="Save changes"
killedBy: HistoryScreen pins: editor chrome the character counter appears only strictly above 90 000, with its exact style
statusReason: expected 'Thursday, September 3, 2026 Save chan…' to contain '90,001 / 100,000'

[Killed] EqualityOperator
src/screens/HistoryScreen.tsx:589:12
             autoCapitalize="sentences"
             textContentType="none"
           />
-          {draft.length > SHOW_COUNT_ABOVE && (
+          {draft.length >= SHOW_COUNT_ABOVE && (
             <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize, textAlign: "right" }}>
               {draft.length.toLocaleString()} / {MAX_ENTRY_CHARS.toLocaleString()}
killedBy: HistoryScreen pins: editor chrome the character counter appears only strictly above 90 000, with its exact style
statusReason: expected 'Thursday, September 3, 2026 90,000 / …' not to contain '/ 100,000'

[Killed] ArrowFunction
src/screens/HistoryScreen.tsx:596:22
           )}
           <PrimaryButton
             label="Save changes"
-            onPress={() => void saveEdit(entry)}
+            onPress={() => undefined}
             disabled={!draft.trim()}
             busy={busy}
killedBy: HistoryScreen pins: edit semantics an entry of exactly 100 000 characters still saves (strict > cap)
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
src/screens/HistoryScreen.tsx:597:23
           <PrimaryButton
             label="Save changes"
             onPress={() => void saveEdit(entry)}
-            disabled={!draft.trim()}
+            disabled={draft.trim()}
             busy={busy}
           />
killedBy: HistoryScreen edit (atomic replacement) the editor's Cancel returns untouched, and a blank draft cannot save
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/screens/HistoryScreen.tsx:597:24
           <PrimaryButton
             label="Save changes"
             onPress={() => void saveEdit(entry)}
-            disabled={!draft.trim()}
+            disabled={!draft}
             busy={busy}
           />
killedBy: HistoryScreen edit (atomic replacement) the editor's Cancel returns untouched, and a blank draft cannot save
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/screens/HistoryScreen.tsx:600:48
             disabled={!draft.trim()}
             busy={busy}
           />
-          <GhostButton label="Cancel" onPress={() => setMode({ kind: "detail", entry })} disabled={busy} />
+          <GhostButton label="Cancel" onPress={() => undefined} disabled={busy} />
           <CrisisHelpButton onPress={() => navigation.navigate("Crisis")} />
         </ScrollView>
killedBy: HistoryScreen pins: detail chrome and cancel the detail screen carries its style contract; editor Cancel returns to the DETAIL
statusReason: expected 'Thursday, September 3, 2026 Save chan…' to contain 'Edit this entry'

[Killed] StringLiteral
src/screens/HistoryScreen.tsx:600:70
             disabled={!draft.trim()}
             busy={busy}
           />
-          <GhostButton label="Cancel" onPress={() => setMode({ kind: "detail", entry })} disabled={busy} />
+          <GhostButton label="Cancel" onPress={() => setMode({ kind: "", entry })} disabled={busy} />
           <CrisisHelpButton onPress={() => navigation.navigate("Crisis")} />
         </ScrollView>
killedBy: HistoryScreen pins: detail chrome and cancel the detail screen carries its style contract; editor Cancel returns to the DETAIL
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' to contain 'Edit this entry'

[Killed] ArrowFunction
src/screens/HistoryScreen.tsx:601:38
             busy={busy}
           />
           <GhostButton label="Cancel" onPress={() => setMode({ kind: "detail", entry })} disabled={busy} />
-          <CrisisHelpButton onPress={() => navigation.navigate("Crisis")} />
+          <CrisisHelpButton onPress={() => undefined} />
         </ScrollView>
       </KeyboardAvoidingView>
killedBy: HistoryScreen focus reload and crisis access crisis help is one tap from the list, the detail, and the editor
statusReason: expected [ [ 'Crisis' ], [ 'Crisis' ] ] to deeply equal [ [ 'Crisis' ], [ 'Crisis' ], …(1) ]

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:607:7
     );
   }
 
-  if (mode.kind === "detail") {
+  if (false) {
     const { entry } = mode;
     return (
killedBy: HistoryScreen list long entries collapse to a one-line snippet with an ellipsis
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' to contain 'start xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx…'

[Killed] EqualityOperator
src/screens/HistoryScreen.tsx:607:7
     );
   }
 
-  if (mode.kind === "detail") {
+  if (mode.kind !== "detail") {
     const { entry } = mode;
     return (
killedBy: HistoryScreen list renders past entries decrypted on-device, newest day first
statusReason: Cannot read properties of undefined (reading 'entryDate')

[Killed] ObjectLiteral
src/screens/HistoryScreen.tsx:611:30
     const { entry } = mode;
     return (
       <ScrollView
-        style={[styles.flex, { backgroundColor: t.colors.bg }]}
+        style={[styles.flex, {}]}
         contentContainerStyle={{ padding: t.spacing.xl, gap: t.spacing.lg }}
         onTouchStart={touchActivity}
killedBy: HistoryScreen pins: detail chrome and cancel the detail screen carries its style contract; editor Cancel returns to the DETAIL
statusReason: expected [ { flex: 1 }, {} ] to deeply equal [ { flex: 1 }, …(1) ]

[Killed] ObjectLiteral
src/screens/HistoryScreen.tsx:612:32
     return (
       <ScrollView
         style={[styles.flex, { backgroundColor: t.colors.bg }]}
-        contentContainerStyle={{ padding: t.spacing.xl, gap: t.spacing.lg }}
+        contentContainerStyle={{}}
         onTouchStart={touchActivity}
       >
killedBy: HistoryScreen pins: detail chrome and cancel the detail screen carries its style contract; editor Cancel returns to the DETAIL
statusReason: expected {} to deeply equal { padding: 20, gap: 16 }

[Killed] ObjectLiteral
src/screens/HistoryScreen.tsx:616:24
         onTouchStart={touchActivity}
       >
         <View style={styles.detailHeader}>
-          <Text style={{ color: t.colors.muted, fontSize: t.type.bodySmall.fontSize }}>
+          <Text style={{}}>
             {formatEntryDate(entry.entryDate)}
           </Text>
killedBy: HistoryScreen pins: detail chrome and cancel the detail screen carries its style contract; editor Cancel returns to the DETAIL
statusReason: expected {} to deeply equal { color: '#8a91a3', fontSize: 13 }

[Killed] ArrowFunction
src/screens/HistoryScreen.tsx:622:57
           {badge(entry)}
         </View>
         <Text style={{ color: t.colors.text, fontSize: t.type.bodyLarge.fontSize, lineHeight: 24 }}>{entry.text}</Text>
-        <PrimaryButton label="Edit this entry" onPress={() => startEdit(entry)} disabled={busy} />
+        <PrimaryButton label="Edit this entry" onPress={() => undefined} disabled={busy} />
         <PrimaryButton label="Delete this entry" onPress={() => confirmDelete(entry)} busy={busy} danger />
         <GhostButton
killedBy: HistoryScreen pins: editor chrome the edit screen carries its full style contract and privacy props
statusReason: editor not open

[Killed] ArrowFunction
src/screens/HistoryScreen.tsx:623:59
         </View>
         <Text style={{ color: t.colors.text, fontSize: t.type.bodyLarge.fontSize, lineHeight: 24 }}>{entry.text}</Text>
         <PrimaryButton label="Edit this entry" onPress={() => startEdit(entry)} disabled={busy} />
-        <PrimaryButton label="Delete this entry" onPress={() => confirmDelete(entry)} busy={busy} danger />
+        <PrimaryButton label="Delete this entry" onPress={() => undefined} busy={busy} danger />
         <GhostButton
           // Stryker disable next-line ObjectLiteral, StringLiteral: nothing compares mode.kind to "list" — the mutated state falls through to the identical list return
killedBy: HistoryScreen pins: delete flow while the delete is in flight the screen is busy
statusReason: Alert.alert was never called

[Killed] ArrowFunction
src/screens/HistoryScreen.tsx:626:20
         <PrimaryButton label="Delete this entry" onPress={() => confirmDelete(entry)} busy={busy} danger />
         <GhostButton
           // Stryker disable next-line ObjectLiteral, StringLiteral: nothing compares mode.kind to "list" — the mutated state falls through to the identical list return
-          onPress={() => setMode({ kind: "list" })}
+          onPress={() => undefined}
           label="Back to history"
           disabled={busy}
killedBy: HistoryScreen mood badges the entry's own check-in pick wins; the device-local log is the fallback
statusReason: no Text node containing "explicit heavy":
Tuesday, September 1, 2026 | no signal | Edit this entry | Delete this entry | Back to history | Need help now? Crisis resources

[Killed] ArrowFunction
src/screens/HistoryScreen.tsx:631:36
           disabled={busy}
         />
         <InlineStatus message={status} tone={statusTone} />
-        <CrisisHelpButton onPress={() => navigation.navigate("Crisis")} />
+        <CrisisHelpButton onPress={() => undefined} />
       </ScrollView>
     );
killedBy: HistoryScreen focus reload and crisis access crisis help is one tap from the list, the detail, and the editor
statusReason: expected [ [ 'Crisis' ], [ 'Crisis' ] ] to deeply equal [ [ 'Crisis' ], [ 'Crisis' ], …(1) ]

[Killed] StringLiteral
src/screens/HistoryScreen.tsx:631:62
           disabled={busy}
         />
         <InlineStatus message={status} tone={statusTone} />
-        <CrisisHelpButton onPress={() => navigation.navigate("Crisis")} />
+        <CrisisHelpButton onPress={() => navigation.navigate("")} />
       </ScrollView>
     );
killedBy: HistoryScreen focus reload and crisis access crisis help is one tap from the list, the detail, and the editor
statusReason: expected [ [ 'Crisis' ], [ '' ], [ 'Crisis' ] ] to deeply equal [ [ 'Crisis' ], [ 'Crisis' ], …(1) ]

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:640:5
   // decrypted list, in display order. It is intentionally bounded by the
   // pages the person chose to load; plaintext history is not bulk-loaded.
   const visibleEntries = filterEntries(
-    dayFilter !== null ? entries.filter((e) => e.entryDate === dayFilter) : entries,
+    true ? entries.filter((e) => e.entryDate === dayFilter) : entries,
     query,
   );
killedBy: HistoryScreen pins: snippetOf normalization and boundary collapses runs of whitespace to single spaces, trims the ends — exact node text
statusReason: expected [ '‹', 'September 2026', '›', …(39) ] to include 'padded entry'

[Killed] EqualityOperator
src/screens/HistoryScreen.tsx:640:5
   // decrypted list, in display order. It is intentionally bounded by the
   // pages the person chose to load; plaintext history is not bulk-loaded.
   const visibleEntries = filterEntries(
-    dayFilter !== null ? entries.filter((e) => e.entryDate === dayFilter) : entries,
+    dayFilter === null ? entries.filter((e) => e.entryDate === dayFilter) : entries,
     query,
   );
killedBy: HistoryScreen list renders past entries decrypted on-device, newest day first
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' to contain 'third day'

[Survived] ConditionalExpression
src/screens/HistoryScreen.tsx:643:79
     dayFilter !== null ? entries.filter((e) => e.entryDate === dayFilter) : entries,
     query,
   );
-  const journaledDays = new Set(entries.map((e) => e.entryDate).filter((d) => d !== ""));
+  const journaledDays = new Set(entries.map((e) => e.entryDate).filter((d) => false));
   return (
     <ScrollView

[Survived] MethodExpression
src/screens/HistoryScreen.tsx:643:33
     dayFilter !== null ? entries.filter((e) => e.entryDate === dayFilter) : entries,
     query,
   );
-  const journaledDays = new Set(entries.map((e) => e.entryDate).filter((d) => d !== ""));
+  const journaledDays = new Set(entries.map(e => e.entryDate));
   return (
     <ScrollView

[Killed] ArrowFunction
src/screens/HistoryScreen.tsx:652:22
       refreshControl={
         <RefreshControl
           refreshing={loading}
-          onRefresh={() => void load()}
+          onRefresh={() => undefined}
           tintColor={t.colors.primaryBright}
           colors={[t.colors.primaryBright]}
killedBy: HistoryScreen list pull-to-refresh reloads the list
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] LogicalOperator
src/screens/HistoryScreen.tsx:658:8
         />
       }
     >
-      {loading && entries.length === 0 && !offline && !error && (
+      {loading || entries.length === 0 && !offline && !error && (
         <ActivityIndicator color={t.colors.primaryBright} size="large" />
       )}
killedBy: HistoryScreen pins: pagination reloading with entries on screen shows no spinner — only a first load may
statusReason: expected [ ReactTestInstance{ …(1) } ] to have a length of +0 but got 1

[Killed] BooleanLiteral
src/screens/HistoryScreen.tsx:658:43
         />
       }
     >
-      {loading && entries.length === 0 && !offline && !error && (
+      {loading && entries.length === 0 && offline && !error && (
         <ActivityIndicator color={t.colors.primaryBright} size="large" />
       )}
killedBy: HistoryScreen list shows a spinner while the first load is in flight
statusReason: expected 0 to be greater than 0

[Killed] LogicalOperator
src/screens/HistoryScreen.tsx:661:8
       {loading && entries.length === 0 && !offline && !error && (
         <ActivityIndicator color={t.colors.primaryBright} size="large" />
       )}
-      {error && (
-        <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}>
-          <Text style={{ color: t.colors.error, fontSize: t.type.bodySmall.fontSize }} accessibilityRole="alert">
-            {error}
-          </Text>
-          <GhostButton label="Try again" onPress={() => void load()} accessibilityLabel="Try loading your history again" />
-        </View>
-      )}
+      {error || <View style={[styles.card, {
+  backgroundColor: t.colors.card,
+  borderRadius: t.radius.lg
+}]}>
+          <Text style={{
+    color: t.colors.error,
+    fontSize: t.type.bodySmall.fontSize
+  }} accessibilityRole="alert">
+            {error}
+          </Text>
+          <GhostButton label="Try again" onPress={() => void load()} accessibilityLabel="Try loading your history again" />
+        </View>}
       {!loading && offline && (
         <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}>
killedBy: HistoryScreen list a server failure shows calm copy with an alert role and a retry
statusReason: expected 'Need help now? Crisis resources' to contain 'The server hit a problem — try again …'

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:661:8
       {loading && entries.length === 0 && !offline && !error && (
         <ActivityIndicator color={t.colors.primaryBright} size="large" />
       )}
-      {error && (
-        <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}>
-          <Text style={{ color: t.colors.error, fontSize: t.type.bodySmall.fontSize }} accessibilityRole="alert">
-            {error}
-          </Text>
-          <GhostButton label="Try again" onPress={() => void load()} accessibilityLabel="Try loading your history again" />
-        </View>
-      )}
+      {true}
       {!loading && offline && (
         <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}>
killedBy: HistoryScreen list a server failure shows calm copy with an alert role and a retry
statusReason: expected 'Need help now? Crisis resources' to contain 'The server hit a problem — try again …'

[Killed] ArrowFunction
src/screens/HistoryScreen.tsx:666:51
           <Text style={{ color: t.colors.error, fontSize: t.type.bodySmall.fontSize }} accessibilityRole="alert">
             {error}
           </Text>
-          <GhostButton label="Try again" onPress={() => void load()} accessibilityLabel="Try loading your history again" />
+          <GhostButton label="Try again" onPress={() => undefined} accessibilityLabel="Try loading your history again" />
         </View>
       )}
killedBy: HistoryScreen list a server failure shows calm copy with an alert role and a retry
statusReason: expected 'The server hit a problem — try again …' to contain 'third day'

[Killed] LogicalOperator
src/screens/HistoryScreen.tsx:669:8
           <GhostButton label="Try again" onPress={() => void load()} accessibilityLabel="Try loading your history again" />
         </View>
       )}
-      {!loading && offline && (
-        <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}>
-          <Text style={{ color: t.colors.body, fontSize: t.type.body.fontSize, lineHeight: 22 }}>
-            Your journal history loads when you're online; today's writing always works offline.
-          </Text>
-          <GhostButton label="Try again" onPress={() => void load()} accessibilityLabel="Try loading your history again" />
-        </View>
-      )}
+      {!loading && offline || <View style={[styles.card, {
+  backgroundColor: t.colors.card,
+  borderRadius: t.radius.lg
+}]}>
+          <Text style={{
+    color: t.colors.body,
+    fontSize: t.type.body.fontSize,
+    lineHeight: 22
+  }}>
+            Your journal history loads when you're online; today's writing always works offline.
+          </Text>
+          <GhostButton label="Try again" onPress={() => void load()} accessibilityLabel="Try loading your history again" />
+        </View>}
       {!loading && !offline && !error && entries.length === 0 && (
         <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}>
killedBy: HistoryScreen list offline is honest: history needs a connection, today's writing does not
statusReason: expected 'Need help now? Crisis resources' to contain 'Your journal history loads when you\'…'

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:669:8
           <GhostButton label="Try again" onPress={() => void load()} accessibilityLabel="Try loading your history again" />
         </View>
       )}
-      {!loading && offline && (
-        <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}>
-          <Text style={{ color: t.colors.body, fontSize: t.type.body.fontSize, lineHeight: 22 }}>
-            Your journal history loads when you're online; today's writing always works offline.
-          </Text>
-          <GhostButton label="Try again" onPress={() => void load()} accessibilityLabel="Try loading your history again" />
-        </View>
-      )}
+      {true}
       {!loading && !offline && !error && entries.length === 0 && (
         <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}>
killedBy: HistoryScreen list offline is honest: history needs a connection, today's writing does not
statusReason: expected 'Need help now? Crisis resources' to contain 'Your journal history loads when you\'…'

[Killed] ObjectLiteral
src/screens/HistoryScreen.tsx:671:24
       )}
       {!loading && offline && (
         <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}>
-          <Text style={{ color: t.colors.body, fontSize: t.type.body.fontSize, lineHeight: 22 }}>
+          <Text style={{}}>
             Your journal history loads when you're online; today's writing always works offline.
           </Text>
killedBy: HistoryScreen pins: state cards and presence guards the offline card renders its exact styles
statusReason: expected {} to deeply equal { Object (color, fontSize, ...) }

[Killed] BooleanLiteral
src/screens/HistoryScreen.tsx:677:8
           <GhostButton label="Try again" onPress={() => void load()} accessibilityLabel="Try loading your history again" />
         </View>
       )}
-      {!loading && !offline && !error && entries.length === 0 && (
+      {loading && !offline && !error && entries.length === 0 && (
         <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}>
           <Text style={{ color: t.colors.body, fontSize: t.type.body.fontSize, lineHeight: 22 }}>
killedBy: HistoryScreen pins: state cards and presence guards the empty journal card renders its exact styles
statusReason: expected undefined to be defined

[Killed] LogicalOperator
src/screens/HistoryScreen.tsx:677:8
           <GhostButton label="Try again" onPress={() => void load()} accessibilityLabel="Try loading your history again" />
         </View>
       )}
-      {!loading && !offline && !error && entries.length === 0 && (
+      {!loading && !offline && !error || entries.length === 0 && (
         <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}>
           <Text style={{ color: t.colors.body, fontSize: t.type.body.fontSize, lineHeight: 22 }}>
killedBy: HistoryScreen pins: state cards and presence guards a server error renders its exact card, and neither empty nor offline copy
statusReason: expected 'The server hit a problem — try again …' not to contain 'No entries yet.'

[Survived] LogicalOperator
src/screens/HistoryScreen.tsx:684:8
           </Text>
         </View>
       )}
-      {!loading && !offline && !error && entries.length > 0 && (
+      {!loading && !offline && !error || entries.length > 0 && (
         <>
           {/* Search: filters the decrypted on-device list; never sent anywhere. */}

[Survived] LogicalOperator
src/screens/HistoryScreen.tsx:684:8
           </Text>
         </View>
       )}
-      {!loading && !offline && !error && entries.length > 0 && (
+      {!loading && !offline || !error && entries.length > 0 && (
         <>
           {/* Search: filters the decrypted on-device list; never sent anywhere. */}

[NoCoverage] BlockStatement
src/screens/HistoryScreen.tsx:698:37
             placeholder="Search your entries"
             placeholderTextColor={t.colors.placeholder}
             value={query}
-            onChangeText={(next) => {
-              touchActivity();
-              setQuery(next);
-              setShown(PAGE_SIZE);
-            }}
+            onChangeText={(next) => {}}
             accessibilityLabel="Search your entries"
             autoCorrect={false}

[NoCoverage] CallExpression
src/screens/HistoryScreen.tsx:700:15
             value={query}
             onChangeText={(next) => {
               touchActivity();
-              setQuery(next);
+              ;
               setShown(PAGE_SIZE);
             }}

[NoCoverage] CallExpression
src/screens/HistoryScreen.tsx:701:15
             onChangeText={(next) => {
               touchActivity();
               setQuery(next);
-              setShown(PAGE_SIZE);
+              ;
             }}
             accessibilityLabel="Search your entries"

[Survived] BooleanLiteral
src/screens/HistoryScreen.tsx:704:26
               setShown(PAGE_SIZE);
             }}
             accessibilityLabel="Search your entries"
-            autoCorrect={false}
+            autoCorrect={true}
             spellCheck={false}
             autoCapitalize="none"

[NoCoverage] BlockStatement
src/screens/HistoryScreen.tsx:713:35
             dayMoods={logMoods}
             journaledDays={journaledDays}
             selectedDay={dayFilter}
-            onSelectDay={(iso) => {
-              touchActivity();
-              setDayFilter(iso);
-              setShown(PAGE_SIZE);
-            }}
+            onSelectDay={(iso) => {}}
           />
           {(query.trim() !== "" || dayFilter !== null) && (

[NoCoverage] CallExpression
src/screens/HistoryScreen.tsx:714:15
             journaledDays={journaledDays}
             selectedDay={dayFilter}
             onSelectDay={(iso) => {
-              touchActivity();
+              ;
               setDayFilter(iso);
               setShown(PAGE_SIZE);

[NoCoverage] CallExpression
src/screens/HistoryScreen.tsx:715:15
             selectedDay={dayFilter}
             onSelectDay={(iso) => {
               touchActivity();
-              setDayFilter(iso);
+              ;
               setShown(PAGE_SIZE);
             }}

[NoCoverage] CallExpression
src/screens/HistoryScreen.tsx:716:15
             onSelectDay={(iso) => {
               touchActivity();
               setDayFilter(iso);
-              setShown(PAGE_SIZE);
+              ;
             }}
           />

[Survived] LogicalOperator
src/screens/HistoryScreen.tsx:719:12
               setShown(PAGE_SIZE);
             }}
           />
-          {(query.trim() !== "" || dayFilter !== null) && (
-            <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize }}>
-              {visibleEntries.length} {visibleEntries.length === 1 ? "entry" : "entries"} match
-              {dayFilter !== null ? ` · ${dayFilter}` : ""}
-              {query.trim() !== "" ? " · search" : ""}
-              {hasMore ? " · loaded history only" : ""}
-            </Text>
-          )}
+          {query.trim() !== "" || dayFilter !== null || <Text style={{
+  color: t.colors.muted,
+  fontSize: t.type.meta.fontSize
+}}>
+              {visibleEntries.length} {visibleEntries.length === 1 ? "entry" : "entries"} match
+              {dayFilter !== null ? ` · ${dayFilter}` : ""}
+              {query.trim() !== "" ? " · search" : ""}
+              {hasMore ? " · loaded history only" : ""}
+            </Text>}
         </>
       )}

[Survived] LogicalOperator
src/screens/HistoryScreen.tsx:719:13
               setShown(PAGE_SIZE);
             }}
           />
-          {(query.trim() !== "" || dayFilter !== null) && (
+          {(query.trim() !== "" && dayFilter !== null) && (
             <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize }}>
               {visibleEntries.length} {visibleEntries.length === 1 ? "entry" : "entries"} match

[NoCoverage] ConditionalExpression
src/screens/HistoryScreen.tsx:721:40
           />
           {(query.trim() !== "" || dayFilter !== null) && (
             <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize }}>
-              {visibleEntries.length} {visibleEntries.length === 1 ? "entry" : "entries"} match
+              {visibleEntries.length} {true ? "entry" : "entries"} match
               {dayFilter !== null ? ` · ${dayFilter}` : ""}
               {query.trim() !== "" ? " · search" : ""}

[NoCoverage] ConditionalExpression
src/screens/HistoryScreen.tsx:721:40
           />
           {(query.trim() !== "" || dayFilter !== null) && (
             <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize }}>
-              {visibleEntries.length} {visibleEntries.length === 1 ? "entry" : "entries"} match
+              {visibleEntries.length} {false ? "entry" : "entries"} match
               {dayFilter !== null ? ` · ${dayFilter}` : ""}
               {query.trim() !== "" ? " · search" : ""}

[NoCoverage] ConditionalExpression
src/screens/HistoryScreen.tsx:722:16
           {(query.trim() !== "" || dayFilter !== null) && (
             <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize }}>
               {visibleEntries.length} {visibleEntries.length === 1 ? "entry" : "entries"} match
-              {dayFilter !== null ? ` · ${dayFilter}` : ""}
+              {true ? ` · ${dayFilter}` : ""}
               {query.trim() !== "" ? " · search" : ""}
               {hasMore ? " · loaded history only" : ""}

[NoCoverage] EqualityOperator
src/screens/HistoryScreen.tsx:722:16
           {(query.trim() !== "" || dayFilter !== null) && (
             <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize }}>
               {visibleEntries.length} {visibleEntries.length === 1 ? "entry" : "entries"} match
-              {dayFilter !== null ? ` · ${dayFilter}` : ""}
+              {dayFilter === null ? ` · ${dayFilter}` : ""}
               {query.trim() !== "" ? " · search" : ""}
               {hasMore ? " · loaded history only" : ""}

[NoCoverage] ConditionalExpression
src/screens/HistoryScreen.tsx:723:16
             <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize }}>
               {visibleEntries.length} {visibleEntries.length === 1 ? "entry" : "entries"} match
               {dayFilter !== null ? ` · ${dayFilter}` : ""}
-              {query.trim() !== "" ? " · search" : ""}
+              {true ? " · search" : ""}
               {hasMore ? " · loaded history only" : ""}
             </Text>

[NoCoverage] MethodExpression
src/screens/HistoryScreen.tsx:723:16
             <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize }}>
               {visibleEntries.length} {visibleEntries.length === 1 ? "entry" : "entries"} match
               {dayFilter !== null ? ` · ${dayFilter}` : ""}
-              {query.trim() !== "" ? " · search" : ""}
+              {query !== "" ? " · search" : ""}
               {hasMore ? " · loaded history only" : ""}
             </Text>
