[Killed] ArrowFunction
src/screens/HistoryScreen.tsx:729:43
           )}
         </>
       )}
-      {visibleEntries.slice(0, shown).map((entry) => (
-        <TouchableOpacity
-          key={entry.clientEntryId}
-          style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg, minHeight: t.minTouch }]}
-          onPress={() => setMode({ kind: "detail", entry })}
-          accessibilityRole="button"
-          accessibilityLabel={`Entry from ${formatEntryDate(entry.entryDate)}`}
-        >
-          <View style={styles.rowHeader}>
-            <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize }}>{entry.entryDate}</Text>
-            {badge(entry)}
-          </View>
-          <Text style={{ color: t.colors.body, fontSize: t.type.body.fontSize, lineHeight: 21 }}>
-            {snippetOf(entry.text)}
-          </Text>
-        </TouchableOpacity>
-      ))}
+      {visibleEntries.slice(0, shown).map(() => undefined)}
       {visibleEntries.length > shown && (
         <GhostButton
killedBy: HistoryScreen list renders past entries decrypted on-device, newest day first
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' to contain 'third day'

[Killed] MethodExpression
src/screens/HistoryScreen.tsx:729:8
           )}
         </>
       )}
-      {visibleEntries.slice(0, shown).map((entry) => (
+      {visibleEntries.map((entry) => (
         <TouchableOpacity
           key={entry.clientEntryId}
killedBy: HistoryScreen list history reveals in pages of 50 with a calm 'show older' button
statusReason: expected [ ReactTestInstance{ …(1) }, …(119) ] to have a length of 50 but got 120

[Killed] ArrowFunction
src/screens/HistoryScreen.tsx:733:20
         <TouchableOpacity
           key={entry.clientEntryId}
           style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg, minHeight: t.minTouch }]}
-          onPress={() => setMode({ kind: "detail", entry })}
+          onPress={() => undefined}
           accessibilityRole="button"
           accessibilityLabel={`Entry from ${formatEntryDate(entry.entryDate)}`}
killedBy: HistoryScreen list long entries collapse to a one-line snippet with an ellipsis
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' to contain 'start xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx…'

[Killed] ObjectLiteral
src/screens/HistoryScreen.tsx:733:34
         <TouchableOpacity
           key={entry.clientEntryId}
           style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg, minHeight: t.minTouch }]}
-          onPress={() => setMode({ kind: "detail", entry })}
+          onPress={() => setMode({})}
           accessibilityRole="button"
           accessibilityLabel={`Entry from ${formatEntryDate(entry.entryDate)}`}
killedBy: HistoryScreen list long entries collapse to a one-line snippet with an ellipsis
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' to contain 'start xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx…'

[Killed] EqualityOperator
src/screens/HistoryScreen.tsx:746:8
           </Text>
         </TouchableOpacity>
       ))}
-      {visibleEntries.length > shown && (
+      {visibleEntries.length >= shown && (
         <GhostButton
           label={`Show older entries (${visibleEntries.length - shown} more)`}
killedBy: HistoryScreen pins: pagination exactly PAGE_SIZE entries: no 'show older' button (strict >)
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' not to contain 'Show older entries'

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:746:8
           </Text>
         </TouchableOpacity>
       ))}
-      {visibleEntries.length > shown && (
-        <GhostButton
-          label={`Show older entries (${visibleEntries.length - shown} more)`}
-          onPress={() => {
-            touchActivity();
-            setShown(shown + PAGE_SIZE);
-          }}
-        />
-      )}
+      {false}
       {visibleEntries.length <= shown && hasMore && !historyLimitReached && query.trim() === "" && dayFilter === null && (
         <GhostButton
killedBy: HistoryScreen pins: pagination a reload resets the page back to 50
statusReason: no Text node containing "Show older entries (70 more)":

[Killed] ArithmeticOperator
src/screens/HistoryScreen.tsx:748:41
       ))}
       {visibleEntries.length > shown && (
         <GhostButton
-          label={`Show older entries (${visibleEntries.length - shown} more)`}
+          label={`Show older entries (${visibleEntries.length + shown} more)`}
           onPress={() => {
             touchActivity();
killedBy: HistoryScreen pins: pagination a reload resets the page back to 50
statusReason: no Text node containing "Show older entries (70 more)":

[Killed] BlockStatement
src/screens/HistoryScreen.tsx:749:26
       {visibleEntries.length > shown && (
         <GhostButton
           label={`Show older entries (${visibleEntries.length - shown} more)`}
-          onPress={() => {
-            touchActivity();
-            setShown(shown + PAGE_SIZE);
-          }}
+          onPress={() => {}}
         />
       )}
killedBy: HistoryScreen list history reveals in pages of 50 with a calm 'show older' button
statusReason: expected [ ReactTestInstance{ …(1) }, …(49) ] to have a length of 100 but got 50

[Killed] CallExpression
src/screens/HistoryScreen.tsx:750:13
         <GhostButton
           label={`Show older entries (${visibleEntries.length - shown} more)`}
           onPress={() => {
-            touchActivity();
+            ;
             setShown(shown + PAGE_SIZE);
           }}
killedBy: HistoryScreen list history reveals in pages of 50 with a calm 'show older' button
statusReason: expected "vi.fn()" to be called at least once

[Killed] ArithmeticOperator
src/screens/HistoryScreen.tsx:751:22
           label={`Show older entries (${visibleEntries.length - shown} more)`}
           onPress={() => {
             touchActivity();
-            setShown(shown + PAGE_SIZE);
+            setShown(shown - PAGE_SIZE);
           }}
         />
killedBy: HistoryScreen pins: pagination a reload resets the page back to 50
statusReason: expected [] to have a length of 100 but got +0

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:755:8
           }}
         />
       )}
-      {visibleEntries.length <= shown && hasMore && !historyLimitReached && query.trim() === "" && dayFilter === null && (
+      {true && (
         <GhostButton
           label={loadingMore ? "Loading older entries…" : "Load older entries"}
killedBy: HistoryScreen list uses the server's byte-page continuation to load older history
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' not to contain 'Load older entries'

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:755:8
           }}
         />
       )}
-      {visibleEntries.length <= shown && hasMore && !historyLimitReached && query.trim() === "" && dayFilter === null && (
-        <GhostButton
-          label={loadingMore ? "Loading older entries…" : "Load older entries"}
-          onPress={() => void loadOlder()}
-          disabled={loadingMore}
-          accessibilityLabel="Load older encrypted journal entries"
-        />
-      )}
+      {true}
       {historyLimitReached && hasMore && (
         <Text accessibilityRole="alert" style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize, textAlign: "center" }}>
killedBy: HistoryScreen list uses the server's byte-page continuation to load older history
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' to contain 'Load older entries'

[Killed] ArrowFunction
src/screens/HistoryScreen.tsx:758:20
       {visibleEntries.length <= shown && hasMore && !historyLimitReached && query.trim() === "" && dayFilter === null && (
         <GhostButton
           label={loadingMore ? "Loading older entries…" : "Load older entries"}
-          onPress={() => void loadOlder()}
+          onPress={() => undefined}
           disabled={loadingMore}
           accessibilityLabel="Load older encrypted journal entries"
killedBy: HistoryScreen list uses the server's byte-page continuation to load older history
statusReason: expected last "vi.fn()" call to have been called with [ { limit: 100, offset: 1, …(1) } ]

[Killed] LogicalOperator
src/screens/HistoryScreen.tsx:763:8
           accessibilityLabel="Load older encrypted journal entries"
         />
       )}
-      {historyLimitReached && hasMore && (
-        <Text accessibilityRole="alert" style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize, textAlign: "center" }}>
-          This history view has reached its safe download limit ({MAX_HISTORY_ROWS} entries or {MAX_HISTORY_SERVER_PAGES} pages).
-          More encrypted history remains on the server.
-        </Text>
-      )}
+      {historyLimitReached && hasMore || <Text accessibilityRole="alert" style={{
+  color: t.colors.muted,
+  fontSize: t.type.meta.fontSize,
+  textAlign: "center"
+}}>
+          This history view has reached its safe download limit ({MAX_HISTORY_ROWS} entries or {MAX_HISTORY_SERVER_PAGES} pages).
+          More encrypted history remains on the server.
+        </Text>}
       {!loading && !offline && !error && entries.length > 0 && visibleEntries.length === 0 && (
         <Text style={{ color: t.colors.muted, fontSize: t.type.bodySmall.fontSize, textAlign: "center" }}>
killedBy: HistoryScreen list a server failure shows calm copy with an alert role and a retry
statusReason: expected [ ReactTestInstance{ …(1) }, …(1) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:763:8
           accessibilityLabel="Load older encrypted journal entries"
         />
       )}
-      {historyLimitReached && hasMore && (
+      {true && (
         <Text accessibilityRole="alert" style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize, textAlign: "center" }}>
           This history view has reached its safe download limit ({MAX_HISTORY_ROWS} entries or {MAX_HISTORY_SERVER_PAGES} pages).
killedBy: HistoryScreen list a server failure shows calm copy with an alert role and a retry
statusReason: expected [ ReactTestInstance{ …(1) }, …(1) ] to have a length of 1 but got 2

[Survived] ConditionalExpression
src/screens/HistoryScreen.tsx:769:8
           More encrypted history remains on the server.
         </Text>
       )}
-      {!loading && !offline && !error && entries.length > 0 && visibleEntries.length === 0 && (
-        <Text style={{ color: t.colors.muted, fontSize: t.type.bodySmall.fontSize, textAlign: "center" }}>
-          Nothing matches {query.trim() !== "" ? "that search" : "that day"}.
-        </Text>
-      )}
+      {false}
       {unreadable > 0 && (
         <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize, textAlign: "center" }}>

[Survived] BooleanLiteral
src/screens/HistoryScreen.tsx:769:32
           More encrypted history remains on the server.
         </Text>
       )}
-      {!loading && !offline && !error && entries.length > 0 && visibleEntries.length === 0 && (
+      {!loading && !offline && error && entries.length > 0 && visibleEntries.length === 0 && (
         <Text style={{ color: t.colors.muted, fontSize: t.type.bodySmall.fontSize, textAlign: "center" }}>
           Nothing matches {query.trim() !== "" ? "that search" : "that day"}.

[NoCoverage] ConditionalExpression
src/screens/HistoryScreen.tsx:771:28
       )}
       {!loading && !offline && !error && entries.length > 0 && visibleEntries.length === 0 && (
         <Text style={{ color: t.colors.muted, fontSize: t.type.bodySmall.fontSize, textAlign: "center" }}>
-          Nothing matches {query.trim() !== "" ? "that search" : "that day"}.
+          Nothing matches {true ? "that search" : "that day"}.
         </Text>
       )}

[NoCoverage] EqualityOperator
src/screens/HistoryScreen.tsx:771:28
       )}
       {!loading && !offline && !error && entries.length > 0 && visibleEntries.length === 0 && (
         <Text style={{ color: t.colors.muted, fontSize: t.type.bodySmall.fontSize, textAlign: "center" }}>
-          Nothing matches {query.trim() !== "" ? "that search" : "that day"}.
+          Nothing matches {query.trim() === "" ? "that search" : "that day"}.
         </Text>
       )}

[Killed] LogicalOperator
src/screens/HistoryScreen.tsx:774:8
           Nothing matches {query.trim() !== "" ? "that search" : "that day"}.
         </Text>
       )}
-      {unreadable > 0 && (
-        <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize, textAlign: "center" }}>
-          {unreadable} {unreadable === 1 ? "entry" : "entries"} couldn't be read on this device.
-        </Text>
-      )}
+      {unreadable > 0 || <Text style={{
+  color: t.colors.muted,
+  fontSize: t.type.meta.fontSize,
+  textAlign: "center"
+}}>
+          {unreadable} {unreadable === 1 ? "entry" : "entries"} couldn't be read on this device.
+        </Text>}
       <InlineStatus message={status} tone={statusTone} />
       <CrisisHelpButton onPress={() => navigation.navigate("Crisis")} />
killedBy: HistoryScreen list a tampered blob is skipped and honestly counted (singular and plural)
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' to contain '2 entries couldn\'t be read on this d…'

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:774:8
           Nothing matches {query.trim() !== "" ? "that search" : "that day"}.
         </Text>
       )}
-      {unreadable > 0 && (
-        <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize, textAlign: "center" }}>
-          {unreadable} {unreadable === 1 ? "entry" : "entries"} couldn't be read on this device.
-        </Text>
-      )}
+      {false}
       <InlineStatus message={status} tone={statusTone} />
       <CrisisHelpButton onPress={() => navigation.navigate("Crisis")} />
killedBy: HistoryScreen list a tampered blob is skipped and honestly counted (singular and plural)
statusReason: expected '‹ September 2026 › M T W T F S S 1 2 …' to contain '2 entries couldn\'t be read on this d…'

[Killed] EqualityOperator
src/screens/HistoryScreen.tsx:776:25
       )}
       {unreadable > 0 && (
         <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize, textAlign: "center" }}>
-          {unreadable} {unreadable === 1 ? "entry" : "entries"} couldn't be read on this device.
+          {unreadable} {unreadable !== 1 ? "entry" : "entries"} couldn't be read on this device.
         </Text>
       )}
killedBy: HistoryScreen pins: state cards and presence guards the unreadable count line carries its exact centered meta style
statusReason: expected 'No entries yet. What you write each d…' to contain '2 entries couldn\'t be read on this d…'

[Killed] ConditionalExpression
src/screens/HistoryScreen.tsx:776:25
       )}
       {unreadable > 0 && (
         <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize, textAlign: "center" }}>
-          {unreadable} {unreadable === 1 ? "entry" : "entries"} couldn't be read on this device.
+          {unreadable} {true ? "entry" : "entries"} couldn't be read on this device.
         </Text>
       )}
killedBy: HistoryScreen pins: state cards and presence guards the unreadable count line carries its exact centered meta style
statusReason: expected 'No entries yet. What you write each d…' to contain '2 entries couldn\'t be read on this d…'

[Killed] StringLiteral
src/screens/HistoryScreen.tsx:788:76
 const styles = StyleSheet.create({
   flex: { flex: 1 },
   card: { padding: 16, gap: 10 },
-  rowHeader: { flexDirection: "row", alignItems: "center", justifyContent: "space-between", gap: 10 },
+  rowHeader: { flexDirection: "row", alignItems: "center", justifyContent: "", gap: 10 },
   detailHeader: { flexDirection: "row", alignItems: "center", gap: 10 },
   badge: { paddingVertical: 4, paddingHorizontal: 10 },
killedBy: HistoryScreen pins: list chrome and row contract the list screen and its rows carry the full themed style contract
statusReason: expected { flexDirection: 'row', …(3) } to deeply equal { flexDirection: 'row', …(3) }

[Killed] ObjectLiteral
src/screens/HistoryScreen.tsx:788:14
 const styles = StyleSheet.create({
   flex: { flex: 1 },
   card: { padding: 16, gap: 10 },
-  rowHeader: { flexDirection: "row", alignItems: "center", justifyContent: "space-between", gap: 10 },
+  rowHeader: {},
   detailHeader: { flexDirection: "row", alignItems: "center", gap: 10 },
   badge: { paddingVertical: 4, paddingHorizontal: 10 },
killedBy: HistoryScreen pins: list chrome and row contract the list screen and its rows carry the full themed style contract
statusReason: expected {} to deeply equal { flexDirection: 'row', …(3) }

[Killed] StringLiteral
src/screens/HistoryScreen.tsx:789:34
   flex: { flex: 1 },
   card: { padding: 16, gap: 10 },
   rowHeader: { flexDirection: "row", alignItems: "center", justifyContent: "space-between", gap: 10 },
-  detailHeader: { flexDirection: "row", alignItems: "center", gap: 10 },
+  detailHeader: { flexDirection: "", alignItems: "center", gap: 10 },
   badge: { paddingVertical: 4, paddingHorizontal: 10 },
   input: { minHeight: 140, textAlignVertical: "top" },
killedBy: HistoryScreen pins: detail chrome and cancel the detail screen carries its style contract; editor Cancel returns to the DETAIL
statusReason: expected { flexDirection: '', …(2) } to deeply equal { flexDirection: 'row', …(2) }

[Killed] StringLiteral
src/screens/HistoryScreen.tsx:789:53
   flex: { flex: 1 },
   card: { padding: 16, gap: 10 },
   rowHeader: { flexDirection: "row", alignItems: "center", justifyContent: "space-between", gap: 10 },
-  detailHeader: { flexDirection: "row", alignItems: "center", gap: 10 },
+  detailHeader: { flexDirection: "row", alignItems: "", gap: 10 },
   badge: { paddingVertical: 4, paddingHorizontal: 10 },
   input: { minHeight: 140, textAlignVertical: "top" },
killedBy: HistoryScreen pins: detail chrome and cancel the detail screen carries its style contract; editor Cancel returns to the DETAIL
statusReason: expected { flexDirection: 'row', …(2) } to deeply equal { flexDirection: 'row', …(2) }
