[Killed] ConditionalExpression
src/screens/QuestionScreen.tsx:287:8
           <Text style={{ color: t.colors.body, fontSize: t.type.body.fontSize, lineHeight: 22 }}>{notice}</Text>
         </View>
       )}
-      {phase === "baseline" && generic && !question && (
-        <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.xl }]}>
-          <Text style={[styles.cardTitle, { color: t.colors.accent }]}>Today</Text>
-          <Text style={[styles.question, { color: t.colors.text }]}>{generic}</Text>
-          <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize, lineHeight: 17 }}>
-            For now, one question a day. After {dayProgress?.total ?? 30} days of writing, your
-            questions start coming from YOUR patterns.
-          </Text>
-          {dayProgress && (
-            <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize }}>
-              Day {dayProgress.active} of {dayProgress.total}
-            </Text>
-          )}
-<GhostButton
-            label="Write about this"
-            center={false}
-            onPress={() => void writeAbout(generic)}
-            accessibilityLabel="Write about this question"
-          />
-        </View>
-      )}
+      {false}
       {question && (
         <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.xl }]}>
killedBy: QuestionScreen pins: card presence guards a stale generic never re-renders after the phase moves to insight
statusReason: expected 'Refresh Today\'s question comes from …' to contain 'What took up most space in your mind …'

[Killed] ObjectLiteral
src/screens/QuestionScreen.tsx:289:43
       )}
       {phase === "baseline" && generic && !question && (
         <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.xl }]}>
-          <Text style={[styles.cardTitle, { color: t.colors.accent }]}>Today</Text>
+          <Text style={[styles.cardTitle, {}]}>Today</Text>
           <Text style={[styles.question, { color: t.colors.text }]}>{generic}</Text>
           <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize, lineHeight: 17 }}>
killedBy: QuestionScreen pins: node-exact style contracts the baseline card: view, title, question, fine print, day counter, ghost button
statusReason: expected [ { fontSize: 12, …(2) }, {} ] to deeply equal [ { fontSize: 12, …(2) }, …(1) ]

[Killed] ObjectLiteral
src/screens/QuestionScreen.tsx:291:24
         <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.xl }]}>
           <Text style={[styles.cardTitle, { color: t.colors.accent }]}>Today</Text>
           <Text style={[styles.question, { color: t.colors.text }]}>{generic}</Text>
-          <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize, lineHeight: 17 }}>
+          <Text style={{}}>
             For now, one question a day. After {dayProgress?.total ?? 30} days of writing, your
             questions start coming from YOUR patterns.
killedBy: QuestionScreen pins: node-exact style contracts the baseline card: view, title, question, fine print, day counter, ghost button
statusReason: expected {} to deeply equal { Object (color, fontSize, ...) }

[Killed] LogicalOperator
src/screens/QuestionScreen.tsx:292:49
           <Text style={[styles.cardTitle, { color: t.colors.accent }]}>Today</Text>
           <Text style={[styles.question, { color: t.colors.text }]}>{generic}</Text>
           <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize, lineHeight: 17 }}>
-            For now, one question a day. After {dayProgress?.total ?? 30} days of writing, your
+            For now, one question a day. After {dayProgress?.total && 30} days of writing, your
             questions start coming from YOUR patterns.
           </Text>
killedBy: QuestionScreen pins: card presence guards an OFFLINE phase check drops the day counter from the previous load
statusReason: expected 'Today What took up most space in your…' to contain 'After 30 days of writing'

[Killed] OptionalChaining
src/screens/QuestionScreen.tsx:292:49
           <Text style={[styles.cardTitle, { color: t.colors.accent }]}>Today</Text>
           <Text style={[styles.question, { color: t.colors.text }]}>{generic}</Text>
           <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize, lineHeight: 17 }}>
-            For now, one question a day. After {dayProgress?.total ?? 30} days of writing, your
+            For now, one question a day. After {dayProgress.total ?? 30} days of writing, your
             questions start coming from YOUR patterns.
           </Text>
killedBy: QuestionScreen pins: card presence guards an OFFLINE phase check drops the day counter from the previous load
statusReason: Cannot read properties of null (reading 'total')

[Killed] LogicalOperator
src/screens/QuestionScreen.tsx:295:12
             For now, one question a day. After {dayProgress?.total ?? 30} days of writing, your
             questions start coming from YOUR patterns.
           </Text>
-          {dayProgress && (
-            <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize }}>
-              Day {dayProgress.active} of {dayProgress.total}
-            </Text>
-          )}
+          {dayProgress || <Text style={{
+  color: t.colors.muted,
+  fontSize: t.type.meta.fontSize
+}}>
+              Day {dayProgress.active} of {dayProgress.total}
+            </Text>}
 <GhostButton
             label="Write about this"
killedBy: QuestionScreen pins: card presence guards a stale generic never re-renders after the phase moves to insight
statusReason: Objects are not valid as a React child (found: object with keys {active, total}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
src/screens/QuestionScreen.tsx:295:12
             For now, one question a day. After {dayProgress?.total ?? 30} days of writing, your
             questions start coming from YOUR patterns.
           </Text>
-          {dayProgress && (
-            <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize }}>
-              Day {dayProgress.active} of {dayProgress.total}
-            </Text>
-          )}
+          {true}
 <GhostButton
             label="Write about this"
killedBy: QuestionScreen pins: card presence guards an OFFLINE phase check drops the day counter from the previous load
statusReason: expected 'Today What took up most space in your…' to contain 'Day 4 of 30'

[Killed] ObjectLiteral
src/screens/QuestionScreen.tsx:296:26
             questions start coming from YOUR patterns.
           </Text>
           {dayProgress && (
-            <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize }}>
+            <Text style={{}}>
               Day {dayProgress.active} of {dayProgress.total}
             </Text>
killedBy: QuestionScreen pins: node-exact style contracts the baseline card: view, title, question, fine print, day counter, ghost button
statusReason: expected {} to deeply equal { color: '#8a91a3', fontSize: 12 }

[Killed] BooleanLiteral
src/screens/QuestionScreen.tsx:302:21
           )}
 <GhostButton
             label="Write about this"
-            center={false}
+            center={true}
             onPress={() => void writeAbout(generic)}
             accessibilityLabel="Write about this question"
killedBy: QuestionScreen pins: node-exact style contracts the baseline card: view, title, question, fine print, day counter, ghost button
statusReason: expected [ { padding: 12 }, …(2) ] to deeply equal [ { padding: 12 }, false, …(1) ]

[Killed] ArrowFunction
src/screens/QuestionScreen.tsx:303:22
 <GhostButton
             label="Write about this"
             center={false}
-            onPress={() => void writeAbout(generic)}
+            onPress={() => undefined}
             accessibilityLabel="Write about this question"
           />
killedBy: QuestionScreen pins: dialog and bridge contracts the bridge's no-account alert quotes its exact sentence
statusReason: expected "vi.fn()" to be called with arguments: [ 'Session damaged', …(1) ]

Number of calls: 0

[Killed] ObjectLiteral
src/screens/QuestionScreen.tsx:309:36
         </View>
       )}
       {question && (
-        <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.xl }]}>
+        <View style={[styles.card, {}]}>
           <Text style={[styles.cardTitle, { color: t.colors.accent }]}>Today</Text>
           <Text style={[styles.question, { color: t.colors.text }]}>{question}</Text>
killedBy: QuestionScreen pins: node-exact style contracts the insight card: title overlay, question, fine print, ghost button
statusReason: expected [ { padding: 22, gap: 12 }, {} ] to deeply equal [ { padding: 22, gap: 12 }, { …(2) } ]

[Killed] LogicalOperator
src/screens/QuestionScreen.tsx:315:22
           <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize }}>
             One question a day. No advice — just something to sit with.
           </Text>
-                    {patternPid !== null && !feedbackGiven && (
+                    {patternPid !== null || !feedbackGiven && (
             <View style={{ flexDirection: "row", gap: 8, justifyContent: "center" }}>
               <GhostButton
killedBy: QuestionScreen feedback attribution (pattern_pid) an ordinary stored question (no pid) never offers the taps
statusReason: expected 'Today What did you notice? One questi…' not to contain 'This resonated'

[Killed] LogicalOperator
src/screens/QuestionScreen.tsx:315:22
           <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize }}>
             One question a day. No advice — just something to sit with.
           </Text>
-                    {patternPid !== null && !feedbackGiven && (
-            <View style={{ flexDirection: "row", gap: 8, justifyContent: "center" }}>
-              <GhostButton
-                label="This resonated"
-                center={false}
-                onPress={() => void recordTap(true)}
-                accessibilityLabel="This question resonated with me"
-              />
-              <GhostButton
-                label="Not me"
-                center={false}
-                onPress={() => void recordTap(false)}
-                accessibilityLabel="This question does not land for me"
-              />
-            </View>
-          )}
+                    {patternPid !== null && !feedbackGiven || <View style={{
+  flexDirection: "row",
+  gap: 8,
+  justifyContent: "center"
+}}>
+              <GhostButton label="This resonated" center={false} onPress={() => void recordTap(true)} accessibilityLabel="This question resonated with me" />
+              <GhostButton label="Not me" center={false} onPress={() => void recordTap(false)} accessibilityLabel="This question does not land for me" />
+            </View>}
 <GhostButton
             label="Write about this"
killedBy: QuestionScreen feedback attribution (pattern_pid) a stored question carrying pattern_pid offers the taps and records THAT pid
statusReason: expected 'Today What repeats? One question a da…' to contain 'This resonated'

[Survived] ObjectLiteral
src/screens/QuestionScreen.tsx:316:26
             One question a day. No advice — just something to sit with.
           </Text>
                     {patternPid !== null && !feedbackGiven && (
-            <View style={{ flexDirection: "row", gap: 8, justifyContent: "center" }}>
+            <View style={{}}>
               <GhostButton
                 label="This resonated"

[Survived] StringLiteral
src/screens/QuestionScreen.tsx:316:74
             One question a day. No advice — just something to sit with.
           </Text>
                     {patternPid !== null && !feedbackGiven && (
-            <View style={{ flexDirection: "row", gap: 8, justifyContent: "center" }}>
+            <View style={{ flexDirection: "row", gap: 8, justifyContent: "" }}>
               <GhostButton
                 label="This resonated"

[Survived] BooleanLiteral
src/screens/QuestionScreen.tsx:319:25
             <View style={{ flexDirection: "row", gap: 8, justifyContent: "center" }}>
               <GhostButton
                 label="This resonated"
-                center={false}
+                center={true}
                 onPress={() => void recordTap(true)}
                 accessibilityLabel="This question resonated with me"

[Killed] ArrowFunction
src/screens/QuestionScreen.tsx:320:26
               <GhostButton
                 label="This resonated"
                 center={false}
-                onPress={() => void recordTap(true)}
+                onPress={() => undefined}
                 accessibilityLabel="This question resonated with me"
               />
killedBy: QuestionScreen feedback attribution (pattern_pid) a stored question carrying pattern_pid offers the taps and records THAT pid
statusReason: expected [] to deeply equal [ { pid: 'pid-1', resonated: true } ]

[Killed] BooleanLiteral
src/screens/QuestionScreen.tsx:320:47
               <GhostButton
                 label="This resonated"
                 center={false}
-                onPress={() => void recordTap(true)}
+                onPress={() => void recordTap(false)}
                 accessibilityLabel="This question resonated with me"
               />
killedBy: QuestionScreen feedback attribution (pattern_pid) a stored question carrying pattern_pid offers the taps and records THAT pid
statusReason: expected [ { pid: 'pid-1', resonated: false } ] to deeply equal [ { pid: 'pid-1', resonated: true } ]

[Survived] BooleanLiteral
src/screens/QuestionScreen.tsx:325:25
               />
               <GhostButton
                 label="Not me"
-                center={false}
+                center={true}
                 onPress={() => void recordTap(false)}
                 accessibilityLabel="This question does not land for me"

[Killed] ArrowFunction
src/screens/QuestionScreen.tsx:326:26
               <GhostButton
                 label="Not me"
                 center={false}
-                onPress={() => void recordTap(false)}
+                onPress={() => undefined}
                 accessibilityLabel="This question does not land for me"
               />
killedBy: QuestionScreen feedback attribution (pattern_pid) a refresh that swaps the question re-attributes the taps to the NEW pid
statusReason: expected [] to deeply equal [ { pid: 'pid-b', resonated: false } ]

[Killed] BooleanLiteral
src/screens/QuestionScreen.tsx:326:47
               <GhostButton
                 label="Not me"
                 center={false}
-                onPress={() => void recordTap(false)}
+                onPress={() => void recordTap(true)}
                 accessibilityLabel="This question does not land for me"
               />
killedBy: QuestionScreen feedback attribution (pattern_pid) a refresh that swaps the question re-attributes the taps to the NEW pid
statusReason: expected [ { pid: 'pid-b', resonated: true } ] to deeply equal [ { pid: 'pid-b', resonated: false } ]

[Killed] ArrowFunction
src/screens/QuestionScreen.tsx:334:22
 <GhostButton
             label="Write about this"
             center={false}
-            onPress={() => void writeAbout(question)}
+            onPress={() => undefined}
             accessibilityLabel="Write about this question"
           />
killedBy: QuestionScreen 'Write about this' bridges a pattern-based question the same way
statusReason: expected null to be 'What repeats?' // Object.is equality

[Killed] LogicalOperator
src/screens/QuestionScreen.tsx:341:18
       )}
       <View>
         <PrimaryButton
-          label={question ?? generic ? "Refresh" : "Show today's question"}
+          label={question && generic ? "Refresh" : "Show today's question"}
           onPress={onShowQuestion}
           busy={busy}
killedBy: QuestionScreen the day-one question rotates with the date (one per day)
statusReason: no Text node containing "Refresh":

[Killed] StringLiteral
src/screens/QuestionScreen.tsx:341:40
       )}
       <View>
         <PrimaryButton
-          label={question ?? generic ? "Refresh" : "Show today's question"}
+          label={question ?? generic ? "" : "Show today's question"}
           onPress={onShowQuestion}
           busy={busy}
killedBy: QuestionScreen the day-one question rotates with the date (one per day)
statusReason: no Text node containing "Refresh":
Today | First day question | For now, one question a day. After 30 days of writing, your questions start coming from YOUR patterns. | Day 4 of 30 | Write about this |  | Today's question comes from a small built-in set — nothing leaves this device for it. | Need help now? Crisis resources

[Killed] ArrayDeclaration
src/screens/QuestionScreen.tsx:345:22
           onPress={onShowQuestion}
           busy={busy}
         />
-        <Text style={[styles.caption, { color: t.colors.muted, fontSize: t.type.meta.fontSize }]}>
+        <Text style={[]}>
           {phase === "baseline"
             ? "Today's question comes from a small built-in set — nothing leaves this device for it."
killedBy: QuestionScreen pins: node-exact style contracts the caption carries its base + themed style array
statusReason: expected [] to deeply equal [ { textAlign: 'center', …(2) }, …(1) ]

[Killed] ObjectLiteral
src/screens/QuestionScreen.tsx:345:39
           onPress={onShowQuestion}
           busy={busy}
         />
-        <Text style={[styles.caption, { color: t.colors.muted, fontSize: t.type.meta.fontSize }]}>
+        <Text style={[styles.caption, {}]}>
           {phase === "baseline"
             ? "Today's question comes from a small built-in set — nothing leaves this device for it."
killedBy: QuestionScreen pins: node-exact style contracts the caption carries its base + themed style array
statusReason: expected [ { textAlign: 'center', …(2) }, {} ] to deeply equal [ { textAlign: 'center', …(2) }, …(1) ]

[Killed] ConditionalExpression
src/screens/QuestionScreen.tsx:346:12
           busy={busy}
         />
         <Text style={[styles.caption, { color: t.colors.muted, fontSize: t.type.meta.fontSize }]}>
-          {phase === "baseline"
+          {true
             ? "Today's question comes from a small built-in set — nothing leaves this device for it."
             : "Computing your question can send your encryption key to the server once — held in memory for up to 5 minutes, never stored."}
killedBy: QuestionScreen key-shipment consent (informed consent fix) the honest caption matches the phase: key shipment only post-threshold
statusReason: expected 'Show today\'s question Today\'s quest…' to contain 'held in memory for up to 5 minutes, n…'

[Killed] EqualityOperator
src/screens/QuestionScreen.tsx:346:12
           busy={busy}
         />
         <Text style={[styles.caption, { color: t.colors.muted, fontSize: t.type.meta.fontSize }]}>
-          {phase === "baseline"
+          {phase !== "baseline"
             ? "Today's question comes from a small built-in set — nothing leaves this device for it."
             : "Computing your question can send your encryption key to the server once — held in memory for up to 5 minutes, never stored."}
killedBy: QuestionScreen below the threshold shows TODAY'S question from the on-device pool — neutral, no key, no consent
statusReason: expected 'Today What took up most space in your…' to contain 'nothing leaves this device for it.'

[Killed] ArrowFunction
src/screens/QuestionScreen.tsx:351:34
             : "Computing your question can send your encryption key to the server once — held in memory for up to 5 minutes, never stored."}
         </Text>
       </View>
-      <CrisisHelpButton onPress={() => navigation.navigate("Crisis")} />
+      <CrisisHelpButton onPress={() => undefined} />
       </View>
     </ScrollView>
killedBy: QuestionScreen the crisis link is one tap away and navigates to Crisis
statusReason: expected "vi.fn()" to be called with arguments: [ 'Crisis' ]

Number of calls: 0

[Killed] StringLiteral
src/screens/QuestionScreen.tsx:351:60
             : "Computing your question can send your encryption key to the server once — held in memory for up to 5 minutes, never stored."}
         </Text>
       </View>
-      <CrisisHelpButton onPress={() => navigation.navigate("Crisis")} />
+      <CrisisHelpButton onPress={() => navigation.navigate("")} />
       </View>
     </ScrollView>
killedBy: QuestionScreen the crisis link is one tap away and navigates to Crisis
statusReason: expected "vi.fn()" to be called with arguments: [ 'Crisis' ]

Received:

  1st vi.fn() call:

  [
-   "Crisis",

[Killed] StringLiteral
src/screens/QuestionScreen.tsx:358:41
 }
 
 const styles = StyleSheet.create({
-  container: { flex: 1, justifyContent: "center" },
+  container: { flex: 1, justifyContent: "" },
   card: { padding: 22, gap: 12 },
   cardTitle: { fontSize: 12, fontWeight: "700", letterSpacing: 1.5 },
killedBy: QuestionScreen pins the visual language of the screen (question shown)
statusReason: style not rendered: {"flex":1,"justifyContent":"center"}
rendered styles:
{"flex":1,"backgroundColor":"#0f1115"}
{"flex":1,"justifyContent":""}
{"backgroundColor":"#0f1115","padding":24,"gap":18}
{"padding":22,"gap":12}
{"backgroundColor":"#1a1e26","borderRadius":14}
{"fontSize":12,"fontWeight":"700","letterSpacing":1.5}

[Killed] ObjectLiteral
src/screens/QuestionScreen.tsx:359:9
 
 const styles = StyleSheet.create({
   container: { flex: 1, justifyContent: "center" },
-  card: { padding: 22, gap: 12 },
+  card: {},
   cardTitle: { fontSize: 12, fontWeight: "700", letterSpacing: 1.5 },
   question: { fontSize: 22, fontWeight: "600", lineHeight: 30 },
killedBy: QuestionScreen pins the visual language of the screen (question shown)
statusReason: style not rendered: {"padding":22,"gap":12}
rendered styles:
{"flex":1,"backgroundColor":"#0f1115"}
{"flex":1,"justifyContent":"center"}
{"backgroundColor":"#0f1115","padding":24,"gap":18}
{}
{"backgroundColor":"#1a1e26","borderRadius":14}
{"fontSize":12,"fontWeight":"700","letterSpacing":1.5}

[Killed] ObjectLiteral
src/screens/QuestionScreen.tsx:362:10
   card: { padding: 22, gap: 12 },
   cardTitle: { fontSize: 12, fontWeight: "700", letterSpacing: 1.5 },
   question: { fontSize: 22, fontWeight: "600", lineHeight: 30 },
-  error: { fontSize: 13, textAlign: "center" },
+  error: {},
   caption: { textAlign: "center", marginTop: 8, lineHeight: 16 },
 });
killedBy: QuestionScreen renders the error style on failures
statusReason: style not rendered: {"fontSize":13,"textAlign":"center"}
rendered styles:
{"flex":1,"backgroundColor":"#0f1115"}
{"flex":1,"justifyContent":"center"}
{"backgroundColor":"#0f1115","padding":24,"gap":18}
{}
{"color":"#ff6b6b"}
{"borderRadius":10,"padding":16,"alignItems":"center","justifyContent":"center"}

[Killed] StringLiteral
src/screens/QuestionScreen.tsx:362:37
   card: { padding: 22, gap: 12 },
   cardTitle: { fontSize: 12, fontWeight: "700", letterSpacing: 1.5 },
   question: { fontSize: 22, fontWeight: "600", lineHeight: 30 },
-  error: { fontSize: 13, textAlign: "center" },
+  error: { fontSize: 13, textAlign: "" },
   caption: { textAlign: "center", marginTop: 8, lineHeight: 16 },
 });
killedBy: QuestionScreen renders the error style on failures
statusReason: style not rendered: {"fontSize":13,"textAlign":"center"}
rendered styles:
{"flex":1,"backgroundColor":"#0f1115"}
{"flex":1,"justifyContent":"center"}
{"backgroundColor":"#0f1115","padding":24,"gap":18}
{"fontSize":13,"textAlign":""}
{"color":"#ff6b6b"}
{"borderRadius":10,"padding":16,"alignItems":"center","justifyContent":"center"}

[Killed] ObjectLiteral
src/screens/QuestionScreen.tsx:363:12
   cardTitle: { fontSize: 12, fontWeight: "700", letterSpacing: 1.5 },
   question: { fontSize: 22, fontWeight: "600", lineHeight: 30 },
   error: { fontSize: 13, textAlign: "center" },
-  caption: { textAlign: "center", marginTop: 8, lineHeight: 16 },
+  caption: {},
 });
 
killedBy: QuestionScreen pins: node-exact style contracts the caption carries its base + themed style array
statusReason: expected [ {}, …(1) ] to deeply equal [ { textAlign: 'center', …(2) }, …(1) ]

[Killed] StringLiteral
src/screens/QuestionScreen.tsx:363:25
   cardTitle: { fontSize: 12, fontWeight: "700", letterSpacing: 1.5 },
   question: { fontSize: 22, fontWeight: "600", lineHeight: 30 },
   error: { fontSize: 13, textAlign: "center" },
-  caption: { textAlign: "center", marginTop: 8, lineHeight: 16 },
+  caption: { textAlign: "", marginTop: 8, lineHeight: 16 },
 });
 
killedBy: QuestionScreen pins: node-exact style contracts the caption carries its base + themed style array
statusReason: expected [ { textAlign: '', …(2) }, …(1) ] to deeply equal [ { textAlign: 'center', …(2) }, …(1) ]
