[Killed] BlockStatement
src/screens/SettingsScreen.tsx:247:34
     );
   };
 
-  const deleteEverything = () => {
-    Alert.alert(
-      "Delete everything?",
-      "All entries, patterns and your account will be permanently deleted from the server. " +
-        "Your local encrypted queue is also wiped. This cannot be undone. You will be asked for your password.",
-      [
-        { text: "Cancel", style: "cancel" },
-        {
-          text: "Continue",
-          style: "destructive",
-          onPress: () =>
-            Alert.alert("Final confirmation", "Deleting is irreversible. You will be asked for your password next.", [
-              { text: "Cancel", style: "cancel" },
-              // The password prompt below IS the real confirmation.
-              { text: "Continue to password", style: "destructive", onPress: () => setPending({ kind: "delete" }) },
-            ]),
-        },
-      ],
-    );
-  };
+  const deleteEverything = () => {};
 
   // Appearance state (2026-09-17). The radio starts at the provider's own
killedBy: destructive delete requires two confirmations and the sign-in key
statusReason: Alert.alert was never called

[Killed] StringLiteral
src/screens/SettingsScreen.tsx:255:17
       [
         { text: "Cancel", style: "cancel" },
         {
-          text: "Continue",
+          text: "",
           style: "destructive",
           onPress: () =>
killedBy: destructive delete requires two confirmations and the sign-in key
statusReason: no alert button "Continue"; buttons: [{"text":"Cancel","style":"cancel"},{"text":"","style":"destructive"}]

[Killed] ArrowFunction
src/screens/SettingsScreen.tsx:257:20
         {
           text: "Continue",
           style: "destructive",
-          onPress: () =>
-            Alert.alert("Final confirmation", "Deleting is irreversible. You will be asked for your password next.", [
-              { text: "Cancel", style: "cancel" },
-              // The password prompt below IS the real confirmation.
-              { text: "Continue to password", style: "destructive", onPress: () => setPending({ kind: "delete" }) },
-            ]),
+          onPress: () => undefined,
         },
       ],
killedBy: destructive delete requires two confirmations and the sign-in key
statusReason: expected 'Delete everything?' to be 'Final confirmation' // Object.is equality

[Killed] ObjectLiteral
src/screens/SettingsScreen.tsx:259:15
           style: "destructive",
           onPress: () =>
             Alert.alert("Final confirmation", "Deleting is irreversible. You will be asked for your password next.", [
-              { text: "Cancel", style: "cancel" },
+              {},
               // The password prompt below IS the real confirmation.
               { text: "Continue to password", style: "destructive", onPress: () => setPending({ kind: "delete" }) },
killedBy: destructive delete requires two confirmations and the sign-in key
statusReason: no alert button "Cancel"; buttons: [{},{"text":"Continue to password","style":"destructive"}]

[Killed] ArrowFunction
src/screens/SettingsScreen.tsx:261:78
             Alert.alert("Final confirmation", "Deleting is irreversible. You will be asked for your password next.", [
               { text: "Cancel", style: "cancel" },
               // The password prompt below IS the real confirmation.
-              { text: "Continue to password", style: "destructive", onPress: () => setPending({ kind: "delete" }) },
+              { text: "Continue to password", style: "destructive", onPress: () => undefined },
             ]),
         },
killedBy: destructive delete requires two confirmations and the sign-in key
statusReason: expected 'Need help now? Crisis resources APPEA…' to contain 'Enter your password to delete everyth…'

[Killed] StringLiteral
src/screens/SettingsScreen.tsx:261:23
             Alert.alert("Final confirmation", "Deleting is irreversible. You will be asked for your password next.", [
               { text: "Cancel", style: "cancel" },
               // The password prompt below IS the real confirmation.
-              { text: "Continue to password", style: "destructive", onPress: () => setPending({ kind: "delete" }) },
+              { text: "", style: "destructive", onPress: () => setPending({ kind: "delete" }) },
             ]),
         },
killedBy: destructive delete requires two confirmations and the sign-in key
statusReason: no alert button "Continue to password"; buttons: [{"text":"Cancel","style":"cancel"},{"text":"","style":"destructive"}]

[Killed] StringLiteral
src/screens/SettingsScreen.tsx:273:62
   // value derived from the active palette (a "system" preference on a
   // dark-OS device must not select "Dark" as if it were the override).
   const setThemeMode = useSetThemeMode();
-  const [themeMode, setThemeModeState] = useState<ThemeMode>("system");
+  const [themeMode, setThemeModeState] = useState<ThemeMode>("");
   const [haptics, setHaptics] = useState(true);
   const [reminders] = useState(reminderCapability());
killedBy: theme radio initial value shows the provider default while the persisted read is in flight — never a palette-derived value
statusReason: expected { selected: false } to deeply equal { selected: true }

[Survived] BooleanLiteral
src/screens/SettingsScreen.tsx:274:42
   // dark-OS device must not select "Dark" as if it were the override).
   const setThemeMode = useSetThemeMode();
   const [themeMode, setThemeModeState] = useState<ThemeMode>("system");
-  const [haptics, setHaptics] = useState(true);
+  const [haptics, setHaptics] = useState(false);
   const [reminders] = useState(reminderCapability());
   const [biometrics] = useState(biometricCapability());

[Survived] BlockStatement
src/screens/SettingsScreen.tsx:277:25
   const [haptics, setHaptics] = useState(true);
   const [reminders] = useState(reminderCapability());
   const [biometrics] = useState(biometricCapability());
-  React.useEffect(() => {
-    void loadHapticsSetting().then(setHaptics);
-  }, []);
+  React.useEffect(() => {}, []);
   React.useEffect(() => {
     let cancelled = false;

[Killed] BlockStatement
src/screens/SettingsScreen.tsx:280:25
   React.useEffect(() => {
     void loadHapticsSetting().then(setHaptics);
   }, []);
-  React.useEffect(() => {
-    let cancelled = false;
-    void (async () => {
-      try {
-        const AsyncStorage = (await import("@react-native-async-storage/async-storage")).default;
-        const stored = await AsyncStorage.getItem(themeStorageKey());
-        if (!cancelled && (stored === "dark" || stored === "light" || stored === "system")) {
-          setThemeModeState(stored);
-        }
-      } catch {
-        /* non-sensitive preference; default stands */
-      }
-    })();
-    return () => {
-      cancelled = true;
-    };
-  }, []);
+  React.useEffect(() => {}, []);
 
   const themed = {
killedBy: theme radio initial value shows the provider default while the persisted read is in flight — never a palette-derived value
statusReason: resolveStored is not a function

[Killed] BooleanLiteral
src/screens/SettingsScreen.tsx:281:21
     void loadHapticsSetting().then(setHaptics);
   }, []);
   React.useEffect(() => {
-    let cancelled = false;
+    let cancelled = true;
     void (async () => {
       try {
killedBy: theme radio initial value shows the provider default while the persisted read is in flight — never a palette-derived value
statusReason: expected { selected: false } to deeply equal { selected: true }

[Killed] BlockStatement
src/screens/SettingsScreen.tsx:282:23
   }, []);
   React.useEffect(() => {
     let cancelled = false;
-    void (async () => {
-      try {
-        const AsyncStorage = (await import("@react-native-async-storage/async-storage")).default;
-        const stored = await AsyncStorage.getItem(themeStorageKey());
-        if (!cancelled && (stored === "dark" || stored === "light" || stored === "system")) {
-          setThemeModeState(stored);
-        }
-      } catch {
-        /* non-sensitive preference; default stands */
-      }
-    })();
+    void (async () => {})();
     return () => {
       cancelled = true;
killedBy: theme radio initial value shows the provider default while the persisted read is in flight — never a palette-derived value
statusReason: resolveStored is not a function

[Killed] BlockStatement
src/screens/SettingsScreen.tsx:283:11
   React.useEffect(() => {
     let cancelled = false;
     void (async () => {
-      try {
-        const AsyncStorage = (await import("@react-native-async-storage/async-storage")).default;
-        const stored = await AsyncStorage.getItem(themeStorageKey());
-        if (!cancelled && (stored === "dark" || stored === "light" || stored === "system")) {
-          setThemeModeState(stored);
-        }
-      } catch {
+      try {} catch {
         /* non-sensitive preference; default stands */
       }
killedBy: theme radio initial value shows the provider default while the persisted read is in flight — never a palette-derived value
statusReason: resolveStored is not a function

[Killed] EqualityOperator
src/screens/SettingsScreen.tsx:286:28
       try {
         const AsyncStorage = (await import("@react-native-async-storage/async-storage")).default;
         const stored = await AsyncStorage.getItem(themeStorageKey());
-        if (!cancelled && (stored === "dark" || stored === "light" || stored === "system")) {
+        if (!cancelled && (stored !== "dark" || stored === "light" || stored === "system")) {
           setThemeModeState(stored);
         }
killedBy: theme radio initial value shows the provider default while the persisted read is in flight — never a palette-derived value
statusReason: expected { selected: false } to deeply equal { selected: true }

[Killed] ConditionalExpression
src/screens/SettingsScreen.tsx:286:13
       try {
         const AsyncStorage = (await import("@react-native-async-storage/async-storage")).default;
         const stored = await AsyncStorage.getItem(themeStorageKey());
-        if (!cancelled && (stored === "dark" || stored === "light" || stored === "system")) {
+        if (true) {
           setThemeModeState(stored);
         }
killedBy: theme radio initial value with nothing persisted the radio rests on System (the provider default)
statusReason: expected { selected: false } to deeply equal { selected: true }

[Killed] CallExpression
src/screens/SettingsScreen.tsx:287:11
         const AsyncStorage = (await import("@react-native-async-storage/async-storage")).default;
         const stored = await AsyncStorage.getItem(themeStorageKey());
         if (!cancelled && (stored === "dark" || stored === "light" || stored === "system")) {
-          setThemeModeState(stored);
+          ;
         }
       } catch {
killedBy: theme radio initial value shows the provider default while the persisted read is in flight — never a palette-derived value
statusReason: expected { selected: false } to deeply equal { selected: true }

[Survived] BlockStatement
src/screens/SettingsScreen.tsx:293:18
         /* non-sensitive preference; default stands */
       }
     })();
-    return () => {
-      cancelled = true;
-    };
+    return () => {};
   }, []);
 

[Killed] ObjectLiteral
src/screens/SettingsScreen.tsx:300:12
 
   const themed = {
     label: { color: t.colors.muted, fontSize: 12, fontWeight: "700" as const, letterSpacing: 1, marginTop: 8 },
-    input: {
-      backgroundColor: t.colors.card,
-      color: t.colors.text,
-      borderRadius: t.radius.md,
-      padding: 14,
-      fontSize: 15,
-    },
+    input: {},
     rowText: { color: t.colors.body, fontSize: 13, flex: 1, lineHeight: 18 },
     footnote: { color: t.colors.muted, fontSize: 12, lineHeight: 18 },
killedBy: SettingsScreen chrome pins the visual language of the screen
statusReason: style not rendered: {"backgroundColor":"#1a1e26","color":"#e8eaf0","borderRadius":10,"padding":14,"fontSize":15}
rendered styles:
{"flex":1}
{"backgroundColor":"#0f1115","padding":24,"gap":14}
{"padding":16,"alignItems":"center","justifyContent":"center"}
{"backgroundColor":"#242a38","borderRadius":10,"minHeight":44}
{"fontWeight":"700"}
{"color":"#e8eaf0","fontSize":14}

[Killed] ObjectLiteral
src/screens/SettingsScreen.tsx:308:15
       fontSize: 15,
     },
     rowText: { color: t.colors.body, fontSize: 13, flex: 1, lineHeight: 18 },
-    footnote: { color: t.colors.muted, fontSize: 12, lineHeight: 18 },
+    footnote: {},
   };
 
killedBy: SettingsScreen chrome pins the visual language of the screen
statusReason: style not rendered: {"color":"#8a91a3","fontSize":12,"lineHeight":18}
rendered styles:
{"flex":1}
{"backgroundColor":"#0f1115","padding":24,"gap":14}
{"padding":16,"alignItems":"center","justifyContent":"center"}
{"backgroundColor":"#242a38","borderRadius":10,"minHeight":44}
{"fontWeight":"700"}
{"color":"#e8eaf0","fontSize":14}

[Killed] ObjectLiteral
src/screens/SettingsScreen.tsx:313:33
 
   return (
     <ScrollView
-      style={[styles.container, { backgroundColor: t.colors.bg, padding: t.spacing.xxl, gap: 14 }]}
+      style={[styles.container, {}]}
       onTouchStart={touchActivity}
       contentContainerStyle={{ paddingBottom: t.spacing.xxxl }}
killedBy: SettingsScreen chrome pins the visual language of the screen
statusReason: style not rendered: {"backgroundColor":"#0f1115","padding":24,"gap":14}
rendered styles:
{"flex":1}
{}
{"padding":16,"alignItems":"center","justifyContent":"center"}
{"backgroundColor":"#242a38","borderRadius":10,"minHeight":44}
{"fontWeight":"700"}
{"color":"#e8eaf0","fontSize":14}

[Killed] ArrowFunction
src/screens/SettingsScreen.tsx:318:34
       contentContainerStyle={{ paddingBottom: t.spacing.xxxl }}
     >
       {/* Crisis help: one tap from here, works offline (see CrisisScreen). */}
-      <CrisisHelpButton onPress={() => navigation.navigate("Crisis")} />
+      <CrisisHelpButton onPress={() => undefined} />
 
       {rejectedCount > 0 && (
killedBy: destructive delete the crisis-help button navigates to Crisis without any confirmation
statusReason: expected "vi.fn()" to be called with arguments: [ 'Crisis' ]

Number of calls: 0

[Killed] StringLiteral
src/screens/SettingsScreen.tsx:318:60
       contentContainerStyle={{ paddingBottom: t.spacing.xxxl }}
     >
       {/* Crisis help: one tap from here, works offline (see CrisisScreen). */}
-      <CrisisHelpButton onPress={() => navigation.navigate("Crisis")} />
+      <CrisisHelpButton onPress={() => navigation.navigate("")} />
 
       {rejectedCount > 0 && (
killedBy: destructive delete the crisis-help button navigates to Crisis without any confirmation
statusReason: expected "vi.fn()" to be called with arguments: [ 'Crisis' ]

Received:

  1st vi.fn() call:

  [
-   "Crisis",

[Killed] EqualityOperator
src/screens/SettingsScreen.tsx:320:8
       {/* Crisis help: one tap from here, works offline (see CrisisScreen). */}
       <CrisisHelpButton onPress={() => navigation.navigate("Crisis")} />
 
-      {rejectedCount > 0 && (
+      {rejectedCount <= 0 && (
         <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}>
           <Text style={themed.rowText}>
killedBy: recovered entries surface is hidden when the rejected store is empty
statusReason: expected 'Need help now? Crisis resources 0 ent…' not to contain 'couldn\'t sync'

[Killed] ConditionalExpression
src/screens/SettingsScreen.tsx:320:8
       {/* Crisis help: one tap from here, works offline (see CrisisScreen). */}
       <CrisisHelpButton onPress={() => navigation.navigate("Crisis")} />
 
-      {rejectedCount > 0 && (
-        <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}>
-          <Text style={themed.rowText}>
-            {rejectedCount} {rejectedCount === 1 ? "entry" : "entries"} couldn't sync and{" "}
-            {rejectedCount === 1 ? "was" : "were"} kept safely on this device.
-          </Text>
-          <GhostButton
-            label="Try syncing them again"
-            center={false}
-            onPress={recoverRejected}
-            disabled={busy}
-            accessibilityLabel="Try syncing the recovered entries again"
-          />
-        </View>
-      )}
+      {true}
       {quarantined && (
         <Text style={themed.footnote}>
killedBy: recovered entries surface offers one-tap recovery when rejected entries exist (requeue + flush)
statusReason: expected 'Need help now? Crisis resources APPEA…' to contain '2 entries couldn\'t sync and were kep…'

[Killed] ArrayDeclaration
src/screens/SettingsScreen.tsx:321:22
       <CrisisHelpButton onPress={() => navigation.navigate("Crisis")} />
 
       {rejectedCount > 0 && (
-        <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}>
+        <View style={[]}>
           <Text style={themed.rowText}>
             {rejectedCount} {rejectedCount === 1 ? "entry" : "entries"} couldn't sync and{" "}
killedBy: SettingsScreen pins: node-exact style contracts the rejected-entries card composes its base and themed overlays exactly
statusReason: expected [] to deeply equal [ { padding: 16, gap: 8 }, { …(2) } ]

[Killed] ObjectLiteral
src/screens/SettingsScreen.tsx:321:36
       <CrisisHelpButton onPress={() => navigation.navigate("Crisis")} />
 
       {rejectedCount > 0 && (
-        <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}>
+        <View style={[styles.card, {}]}>
           <Text style={themed.rowText}>
             {rejectedCount} {rejectedCount === 1 ? "entry" : "entries"} couldn't sync and{" "}
killedBy: SettingsScreen pins: node-exact style contracts the rejected-entries card composes its base and themed overlays exactly
statusReason: expected [ { padding: 16, gap: 8 }, {} ] to deeply equal [ { padding: 16, gap: 8 }, { …(2) } ]

[Killed] ConditionalExpression
src/screens/SettingsScreen.tsx:323:30
       {rejectedCount > 0 && (
         <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}>
           <Text style={themed.rowText}>
-            {rejectedCount} {rejectedCount === 1 ? "entry" : "entries"} couldn't sync and{" "}
+            {rejectedCount} {false ? "entry" : "entries"} couldn't sync and{" "}
             {rejectedCount === 1 ? "was" : "were"} kept safely on this device.
           </Text>
killedBy: recovered entries surface singular wording for a single recovered entry
statusReason: expected 'Need help now? Crisis resources 1 ent…' to contain '1 entry couldn\'t sync and was kept s…'

[Killed] EqualityOperator
src/screens/SettingsScreen.tsx:323:30
       {rejectedCount > 0 && (
         <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}>
           <Text style={themed.rowText}>
-            {rejectedCount} {rejectedCount === 1 ? "entry" : "entries"} couldn't sync and{" "}
+            {rejectedCount} {rejectedCount !== 1 ? "entry" : "entries"} couldn't sync and{" "}
             {rejectedCount === 1 ? "was" : "were"} kept safely on this device.
           </Text>
killedBy: SettingsScreen pins: recovery flow refreshes the rejected count after recovery — an emptied store removes the card
statusReason: expected 'Need help now? Crisis resources 2 ent…' to contain '2 entries couldn\'t sync'

[Killed] ConditionalExpression
src/screens/SettingsScreen.tsx:324:14
         <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}>
           <Text style={themed.rowText}>
             {rejectedCount} {rejectedCount === 1 ? "entry" : "entries"} couldn't sync and{" "}
-            {rejectedCount === 1 ? "was" : "were"} kept safely on this device.
+            {false ? "was" : "were"} kept safely on this device.
           </Text>
           <GhostButton
killedBy: recovered entries surface singular wording for a single recovered entry
statusReason: expected 'Need help now? Crisis resources 1 ent…' to contain '1 entry couldn\'t sync and was kept s…'

[Killed] ConditionalExpression
src/screens/SettingsScreen.tsx:324:14
         <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}>
           <Text style={themed.rowText}>
             {rejectedCount} {rejectedCount === 1 ? "entry" : "entries"} couldn't sync and{" "}
-            {rejectedCount === 1 ? "was" : "were"} kept safely on this device.
+            {true ? "was" : "were"} kept safely on this device.
           </Text>
           <GhostButton
killedBy: recovered entries surface offers one-tap recovery when rejected entries exist (requeue + flush)
statusReason: expected 'Need help now? Crisis resources 2 ent…' to contain '2 entries couldn\'t sync and were kep…'

[Killed] BooleanLiteral
src/screens/SettingsScreen.tsx:328:21
           </Text>
           <GhostButton
             label="Try syncing them again"
-            center={false}
+            center={true}
             onPress={recoverRejected}
             disabled={busy}
killedBy: SettingsScreen pins: node-exact style contracts the rejected-entries card composes its base and themed overlays exactly
statusReason: expected [ { padding: 12 }, …(2) ] to deeply equal [ { padding: 12 }, false, …(1) ]

[Killed] ConditionalExpression
src/screens/SettingsScreen.tsx:335:8
           />
         </View>
       )}
-      {quarantined && (
-        <Text style={themed.footnote}>
-          A damaged piece of the offline queue was set aside instead of deleted. New entries sync
-          normally.
-        </Text>
-      )}
+      {true}
       {legacyQueueRecovery && (
         <View style={[styles.card, { backgroundColor: t.colors.card, borderColor: t.colors.border, borderWidth: 1, borderRadius: t.radius.lg }]} accessibilityRole="alert">
killedBy: recovered entries surface shows the quarantine notice when a corrupt queue payload was set aside
statusReason: expected 'Need help now? Crisis resources APPEA…' to contain 'damaged piece of the offline queue wa…'

[Killed] ConditionalExpression
src/screens/SettingsScreen.tsx:335:8
           />
         </View>
       )}
-      {quarantined && (
-        <Text style={themed.footnote}>
-          A damaged piece of the offline queue was set aside instead of deleted. New entries sync
-          normally.
-        </Text>
-      )}
+      {false}
       {legacyQueueRecovery && (
         <View style={[styles.card, { backgroundColor: t.colors.card, borderColor: t.colors.border, borderWidth: 1, borderRadius: t.radius.lg }]} accessibilityRole="alert">
killedBy: recovered entries surface shows the quarantine notice when a corrupt queue payload was set aside
statusReason: expected 'Need help now? Crisis resources APPEA…' to contain 'damaged piece of the offline queue wa…'

[NoCoverage] ObjectLiteral
src/screens/SettingsScreen.tsx:343:24
       )}
       {legacyQueueRecovery && (
         <View style={[styles.card, { backgroundColor: t.colors.card, borderColor: t.colors.border, borderWidth: 1, borderRadius: t.radius.lg }]} accessibilityRole="alert">
-          <Text style={{ color: t.colors.text, fontSize: t.type.title.fontSize, fontWeight: "700" }}>Older offline entries need recovery</Text>
+          <Text style={{}}>Older offline entries need recovery</Text>
           <Text style={themed.footnote}>

[Killed] ConditionalExpression
src/screens/SettingsScreen.tsx:350:8
         </View>
       )}
 
-      {llmAvailable && (
-        <>
-          <Text style={themed.label}>Third-party AI analysis</Text>
-          <View style={[styles.row, { backgroundColor: t.colors.card, borderRadius: t.radius.md }]}>
-            <Text style={themed.rowText}>
-              Allow sending your (decrypted) entries to an external AI service for pattern analysis.
-              Off by default; needs your password to change.
-            </Text>
-            <Switch
-              value={llmEnabled}
-              disabled={busy}
-              onValueChange={(enabled) => setPending({ kind: "llm", enabled })}
-              trackColor={{ true: t.colors.primaryBright, false: t.colors.cardDeep }}
-              accessibilityLabel="Allow third-party AI analysis"
-              accessibilityState={{ checked: llmEnabled, disabled: busy }}
-            />
-          </View>
-        </>
-      )}
+      {false}
       {pending && (
         <View style={[styles.reauthCard, { backgroundColor: t.colors.cardDeep, borderRadius: t.radius.lg }]}>
killedBy: SettingsScreen chrome loads the stored URL, insecure consent and LLM state on mount
statusReason: expected undefined to be defined

[Killed] LogicalOperator
src/screens/SettingsScreen.tsx:350:8
         </View>
       )}
 
-      {llmAvailable && (
-        <>
-          <Text style={themed.label}>Third-party AI analysis</Text>
-          <View style={[styles.row, { backgroundColor: t.colors.card, borderRadius: t.radius.md }]}>
-            <Text style={themed.rowText}>
-              Allow sending your (decrypted) entries to an external AI service for pattern analysis.
-              Off by default; needs your password to change.
-            </Text>
-            <Switch
-              value={llmEnabled}
-              disabled={busy}
-              onValueChange={(enabled) => setPending({ kind: "llm", enabled })}
-              trackColor={{ true: t.colors.primaryBright, false: t.colors.cardDeep }}
-              accessibilityLabel="Allow third-party AI analysis"
-              accessibilityState={{ checked: llmEnabled, disabled: busy }}
-            />
-          </View>
-        </>
-      )}
+      {llmAvailable || <>
+          <Text style={themed.label}>Third-party AI analysis</Text>
+          <View style={[styles.row, {
+    backgroundColor: t.colors.card,
+    borderRadius: t.radius.md
+  }]}>
+            <Text style={themed.rowText}>
+              Allow sending your (decrypted) entries to an external AI service for pattern analysis.
+              Off by default; needs your password to change.
+            </Text>
+            <Switch value={llmEnabled} disabled={busy} onValueChange={enabled => setPending({
+      kind: "llm",
+      enabled
+    })} trackColor={{
+      true: t.colors.primaryBright,
+      false: t.colors.cardDeep
+    }} accessibilityLabel="Allow third-party AI analysis" accessibilityState={{
+      checked: llmEnabled,
+      disabled: busy
+    }} />
+          </View>
+        </>}
       {pending && (
         <View style={[styles.reauthCard, { backgroundColor: t.colors.cardDeep, borderRadius: t.radius.lg }]}>
killedBy: SettingsScreen chrome loads the stored URL, insecure consent and LLM state on mount
statusReason: expected undefined to be defined

[Killed] ArrayDeclaration
src/screens/SettingsScreen.tsx:353:24
       {llmAvailable && (
         <>
           <Text style={themed.label}>Third-party AI analysis</Text>
-          <View style={[styles.row, { backgroundColor: t.colors.card, borderRadius: t.radius.md }]}>
+          <View style={[]}>
             <Text style={themed.rowText}>
               Allow sending your (decrypted) entries to an external AI service for pattern analysis.
killedBy: SettingsScreen chrome pins the visual language of the screen
statusReason: style not rendered: {"flexDirection":"row","alignItems":"center","gap":12,"padding":14}
rendered styles:
{"flex":1}
{"backgroundColor":"#0f1115","padding":24,"gap":14}
{"padding":16,"alignItems":"center","justifyContent":"center"}
{"backgroundColor":"#242a38","borderRadius":10,"minHeight":44}
{"fontWeight":"700"}
{"color":"#e8eaf0","fontSize":14}

[Killed] ArrowFunction
src/screens/SettingsScreen.tsx:361:30
             <Switch
               value={llmEnabled}
               disabled={busy}
-              onValueChange={(enabled) => setPending({ kind: "llm", enabled })}
+              onValueChange={() => undefined}
               trackColor={{ true: t.colors.primaryBright, false: t.colors.cardDeep }}
               accessibilityLabel="Allow third-party AI analysis"
killedBy: SettingsScreen chrome disables the switch and buttons while the verified consent save is busy, and resets after
statusReason: no TextInput with placeholder "password"

[Killed] ObjectLiteral
src/screens/SettingsScreen.tsx:364:35
               onValueChange={(enabled) => setPending({ kind: "llm", enabled })}
               trackColor={{ true: t.colors.primaryBright, false: t.colors.cardDeep }}
               accessibilityLabel="Allow third-party AI analysis"
-              accessibilityState={{ checked: llmEnabled, disabled: busy }}
+              accessibilityState={{}}
             />
           </View>
killedBy: accessibility labels the LLM switch and reports checked/disabled state
statusReason: expected {} to deeply equal { checked: false, disabled: false }

[Killed] ObjectLiteral
src/screens/SettingsScreen.tsx:371:45
       )}
       {pending && (
         <View style={[styles.reauthCard, { backgroundColor: t.colors.cardDeep, borderRadius: t.radius.lg }]}>
-          <Text style={[styles.reauthTitle, { color: t.colors.text }]}>
+          <Text style={[styles.reauthTitle, {}]}>
             {pending.kind === "delete"
               ? "Enter your password to delete everything"
killedBy: SettingsScreen pins: node-exact style contracts the re-auth card and its title carry their full style arrays
statusReason: expected [ { fontSize: 15, …(2) }, {} ] to deeply equal [ { fontSize: 15, …(2) }, …(1) ]
