[Killed] StringLiteral
src/screens/TherapistShareScreen.tsx:39:44
   const [code, setCode] = useState("");
   const [lookup, setLookup] = useState<PairingLookup | null>(null);
   const [pending, setPending] = useState<PendingAction>(null);
-  const [password, setPassword] = useState("");
+  const [password, setPassword] = useState("Stryker was here!");
   const [busy, setBusy] = useState(false);
   /** Unknown is rendered as unavailable until the server explicitly opts in;
killedBy: guard rails an empty password cannot start the re-auth action
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "Stryker was here!",

[Killed] BooleanLiteral
src/screens/TherapistShareScreen.tsx:40:36
   const [lookup, setLookup] = useState<PairingLookup | null>(null);
   const [pending, setPending] = useState<PendingAction>(null);
   const [password, setPassword] = useState("");
-  const [busy, setBusy] = useState(false);
+  const [busy, setBusy] = useState(true);
   /** Unknown is rendered as unavailable until the server explicitly opts in;
    * that prevents an old/misconfigured server from presenting a pairing flow
killedBy: pairing lookup shows the therapist card on success and resets on cancel
statusReason: no Text node containing "Find my therapist":
Need help now? Crisis resources | Sharing now | You are not sharing with anyone. Your entries stay visible only to you. | Add your therapist | Ask your therapist for a pairing code from their portal, then enter it here. Codes expire after 15 minutes. | Looking up…

[Killed] BlockStatement
src/screens/TherapistShareScreen.tsx:46:37
    * which will only fail later with a confusing 404/403. */
   const [sharingAvailable, setSharingAvailable] = useState<boolean | null>(null);
 
-  const refresh = useCallback(() => {
-    api.meta()
-      .then((meta) => {
-        const enabled = meta?.sharing_available === true;
-        setSharingAvailable(enabled);
-        if (enabled) api.listConsents().then(setConsents).catch(() => setConsents([]));
-        else setConsents([]);
-      })
-      .catch(() => {
-        // Unreachable is UNKNOWN, not a server policy decision: null keeps
-        // the two situations distinct in the copy (and sends nothing).
-        setSharingAvailable(null);
-        setConsents([]);
-      });
-  }, []);
+  const refresh = useCallback(() => {}, []);
   useEffect(refresh, [refresh]);
 
killedBy: consent list fails closed when the server has not enabled verified clinician sharing
statusReason: expected 'Need help now? Crisis resources Can’t…' to contain 'Therapist sharing unavailable'

[Killed] BlockStatement
src/screens/TherapistShareScreen.tsx:48:23
 
   const refresh = useCallback(() => {
     api.meta()
-      .then((meta) => {
-        const enabled = meta?.sharing_available === true;
-        setSharingAvailable(enabled);
-        if (enabled) api.listConsents().then(setConsents).catch(() => setConsents([]));
-        else setConsents([]);
-      })
+      .then((meta) => {})
       .catch(() => {
         // Unreachable is UNKNOWN, not a server policy decision: null keeps
killedBy: consent list fails closed when the server has not enabled verified clinician sharing
statusReason: expected 'Need help now? Crisis resources Can’t…' to contain 'Therapist sharing unavailable'

[Killed] BooleanLiteral
src/screens/TherapistShareScreen.tsx:49:53
   const refresh = useCallback(() => {
     api.meta()
       .then((meta) => {
-        const enabled = meta?.sharing_available === true;
+        const enabled = meta?.sharing_available === false;
         setSharingAvailable(enabled);
         if (enabled) api.listConsents().then(setConsents).catch(() => setConsents([]));
killedBy: consent list fails closed when the server has not enabled verified clinician sharing
statusReason: expected 'Need help now? Crisis resources Shari…' to contain 'Therapist sharing unavailable'

[Killed] ConditionalExpression
src/screens/TherapistShareScreen.tsx:49:25
   const refresh = useCallback(() => {
     api.meta()
       .then((meta) => {
-        const enabled = meta?.sharing_available === true;
+        const enabled = false;
         setSharingAvailable(enabled);
         if (enabled) api.listConsents().then(setConsents).catch(() => setConsents([]));
killedBy: consent list renders the empty state when nothing is shared
statusReason: expected 'Need help now? Crisis resources Thera…' to contain 'You are not sharing with anyone'

[Killed] CallExpression
src/screens/TherapistShareScreen.tsx:50:9
     api.meta()
       .then((meta) => {
         const enabled = meta?.sharing_available === true;
-        setSharingAvailable(enabled);
+        ;
         if (enabled) api.listConsents().then(setConsents).catch(() => setConsents([]));
         else setConsents([]);
killedBy: consent list fails closed when the server has not enabled verified clinician sharing
statusReason: expected 'Need help now? Crisis resources Can’t…' to contain 'Therapist sharing unavailable'

[Killed] ConditionalExpression
src/screens/TherapistShareScreen.tsx:51:13
       .then((meta) => {
         const enabled = meta?.sharing_available === true;
         setSharingAvailable(enabled);
-        if (enabled) api.listConsents().then(setConsents).catch(() => setConsents([]));
+        if (false) api.listConsents().then(setConsents).catch(() => setConsents([]));
         else setConsents([]);
       })
killedBy: consent list renders active and revoked consents; only active ones can be stopped
statusReason: expected 'Need help now? Crisis resources Shari…' to contain 'Dr. Active'

[Killed] ConditionalExpression
src/screens/TherapistShareScreen.tsx:51:13
       .then((meta) => {
         const enabled = meta?.sharing_available === true;
         setSharingAvailable(enabled);
-        if (enabled) api.listConsents().then(setConsents).catch(() => setConsents([]));
+        if (true) api.listConsents().then(setConsents).catch(() => setConsents([]));
         else setConsents([]);
       })
killedBy: consent list fails closed when the server has not enabled verified clinician sharing
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array []

[Survived] BlockStatement
src/screens/TherapistShareScreen.tsx:54:20
         if (enabled) api.listConsents().then(setConsents).catch(() => setConsents([]));
         else setConsents([]);
       })
-      .catch(() => {
-        // Unreachable is UNKNOWN, not a server policy decision: null keeps
-        // the two situations distinct in the copy (and sends nothing).
-        setSharingAvailable(null);
-        setConsents([]);
-      });
+      .catch(() => {});
   }, []);
   useEffect(refresh, [refresh]);

[Survived] CallExpression
src/screens/TherapistShareScreen.tsx:57:9
       .catch(() => {
         // Unreachable is UNKNOWN, not a server policy decision: null keeps
         // the two situations distinct in the copy (and sends nothing).
-        setSharingAvailable(null);
+        ;
         setConsents([]);
       });

[Survived] ArrayDeclaration
src/screens/TherapistShareScreen.tsx:58:21
         // Unreachable is UNKNOWN, not a server policy decision: null keeps
         // the two situations distinct in the copy (and sends nothing).
         setSharingAvailable(null);
-        setConsents([]);
+        setConsents(["Stryker was here"]);
       });
   }, []);

[Killed] BlockStatement
src/screens/TherapistShareScreen.tsx:63:37
   }, []);
   useEffect(refresh, [refresh]);
 
-  const findTherapist = async () => {
-    if (busy || sharingAvailable !== true || !code.trim()) return;
-    setBusy(true);
-    try {
-      const found = await api.pairingLookup(code.trim());
-      setLookup(found);
-    } catch (err) {
-      if (isSessionExpiredError(err)) {
-        Alert.alert("Session expired", "Please unlock again.");
-      } else if (err instanceof ApiError && err.status === 404) {
-        Alert.alert(
-          "Code not found",
-          "Check the code with your therapist — it expires 15 minutes after they generate it.",
-        );
-      } else {
-        // Offline and server errors are NOT "wrong code": blaming the code
-        // (or the therapist) for a dead connection erodes trust.
-        Alert.alert("Couldn’t look up the code", calmFallbackCopy(err, "Something went wrong — try again."));
-      }
-    } finally {
-      setBusy(false);
-    }
-  };
+  const findTherapist = async () => {};
 
   const confirmGrant = () => {
killedBy: pairing lookup shows the therapist card on success and resets on cancel
statusReason: expected 'Need help now? Crisis resources Shari…' to contain 'Dr. Real'

[Killed] EqualityOperator
src/screens/TherapistShareScreen.tsx:64:17
   useEffect(refresh, [refresh]);
 
   const findTherapist = async () => {
-    if (busy || sharingAvailable !== true || !code.trim()) return;
+    if (busy || sharingAvailable === true || !code.trim()) return;
     setBusy(true);
     try {
killedBy: pairing lookup shows the therapist card on success and resets on cancel
statusReason: expected 'Need help now? Crisis resources Shari…' to contain 'Dr. Real'

[Killed] BooleanLiteral
src/screens/TherapistShareScreen.tsx:64:46
   useEffect(refresh, [refresh]);
 
   const findTherapist = async () => {
-    if (busy || sharingAvailable !== true || !code.trim()) return;
+    if (busy || sharingAvailable !== true || code.trim()) return;
     setBusy(true);
     try {
killedBy: pairing lookup shows the therapist card on success and resets on cancel
statusReason: expected 'Need help now? Crisis resources Shari…' to contain 'Dr. Real'

[Killed] BooleanLiteral
src/screens/TherapistShareScreen.tsx:65:13
 
   const findTherapist = async () => {
     if (busy || sharingAvailable !== true || !code.trim()) return;
-    setBusy(true);
+    setBusy(false);
     try {
       const found = await api.pairingLookup(code.trim());
killedBy: guard rails a second lookup press while one is in flight is ignored
statusReason: no Text node containing "Looking up…":
Need help now? Crisis resources | Sharing now | You are not sharing with anyone. Your entries stay visible only to you. | Add your therapist | Ask your therapist for a pairing code from their portal, then enter it here. Codes expire after 15 minutes. | Find my therapist

[Killed] BlockStatement
src/screens/TherapistShareScreen.tsx:66:9
   const findTherapist = async () => {
     if (busy || sharingAvailable !== true || !code.trim()) return;
     setBusy(true);
-    try {
-      const found = await api.pairingLookup(code.trim());
-      setLookup(found);
-    } catch (err) {
+    try {} catch (err) {
       if (isSessionExpiredError(err)) {
         Alert.alert("Session expired", "Please unlock again.");
killedBy: pairing lookup shows the therapist card on success and resets on cancel
statusReason: expected 'Need help now? Crisis resources Shari…' to contain 'Dr. Real'

[Survived] MethodExpression
src/screens/TherapistShareScreen.tsx:67:45
     if (busy || sharingAvailable !== true || !code.trim()) return;
     setBusy(true);
     try {
-      const found = await api.pairingLookup(code.trim());
+      const found = await api.pairingLookup(code);
       setLookup(found);
     } catch (err) {

[Killed] CallExpression
src/screens/TherapistShareScreen.tsx:68:7
     setBusy(true);
     try {
       const found = await api.pairingLookup(code.trim());
-      setLookup(found);
+      ;
     } catch (err) {
       if (isSessionExpiredError(err)) {
killedBy: pairing lookup shows the therapist card on success and resets on cancel
statusReason: expected 'Need help now? Crisis resources Shari…' to contain 'Dr. Real'

[Killed] BlockStatement
src/screens/TherapistShareScreen.tsx:69:19
     try {
       const found = await api.pairingLookup(code.trim());
       setLookup(found);
-    } catch (err) {
-      if (isSessionExpiredError(err)) {
-        Alert.alert("Session expired", "Please unlock again.");
-      } else if (err instanceof ApiError && err.status === 404) {
-        Alert.alert(
-          "Code not found",
-          "Check the code with your therapist — it expires 15 minutes after they generate it.",
-        );
-      } else {
-        // Offline and server errors are NOT "wrong code": blaming the code
-        // (or the therapist) for a dead connection erodes trust.
-        Alert.alert("Couldn’t look up the code", calmFallbackCopy(err, "Something went wrong — try again."));
-      }
-    } finally {
+    } catch (err) {} finally {
       setBusy(false);
     }
killedBy: pairing lookup a dead code explains itself without leaking anything
statusReason: Alert.alert was never called

[Killed] ConditionalExpression
src/screens/TherapistShareScreen.tsx:70:11
       const found = await api.pairingLookup(code.trim());
       setLookup(found);
     } catch (err) {
-      if (isSessionExpiredError(err)) {
+      if (false) {
         Alert.alert("Session expired", "Please unlock again.");
       } else if (err instanceof ApiError && err.status === 404) {
killedBy: pairing lookup an expired session says so
statusReason: expected 'Couldn’t look up the code' to be 'Session expired' // Object.is equality

[Killed] BlockStatement
src/screens/TherapistShareScreen.tsx:70:39
       const found = await api.pairingLookup(code.trim());
       setLookup(found);
     } catch (err) {
-      if (isSessionExpiredError(err)) {
-        Alert.alert("Session expired", "Please unlock again.");
-      } else if (err instanceof ApiError && err.status === 404) {
+      if (isSessionExpiredError(err)) {} else if (err instanceof ApiError && err.status === 404) {
         Alert.alert(
           "Code not found",
killedBy: pairing lookup an expired session says so
statusReason: Alert.alert was never called

[Killed] ConditionalExpression
src/screens/TherapistShareScreen.tsx:72:18
     } catch (err) {
       if (isSessionExpiredError(err)) {
         Alert.alert("Session expired", "Please unlock again.");
-      } else if (err instanceof ApiError && err.status === 404) {
+      } else if (false) {
         Alert.alert(
           "Code not found",
killedBy: pairing lookup a dead code explains itself without leaking anything
statusReason: expected 'Couldn’t look up the code' to be 'Code not found' // Object.is equality

[Killed] EqualityOperator
src/screens/TherapistShareScreen.tsx:72:45
     } catch (err) {
       if (isSessionExpiredError(err)) {
         Alert.alert("Session expired", "Please unlock again.");
-      } else if (err instanceof ApiError && err.status === 404) {
+      } else if (err instanceof ApiError && err.status !== 404) {
         Alert.alert(
           "Code not found",
killedBy: pairing lookup a dead code explains itself without leaking anything
statusReason: expected 'Couldn’t look up the code' to be 'Code not found' // Object.is equality

[Killed] StringLiteral
src/screens/TherapistShareScreen.tsx:74:11
         Alert.alert("Session expired", "Please unlock again.");
       } else if (err instanceof ApiError && err.status === 404) {
         Alert.alert(
-          "Code not found",
+          "",
           "Check the code with your therapist — it expires 15 minutes after they generate it.",
         );
killedBy: pairing lookup a dead code explains itself without leaking anything
statusReason: expected '' to be 'Code not found' // Object.is equality

[NoCoverage] BlockStatement
src/screens/TherapistShareScreen.tsx:77:14
           "Code not found",
           "Check the code with your therapist — it expires 15 minutes after they generate it.",
         );
-      } else {
-        // Offline and server errors are NOT "wrong code": blaming the code
-        // (or the therapist) for a dead connection erodes trust.
-        Alert.alert("Couldn’t look up the code", calmFallbackCopy(err, "Something went wrong — try again."));
-      }
+      } else {}
     } finally {
       setBusy(false);

[Killed] BlockStatement
src/screens/TherapistShareScreen.tsx:82:15
         // (or the therapist) for a dead connection erodes trust.
         Alert.alert("Couldn’t look up the code", calmFallbackCopy(err, "Something went wrong — try again."));
       }
-    } finally {
-      setBusy(false);
-    }
+    } finally {}
   };
 
killedBy: grant wraps the vault data key and grants after password re-auth
statusReason: no Text node containing "Confirm with password":
Need help now? Crisis resources | Sharing now | You are not sharing with anyone. Your entries stay visible only to you. | Enter your password to share with Dr. Real | Verifying… | Cancel

[Killed] BlockStatement
src/screens/TherapistShareScreen.tsx:87:30
     }
   };
 
-  const confirmGrant = () => {
-    if (!lookup) return;
-    Alert.alert(
-      `Share with ${lookup.display_name}?`,
-      "They will be able to read every journal entry and every pattern computed from them, " +
-        "from their therapist portal. They cannot change or delete anything — only read, and " +
-        "write their own private notes.\n\n" +
-        "You can stop sharing at any time; that ends their access immediately, but it cannot " +
-        "unread what they have already seen. You will be asked for your password.",
-      [
-        { text: "Cancel", style: "cancel" },
-        {
-          text: "Continue to password",
-          style: "destructive",
-          onPress: () => setPending({ kind: "grant", code: code.trim(), lookup }),
-        },
-      ],
-    );
-  };
+  const confirmGrant = () => {};
 
   const askRevoke = (consent: ListedConsent) => {
killedBy: grant wraps the vault data key and grants after password re-auth
statusReason: Alert.alert was never called

[Killed] BooleanLiteral
src/screens/TherapistShareScreen.tsx:88:9
   };
 
   const confirmGrant = () => {
-    if (!lookup) return;
+    if (lookup) return;
     Alert.alert(
       `Share with ${lookup.display_name}?`,
killedBy: grant wraps the vault data key and grants after password re-auth
statusReason: Alert.alert was never called

[Killed] ConditionalExpression
src/screens/TherapistShareScreen.tsx:88:9
   };
 
   const confirmGrant = () => {
-    if (!lookup) return;
+    if (true) return;
     Alert.alert(
       `Share with ${lookup.display_name}?`,
killedBy: grant wraps the vault data key and grants after password re-auth
statusReason: Alert.alert was never called

[Survived] StringLiteral
src/screens/TherapistShareScreen.tsx:91:7
     if (!lookup) return;
     Alert.alert(
       `Share with ${lookup.display_name}?`,
-      "They will be able to read every journal entry and every pattern computed from them, " +
+      "" +
         "from their therapist portal. They cannot change or delete anything — only read, and " +
         "write their own private notes.\n\n" +

[Survived] StringLiteral
src/screens/TherapistShareScreen.tsx:94:9
       "They will be able to read every journal entry and every pattern computed from them, " +
         "from their therapist portal. They cannot change or delete anything — only read, and " +
         "write their own private notes.\n\n" +
-        "You can stop sharing at any time; that ends their access immediately, but it cannot " +
+        "" +
         "unread what they have already seen. You will be asked for your password.",
       [

[Survived] StringLiteral
src/screens/TherapistShareScreen.tsx:95:9
         "from their therapist portal. They cannot change or delete anything — only read, and " +
         "write their own private notes.\n\n" +
         "You can stop sharing at any time; that ends their access immediately, but it cannot " +
-        "unread what they have already seen. You will be asked for your password.",
+        "",
       [
         { text: "Cancel", style: "cancel" },

[Survived] StringLiteral
src/screens/TherapistShareScreen.tsx:100:18
         { text: "Cancel", style: "cancel" },
         {
           text: "Continue to password",
-          style: "destructive",
+          style: "",
           onPress: () => setPending({ kind: "grant", code: code.trim(), lookup }),
         },

[Killed] ArrowFunction
src/screens/TherapistShareScreen.tsx:101:20
         {
           text: "Continue to password",
           style: "destructive",
-          onPress: () => setPending({ kind: "grant", code: code.trim(), lookup }),
+          onPress: () => undefined,
         },
       ],
killedBy: grant wraps the vault data key and grants after password re-auth
statusReason: no TextInput with placeholder "password"

[Survived] MethodExpression
src/screens/TherapistShareScreen.tsx:101:60
         {
           text: "Continue to password",
           style: "destructive",
-          onPress: () => setPending({ kind: "grant", code: code.trim(), lookup }),
+          onPress: () => setPending({ kind: "grant", code: code, lookup }),
         },
       ],

[Killed] BlockStatement
src/screens/TherapistShareScreen.tsx:107:49
     );
   };
 
-  const askRevoke = (consent: ListedConsent) => {
-    if (busy) return;
-    Alert.alert(
-      `Stop sharing with ${consent.display_name}?`,
-      "Their access ends immediately. They keep anything they have already read. " +
-        "You will be asked for your password.",
-      [
-        { text: "Cancel", style: "cancel" },
-        {
-          text: "Stop sharing",
-          style: "destructive",
-          onPress: () => setPending({ kind: "revoke", consentId: consent.id }),
-        },
-      ],
-    );
-  };
+  const askRevoke = (consent: ListedConsent) => {};
 
   /** Both flows land here: the action only runs after the typed password
killedBy: revoke stops sharing after password re-auth
statusReason: Alert.alert was never called

[Killed] ConditionalExpression
src/screens/TherapistShareScreen.tsx:108:9
   };
 
   const askRevoke = (consent: ListedConsent) => {
-    if (busy) return;
+    if (true) return;
     Alert.alert(
       `Stop sharing with ${consent.display_name}?`,
killedBy: revoke stops sharing after password re-auth
statusReason: Alert.alert was never called

[Killed] ConditionalExpression
src/screens/TherapistShareScreen.tsx:108:9
   };
 
   const askRevoke = (consent: ListedConsent) => {
-    if (busy) return;
+    if (false) return;
     Alert.alert(
       `Stop sharing with ${consent.display_name}?`,
killedBy: guard rails a second confirm press while verifying is ignored, and revoke is blocked while busy
statusReason: expected 'Stop sharing with Dr. Active?' not to be 'Stop sharing with Dr. Active?' // Object.is equality

[Killed] StringLiteral
src/screens/TherapistShareScreen.tsx:110:7
   const askRevoke = (consent: ListedConsent) => {
     if (busy) return;
     Alert.alert(
-      `Stop sharing with ${consent.display_name}?`,
+      ``,
       "Their access ends immediately. They keep anything they have already read. " +
         "You will be asked for your password.",
killedBy: revoke stops sharing after password re-auth
statusReason: expected '' to be 'Stop sharing with Dr. Active?' // Object.is equality

[Killed] ArrayDeclaration
src/screens/TherapistShareScreen.tsx:113:7
       `Stop sharing with ${consent.display_name}?`,
       "Their access ends immediately. They keep anything they have already read. " +
         "You will be asked for your password.",
-      [
-        { text: "Cancel", style: "cancel" },
-        {
-          text: "Stop sharing",
-          style: "destructive",
-          onPress: () => setPending({ kind: "revoke", consentId: consent.id }),
-        },
-      ],
+      [],
     );
   };
killedBy: revoke stops sharing after password re-auth
statusReason: no alert button "Stop sharing"; buttons: []

[Killed] ObjectLiteral
src/screens/TherapistShareScreen.tsx:115:9
         "You will be asked for your password.",
       [
         { text: "Cancel", style: "cancel" },
-        {
-          text: "Stop sharing",
-          style: "destructive",
-          onPress: () => setPending({ kind: "revoke", consentId: consent.id }),
-        },
+        {},
       ],
     );
killedBy: revoke stops sharing after password re-auth
statusReason: no alert button "Stop sharing"; buttons: [{"text":"Cancel","style":"cancel"},{}]

[Killed] StringLiteral
src/screens/TherapistShareScreen.tsx:116:17
       [
         { text: "Cancel", style: "cancel" },
         {
-          text: "Stop sharing",
+          text: "",
           style: "destructive",
           onPress: () => setPending({ kind: "revoke", consentId: consent.id }),
killedBy: revoke stops sharing after password re-auth
statusReason: no alert button "Stop sharing"; buttons: [{"text":"Cancel","style":"cancel"},{"text":"","style":"destructive"}]

[Killed] ArrowFunction
src/screens/TherapistShareScreen.tsx:118:20
         {
           text: "Stop sharing",
           style: "destructive",
-          onPress: () => setPending({ kind: "revoke", consentId: consent.id }),
+          onPress: () => undefined,
         },
       ],
killedBy: revoke stops sharing after password re-auth
statusReason: expected 'Need help now? Crisis resources Shari…' to contain 'Enter your password to stop sharing'

[Killed] BooleanLiteral
src/screens/TherapistShareScreen.tsx:127:29
   /** Both flows land here: the action only runs after the typed password
    *  re-derives the vault's own auth key (the reauth.ts contract). */
   const confirmWithPassword = async () => {
-    if (!pending || busy || !password) return;
+    if (!pending || busy || password) return;
     setBusy(true);
     const done = () => { setBusy(false); setPending(null); setPassword(""); setLookup(null); setCode(""); };
killedBy: grant wraps the vault data key and grants after password re-auth
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/screens/TherapistShareScreen.tsx:129:24
   const confirmWithPassword = async () => {
     if (!pending || busy || !password) return;
     setBusy(true);
-    const done = () => { setBusy(false); setPending(null); setPassword(""); setLookup(null); setCode(""); };
+    const done = () => {};
     const retry = () => { setBusy(false); setPassword(""); };
     try {
killedBy: grant an ordinary failure ends the flow honestly
statusReason: expected 'Need help now? Crisis resources Shari…' not to contain 'Enter your password to share'

[Killed] CallExpression
src/screens/TherapistShareScreen.tsx:129:42
   const confirmWithPassword = async () => {
     if (!pending || busy || !password) return;
     setBusy(true);
-    const done = () => { setBusy(false); setPending(null); setPassword(""); setLookup(null); setCode(""); };
+    const done = () => { setBusy(false); ; setPassword(""); setLookup(null); setCode(""); };
     const retry = () => { setBusy(false); setPassword(""); };
     try {
killedBy: grant an ordinary failure ends the flow honestly
statusReason: expected 'Need help now? Crisis resources Shari…' not to contain 'Enter your password to share'

[Survived] BooleanLiteral
src/screens/TherapistShareScreen.tsx:130:35
     if (!pending || busy || !password) return;
     setBusy(true);
     const done = () => { setBusy(false); setPending(null); setPassword(""); setLookup(null); setCode(""); };
-    const retry = () => { setBusy(false); setPassword(""); };
+    const retry = () => { setBusy(true); setPassword(""); };
     try {
       const reauth = await verifyPasswordForVault(password);

[Survived] BlockStatement
src/screens/TherapistShareScreen.tsx:130:25
     if (!pending || busy || !password) return;
     setBusy(true);
     const done = () => { setBusy(false); setPending(null); setPassword(""); setLookup(null); setCode(""); };
-    const retry = () => { setBusy(false); setPassword(""); };
+    const retry = () => {};
     try {
       const reauth = await verifyPasswordForVault(password);

[Killed] ConditionalExpression
src/screens/TherapistShareScreen.tsx:133:11
     const retry = () => { setBusy(false); setPassword(""); };
     try {
       const reauth = await verifyPasswordForVault(password);
-      if (!reauth.ok) {
+      if (false) {
         const messages = {
           locked: "The vault is locked — unlock again first.",
killedBy: grant a wrong password keeps the card up for retry
statusReason: expected 'Sharing started' to be 'Could not verify' // Object.is equality

[Killed] ConditionalExpression
src/screens/TherapistShareScreen.tsx:144:11
         retry();
         return;
       }
-      if (pending.kind === "grant") {
+      if (true) {
         const userId = await api.getUserId();
         if (!userId) throw new Error("no saved account on this device");
killedBy: revoke stops sharing after password re-auth
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] BlockStatement
src/screens/TherapistShareScreen.tsx:144:37
         retry();
         return;
       }
-      if (pending.kind === "grant") {
-        const userId = await api.getUserId();
-        if (!userId) throw new Error("no saved account on this device");
-        // The data key leaves the device exactly once: inside this wrap.
-        const wrap = wrapDataKeyForTherapist(
-          vault.get().dataKey,
-          pending.lookup.wrap_pub_key,
-          userId,
-          pending.lookup.therapist_id,
-        );
-        await api.grantConsent(pending.code, wrap.ephemeralPubB64, wrap.wrappedKeyB64, reauth.verifierB64);
-        Alert.alert(
-          "Sharing started",
-          `${pending.lookup.display_name} can now read your entries and patterns from their portal.`,
-        );
-      } else {
+      if (pending.kind === "grant") {} else {
         await api.revokeConsent(pending.consentId, reauth.verifierB64);
         Alert.alert("Sharing stopped", "Their access has ended.");
killedBy: grant wraps the vault data key and grants after password re-auth
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times
