[Killed] ConditionalExpression
src/screens/TherapistShareScreen.tsx:146:13
       }
       if (pending.kind === "grant") {
         const userId = await api.getUserId();
-        if (!userId) throw new Error("no saved account on this device");
+        if (true) throw new Error("no saved account on this device");
         // The data key leaves the device exactly once: inside this wrap.
         const wrap = wrapDataKeyForTherapist(
killedBy: grant wraps the vault data key and grants after password re-auth
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
src/screens/TherapistShareScreen.tsx:146:13
       }
       if (pending.kind === "grant") {
         const userId = await api.getUserId();
-        if (!userId) throw new Error("no saved account on this device");
+        if (userId) throw new Error("no saved account on this device");
         // The data key leaves the device exactly once: inside this wrap.
         const wrap = wrapDataKeyForTherapist(
killedBy: grant wraps the vault data key and grants after password re-auth
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/screens/TherapistShareScreen.tsx:159:14
           "Sharing started",
           `${pending.lookup.display_name} can now read your entries and patterns from their portal.`,
         );
-      } else {
-        await api.revokeConsent(pending.consentId, reauth.verifierB64);
-        Alert.alert("Sharing stopped", "Their access has ended.");
-      }
+      } else {}
       refresh();
       done();
killedBy: revoke stops sharing after password re-auth
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] StringLiteral
src/screens/TherapistShareScreen.tsx:161:21
         );
       } else {
         await api.revokeConsent(pending.consentId, reauth.verifierB64);
-        Alert.alert("Sharing stopped", "Their access has ended.");
+        Alert.alert("", "Their access has ended.");
       }
       refresh();
killedBy: revoke stops sharing after password re-auth
statusReason: expected '' to be 'Sharing stopped' // Object.is equality

[Survived] StringLiteral
src/screens/TherapistShareScreen.tsx:161:40
         );
       } else {
         await api.revokeConsent(pending.consentId, reauth.verifierB64);
-        Alert.alert("Sharing stopped", "Their access has ended.");
+        Alert.alert("Sharing stopped", "");
       }
       refresh();

[Killed] CallExpression
src/screens/TherapistShareScreen.tsx:163:7
         await api.revokeConsent(pending.consentId, reauth.verifierB64);
         Alert.alert("Sharing stopped", "Their access has ended.");
       }
-      refresh();
+      ;
       done();
     } catch (err) {
killedBy: grant wraps the vault data key and grants after password re-auth
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Survived] CallExpression
src/screens/TherapistShareScreen.tsx:164:7
         Alert.alert("Sharing stopped", "Their access has ended.");
       }
       refresh();
-      done();
+      ;
     } catch (err) {
       if (isVerificationFailedError(err)) {

[Killed] BlockStatement
src/screens/TherapistShareScreen.tsx:165:19
       }
       refresh();
       done();
-    } catch (err) {
-      if (isVerificationFailedError(err)) {
-        Alert.alert("That password didn't match", "Check it and try again — nothing was changed.");
-        retry();
-        return;
-      }
-      if (isSessionExpiredError(err)) {
-        Alert.alert("Session expired", "Please unlock again.");
-      } else {
-        Alert.alert("Could not complete", calmFallbackCopy(err, "Something went wrong — try again."));
-      }
-      done();
-    }
+    } catch (err) {}
   };
 
killedBy: grant a server-side verifier rejection (403) stays retryable
statusReason: expected 'Share with Dr. Real?' to be 'That password didn\'t match' // Object.is equality

[Killed] ConditionalExpression
src/screens/TherapistShareScreen.tsx:166:11
       refresh();
       done();
     } catch (err) {
-      if (isVerificationFailedError(err)) {
+      if (true) {
         Alert.alert("That password didn't match", "Check it and try again — nothing was changed.");
         retry();
killedBy: grant an ordinary failure ends the flow honestly
statusReason: expected 'That password didn\'t match' to be 'Could not complete' // Object.is equality

[Killed] BlockStatement
src/screens/TherapistShareScreen.tsx:171:39
         retry();
         return;
       }
-      if (isSessionExpiredError(err)) {
-        Alert.alert("Session expired", "Please unlock again.");
-      } else {
+      if (isSessionExpiredError(err)) {} else {
         Alert.alert("Could not complete", calmFallbackCopy(err, "Something went wrong — try again."));
       }
killedBy: revoke an expired session during revoke says so
statusReason: expected 'Stop sharing with Dr. Active?' to be 'Session expired' // Object.is equality

[Killed] ConditionalExpression
src/screens/TherapistShareScreen.tsx:171:11
         retry();
         return;
       }
-      if (isSessionExpiredError(err)) {
+      if (true) {
         Alert.alert("Session expired", "Please unlock again.");
       } else {
killedBy: grant an ordinary failure ends the flow honestly
statusReason: expected 'Session expired' to be 'Could not complete' // Object.is equality

[Killed] StringLiteral
src/screens/TherapistShareScreen.tsx:172:21
         return;
       }
       if (isSessionExpiredError(err)) {
-        Alert.alert("Session expired", "Please unlock again.");
+        Alert.alert("", "Please unlock again.");
       } else {
         Alert.alert("Could not complete", calmFallbackCopy(err, "Something went wrong — try again."));
killedBy: revoke an expired session during revoke says so
statusReason: expected '' to be 'Session expired' // Object.is equality

[Survived] StringLiteral
src/screens/TherapistShareScreen.tsx:172:40
         return;
       }
       if (isSessionExpiredError(err)) {
-        Alert.alert("Session expired", "Please unlock again.");
+        Alert.alert("Session expired", "");
       } else {
         Alert.alert("Could not complete", calmFallbackCopy(err, "Something went wrong — try again."));

[Killed] StringLiteral
src/screens/TherapistShareScreen.tsx:174:21
       if (isSessionExpiredError(err)) {
         Alert.alert("Session expired", "Please unlock again.");
       } else {
-        Alert.alert("Could not complete", calmFallbackCopy(err, "Something went wrong — try again."));
+        Alert.alert("", calmFallbackCopy(err, "Something went wrong — try again."));
       }
       done();
killedBy: grant an ordinary failure ends the flow honestly
statusReason: expected '' to be 'Could not complete' // Object.is equality

[Survived] ObjectLiteral
src/screens/TherapistShareScreen.tsx:180:18
     }
   };
 
-  const themed = {
-    label: { color: t.colors.muted, fontSize: 12, fontWeight: "700" as const, letterSpacing: 1, marginTop: 8 },
-    input: {
-      backgroundColor: t.colors.card,
-      color: t.colors.text,
-      borderRadius: t.radius.md,
-      padding: 14,
-      fontSize: 15,
-    },
-    rowText: { color: t.colors.body, fontSize: 13, flex: 1, lineHeight: 18 },
-    footnote: { color: t.colors.muted, fontSize: 12, lineHeight: 18 },
-  };
+  const themed = {};
 
   return (

[Survived] ObjectLiteral
src/screens/TherapistShareScreen.tsx:189:14
       padding: 14,
       fontSize: 15,
     },
-    rowText: { color: t.colors.body, fontSize: 13, flex: 1, lineHeight: 18 },
+    rowText: {},
     footnote: { color: t.colors.muted, fontSize: 12, lineHeight: 18 },
   };

[Survived] ObjectLiteral
src/screens/TherapistShareScreen.tsx:196:30
   return (
     <ScrollView
       style={[styles.container, { backgroundColor: t.colors.bg, padding: t.spacing.xxl, gap: 14 }]}
-      contentContainerStyle={{ paddingBottom: t.spacing.xxxl }}
+      contentContainerStyle={{}}
     >
       <CrisisHelpButton onPress={() => navigation.navigate("Crisis")} />

[Killed] ArrowFunction
src/screens/TherapistShareScreen.tsx:198:34
       style={[styles.container, { backgroundColor: t.colors.bg, padding: t.spacing.xxl, gap: 14 }]}
       contentContainerStyle={{ paddingBottom: t.spacing.xxxl }}
     >
-      <CrisisHelpButton onPress={() => navigation.navigate("Crisis")} />
+      <CrisisHelpButton onPress={() => undefined} />
 
       {sharingAvailable === false && (
killedBy: cancel paths crisis help stays one tap away
statusReason: expected "vi.fn()" to be called with arguments: [ 'Crisis' ]

Number of calls: 0

[Killed] StringLiteral
src/screens/TherapistShareScreen.tsx:198:60
       style={[styles.container, { backgroundColor: t.colors.bg, padding: t.spacing.xxl, gap: 14 }]}
       contentContainerStyle={{ paddingBottom: t.spacing.xxxl }}
     >
-      <CrisisHelpButton onPress={() => navigation.navigate("Crisis")} />
+      <CrisisHelpButton onPress={() => navigation.navigate("")} />
 
       {sharingAvailable === false && (
killedBy: cancel paths crisis help stays one tap away
statusReason: expected "vi.fn()" to be called with arguments: [ 'Crisis' ]

Received:

  1st vi.fn() call:

  [
-   "Crisis",

[Killed] ConditionalExpression
src/screens/TherapistShareScreen.tsx:200:8
     >
       <CrisisHelpButton onPress={() => navigation.navigate("Crisis")} />
 
-      {sharingAvailable === false && (
-        <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]} accessibilityRole="alert">
-          <Text style={[styles.cardTitle, { color: t.colors.text }]}>Therapist sharing unavailable</Text>
-          <Text style={themed.footnote}>
-            This server has not enabled verified clinician sharing. No pairing code or journal data will be sent.
-          </Text>
-          <GhostButton label="Back" center={false} onPress={() => navigation.goBack?.()} />
-        </View>
-      )}
+      {false}
 
       {sharingAvailable === null && (
killedBy: consent list fails closed when the server has not enabled verified clinician sharing
statusReason: expected 'Need help now? Crisis resources' to contain 'Therapist sharing unavailable'

[Killed] BooleanLiteral
src/screens/TherapistShareScreen.tsx:200:29
     >
       <CrisisHelpButton onPress={() => navigation.navigate("Crisis")} />
 
-      {sharingAvailable === false && (
+      {sharingAvailable === true && (
         <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]} accessibilityRole="alert">
           <Text style={[styles.cardTitle, { color: t.colors.text }]}>Therapist sharing unavailable</Text>
killedBy: consent list fails closed when the server has not enabled verified clinician sharing
statusReason: expected 'Need help now? Crisis resources' to contain 'Therapist sharing unavailable'

[Survived] ArrayDeclaration
src/screens/TherapistShareScreen.tsx:201:22
       <CrisisHelpButton onPress={() => navigation.navigate("Crisis")} />
 
       {sharingAvailable === false && (
-        <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]} accessibilityRole="alert">
+        <View style={[]} accessibilityRole="alert">
           <Text style={[styles.cardTitle, { color: t.colors.text }]}>Therapist sharing unavailable</Text>
           <Text style={themed.footnote}>

[Survived] ObjectLiteral
src/screens/TherapistShareScreen.tsx:201:36
       <CrisisHelpButton onPress={() => navigation.navigate("Crisis")} />
 
       {sharingAvailable === false && (
-        <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]} accessibilityRole="alert">
+        <View style={[styles.card, {}]} accessibilityRole="alert">
           <Text style={[styles.cardTitle, { color: t.colors.text }]}>Therapist sharing unavailable</Text>
           <Text style={themed.footnote}>

[Survived] ArrowFunction
src/screens/TherapistShareScreen.tsx:206:61
           <Text style={themed.footnote}>
             This server has not enabled verified clinician sharing. No pairing code or journal data will be sent.
           </Text>
-          <GhostButton label="Back" center={false} onPress={() => navigation.goBack?.()} />
+          <GhostButton label="Back" center={false} onPress={() => undefined} />
         </View>
       )}

[NoCoverage] OptionalChaining
src/screens/TherapistShareScreen.tsx:206:67
           <Text style={themed.footnote}>
             This server has not enabled verified clinician sharing. No pairing code or journal data will be sent.
           </Text>
-          <GhostButton label="Back" center={false} onPress={() => navigation.goBack?.()} />
+          <GhostButton label="Back" center={false} onPress={() => navigation.goBack()} />
         </View>
       )}

[Killed] LogicalOperator
src/screens/TherapistShareScreen.tsx:210:8
         </View>
       )}
 
-      {sharingAvailable === null && (
-        <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]} accessibilityRole="alert">
-          <Text style={[styles.cardTitle, { color: t.colors.text }]}>Can’t reach the server</Text>
-          <Text style={themed.footnote}>
-            Sharing availability could not be confirmed — check your connection and try again. No pairing code or journal data is sent until it is.
-          </Text>
-          <GhostButton label="Back" center={false} onPress={() => navigation.goBack?.()} />
-        </View>
-      )}
+      {sharingAvailable === null || <View style={[styles.card, {
+  backgroundColor: t.colors.card,
+  borderRadius: t.radius.lg
+}]} accessibilityRole="alert">
+          <Text style={[styles.cardTitle, {
+    color: t.colors.text
+  }]}>Can’t reach the server</Text>
+          <Text style={themed.footnote}>
+            Sharing availability could not be confirmed — check your connection and try again. No pairing code or journal data is sent until it is.
+          </Text>
+          <GhostButton label="Back" center={false} onPress={() => navigation.goBack?.()} />
+        </View>}
 
       {sharingAvailable === true && <Text style={themed.label}>Sharing now</Text>}
killedBy: availability gate copy explains honestly when the server cannot be reached (nothing sent)
statusReason: expected 'Need help now? Crisis resources' to contain 'Can’t reach the server'

[Killed] ConditionalExpression
src/screens/TherapistShareScreen.tsx:210:8
         </View>
       )}
 
-      {sharingAvailable === null && (
-        <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]} accessibilityRole="alert">
-          <Text style={[styles.cardTitle, { color: t.colors.text }]}>Can’t reach the server</Text>
-          <Text style={themed.footnote}>
-            Sharing availability could not be confirmed — check your connection and try again. No pairing code or journal data is sent until it is.
-          </Text>
-          <GhostButton label="Back" center={false} onPress={() => navigation.goBack?.()} />
-        </View>
-      )}
+      {false}
 
       {sharingAvailable === true && <Text style={themed.label}>Sharing now</Text>}
killedBy: availability gate copy explains honestly when the server cannot be reached (nothing sent)
statusReason: expected 'Need help now? Crisis resources' to contain 'Can’t reach the server'

[Survived] ArrayDeclaration
src/screens/TherapistShareScreen.tsx:211:22
       )}
 
       {sharingAvailable === null && (
-        <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]} accessibilityRole="alert">
+        <View style={[]} accessibilityRole="alert">
           <Text style={[styles.cardTitle, { color: t.colors.text }]}>Can’t reach the server</Text>
           <Text style={themed.footnote}>

[Survived] BooleanLiteral
src/screens/TherapistShareScreen.tsx:216:45
           <Text style={themed.footnote}>
             Sharing availability could not be confirmed — check your connection and try again. No pairing code or journal data is sent until it is.
           </Text>
-          <GhostButton label="Back" center={false} onPress={() => navigation.goBack?.()} />
+          <GhostButton label="Back" center={true} onPress={() => navigation.goBack?.()} />
         </View>
       )}

[Survived] LogicalOperator
src/screens/TherapistShareScreen.tsx:220:8
         </View>
       )}
 
-      {sharingAvailable === true && <Text style={themed.label}>Sharing now</Text>}
+      {sharingAvailable === true || <Text style={themed.label}>Sharing now</Text>}
       {sharingAvailable === true && consents.length === 0 && (
         <Text style={themed.footnote}>

[Survived] ConditionalExpression
src/screens/TherapistShareScreen.tsx:220:8
         </View>
       )}
 
-      {sharingAvailable === true && <Text style={themed.label}>Sharing now</Text>}
+      {true}
       {sharingAvailable === true && consents.length === 0 && (
         <Text style={themed.footnote}>

[Killed] BooleanLiteral
src/screens/TherapistShareScreen.tsx:221:29
       )}
 
       {sharingAvailable === true && <Text style={themed.label}>Sharing now</Text>}
-      {sharingAvailable === true && consents.length === 0 && (
+      {sharingAvailable === false && consents.length === 0 && (
         <Text style={themed.footnote}>
           You are not sharing with anyone. Your entries stay visible only to you.
killedBy: consent list renders the empty state when nothing is shared
statusReason: expected 'Need help now? Crisis resources Shari…' to contain 'You are not sharing with anyone'

[Killed] ConditionalExpression
src/screens/TherapistShareScreen.tsx:221:8
       )}
 
       {sharingAvailable === true && <Text style={themed.label}>Sharing now</Text>}
-      {sharingAvailable === true && consents.length === 0 && (
-        <Text style={themed.footnote}>
-          You are not sharing with anyone. Your entries stay visible only to you.
-        </Text>
-      )}
+      {false}
       {sharingAvailable === true && consents.map((consent) => (
         <View
killedBy: consent list renders the empty state when nothing is shared
statusReason: expected 'Need help now? Crisis resources Shari…' to contain 'You are not sharing with anyone'

[Killed] EqualityOperator
src/screens/TherapistShareScreen.tsx:226:8
           You are not sharing with anyone. Your entries stay visible only to you.
         </Text>
       )}
-      {sharingAvailable === true && consents.map((consent) => (
+      {sharingAvailable !== true && consents.map((consent) => (
         <View
           key={consent.id}
killedBy: consent list renders active and revoked consents; only active ones can be stopped
statusReason: expected 'Need help now? Crisis resources Shari…' to contain 'Dr. Active'

[Killed] ConditionalExpression
src/screens/TherapistShareScreen.tsx:226:8
           You are not sharing with anyone. Your entries stay visible only to you.
         </Text>
       )}
-      {sharingAvailable === true && consents.map((consent) => (
-        <View
-          key={consent.id}
-          style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}
-        >
-          <Text style={themed.rowText}>
-            {consent.display_name}{"\n"}
-            <Text style={themed.footnote}>
-              {consent.status === "active"
-                ? `Sharing since ${dayOf(consent.granted_at)}`
-                : `Stopped ${consent.revoked_at ? dayOf(consent.revoked_at) : ""}`}
-            </Text>
-          </Text>
-          {consent.status === "active" && (
-            <GhostButton
-              label="Stop sharing"
-              center={false}
-              disabled={busy}
-              onPress={() => askRevoke(consent)}
-            />
-          )}
-        </View>
-      ))}
+      {false}
 
       {sharingAvailable === true && !lookup && (
killedBy: consent list renders active and revoked consents; only active ones can be stopped
statusReason: expected 'Need help now? Crisis resources Shari…' to contain 'Dr. Active'

[Survived] ObjectLiteral
src/screens/TherapistShareScreen.tsx:229:32
       {sharingAvailable === true && consents.map((consent) => (
         <View
           key={consent.id}
-          style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}
+          style={[styles.card, {}]}
         >
           <Text style={themed.rowText}>

[Killed] ConditionalExpression
src/screens/TherapistShareScreen.tsx:234:16
           <Text style={themed.rowText}>
             {consent.display_name}{"\n"}
             <Text style={themed.footnote}>
-              {consent.status === "active"
+              {true
                 ? `Sharing since ${dayOf(consent.granted_at)}`
                 : `Stopped ${consent.revoked_at ? dayOf(consent.revoked_at) : ""}`}
killedBy: consent list renders active and revoked consents; only active ones can be stopped
statusReason: expected 'Need help now? Crisis resources Shari…' to contain 'Stopped 2026-09-10'

[Killed] ConditionalExpression
src/screens/TherapistShareScreen.tsx:234:16
           <Text style={themed.rowText}>
             {consent.display_name}{"\n"}
             <Text style={themed.footnote}>
-              {consent.status === "active"
+              {false
                 ? `Sharing since ${dayOf(consent.granted_at)}`
                 : `Stopped ${consent.revoked_at ? dayOf(consent.revoked_at) : ""}`}
killedBy: consent list renders active and revoked consents; only active ones can be stopped
statusReason: expected 'Need help now? Crisis resources Shari…' to contain 'Sharing since 2026-09-01'

[Killed] StringLiteral
src/screens/TherapistShareScreen.tsx:236:19
             <Text style={themed.footnote}>
               {consent.status === "active"
                 ? `Sharing since ${dayOf(consent.granted_at)}`
-                : `Stopped ${consent.revoked_at ? dayOf(consent.revoked_at) : ""}`}
+                : ``}
             </Text>
           </Text>
killedBy: consent list renders active and revoked consents; only active ones can be stopped
statusReason: expected 'Need help now? Crisis resources Shari…' to contain 'Stopped 2026-09-10'

[Killed] ConditionalExpression
src/screens/TherapistShareScreen.tsx:239:12
                 : `Stopped ${consent.revoked_at ? dayOf(consent.revoked_at) : ""}`}
             </Text>
           </Text>
-          {consent.status === "active" && (
-            <GhostButton
-              label="Stop sharing"
-              center={false}
-              disabled={busy}
-              onPress={() => askRevoke(consent)}
-            />
-          )}
+          {true}
         </View>
       ))}
killedBy: consent list renders active and revoked consents; only active ones can be stopped
statusReason: no Text node containing "Stop sharing":
Need help now? Crisis resources | Sharing now | Dr. Active
Sharing since 2026-09-01 | Sharing since 2026-09-01 | Dr. Past
Stopped 2026-09-10 | Stopped 2026-09-10 | Add your therapist | Ask your therapist for a pairing code from their portal, then enter it here. Codes expire after 15 minutes. | Find my therapist

[Killed] ConditionalExpression
src/screens/TherapistShareScreen.tsx:239:12
                 : `Stopped ${consent.revoked_at ? dayOf(consent.revoked_at) : ""}`}
             </Text>
           </Text>
-          {consent.status === "active" && (
+          {true && (
             <GhostButton
               label="Stop sharing"
killedBy: guard rails a revoked consent without a timestamp renders an honest stopped line
statusReason: expected [Function] to throw an error

[Survived] BooleanLiteral
src/screens/TherapistShareScreen.tsx:242:23
           {consent.status === "active" && (
             <GhostButton
               label="Stop sharing"
-              center={false}
+              center={true}
               disabled={busy}
               onPress={() => askRevoke(consent)}

[Killed] ArrowFunction
src/screens/TherapistShareScreen.tsx:244:24
               label="Stop sharing"
               center={false}
               disabled={busy}
-              onPress={() => askRevoke(consent)}
+              onPress={() => undefined}
             />
           )}
killedBy: revoke stops sharing after password re-auth
statusReason: Alert.alert was never called

[Killed] BooleanLiteral
src/screens/TherapistShareScreen.tsx:250:37
         </View>
       ))}
 
-      {sharingAvailable === true && !lookup && (
+      {sharingAvailable === true && lookup && (
         <>
           <Text style={themed.label}>Add your therapist</Text>
killedBy: consent list renders the empty state when nothing is shared
statusReason: expected 'Need help now? Crisis resources Shari…' to contain 'Add your therapist'

[Killed] LogicalOperator
src/screens/TherapistShareScreen.tsx:250:8
         </View>
       ))}
 
-      {sharingAvailable === true && !lookup && (
+      {sharingAvailable === true || !lookup && (
         <>
           <Text style={themed.label}>Add your therapist</Text>
killedBy: consent list fails closed when the server has not enabled verified clinician sharing
statusReason: expected 'Need help now? Crisis resources Thera…' not to contain 'Add your therapist'

[Survived] ConditionalExpression
src/screens/TherapistShareScreen.tsx:269:23
           <PrimaryButton
             label={busy ? "Looking up…" : "Find my therapist"}
             onPress={findTherapist}
-            disabled={busy || !code.trim()}
+            disabled={true}
           />
         </>

[Survived] ConditionalExpression
src/screens/TherapistShareScreen.tsx:269:23
           <PrimaryButton
             label={busy ? "Looking up…" : "Find my therapist"}
             onPress={findTherapist}
-            disabled={busy || !code.trim()}
+            disabled={false}
           />
         </>

[Killed] BooleanLiteral
src/screens/TherapistShareScreen.tsx:274:29
         </>
       )}
 
-      {sharingAvailable === true && lookup && !pending && (
+      {sharingAvailable === false && lookup && !pending && (
         <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}>
           <Text style={[styles.cardTitle, { color: t.colors.text }]}>{lookup.display_name}</Text>
killedBy: pairing lookup shows the therapist card on success and resets on cancel
statusReason: expected 'Need help now? Crisis resources Shari…' to contain 'Dr. Real'

[Killed] ConditionalExpression
src/screens/TherapistShareScreen.tsx:274:8
         </>
       )}
 
-      {sharingAvailable === true && lookup && !pending && (
-        <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}>
-          <Text style={[styles.cardTitle, { color: t.colors.text }]}>{lookup.display_name}</Text>
-          <Text style={themed.footnote}>
-            {`Key fingerprint: ${therapistKeyFingerprint(lookup.wrap_pub_key)}\n`}
-            Read it back to your therapist and check it matches the one their portal
-            shows — a mismatch means the key was substituted in transit.
-          </Text>
-          <Text style={themed.footnote}>
-            Sharing lets them read every entry and pattern (never change anything), and write their
-            own private notes. You can stop at any time; what they already read cannot be unread.
-          </Text>
-          <PrimaryButton
-            label={`Share with ${lookup.display_name}`}
-            onPress={confirmGrant}
-            disabled={busy}
-          />
-          <GhostButton
-            label="Cancel"
-            disabled={busy}
-            onPress={() => { setLookup(null); setCode(""); }}
-          />
-        </View>
-      )}
+      {true}
 
       {sharingAvailable === true && pending && (
killedBy: pairing lookup shows the therapist card on success and resets on cancel
statusReason: expected 'Need help now? Crisis resources Shari…' to contain 'Dr. Real'

[Survived] ArrayDeclaration
src/screens/TherapistShareScreen.tsx:276:24
 
       {sharingAvailable === true && lookup && !pending && (
         <View style={[styles.card, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}>
-          <Text style={[styles.cardTitle, { color: t.colors.text }]}>{lookup.display_name}</Text>
+          <Text style={[]}>{lookup.display_name}</Text>
           <Text style={themed.footnote}>
             {`Key fingerprint: ${therapistKeyFingerprint(lookup.wrap_pub_key)}\n`}

[Killed] BlockStatement
src/screens/TherapistShareScreen.tsx:294:28
           <GhostButton
             label="Cancel"
             disabled={busy}
-            onPress={() => { setLookup(null); setCode(""); }}
+            onPress={() => {}}
           />
         </View>
killedBy: pairing lookup shows the therapist card on success and resets on cancel
statusReason: expected 'Need help now? Crisis resources Shari…' not to contain 'Dr. Real'

[Killed] CallExpression
src/screens/TherapistShareScreen.tsx:294:30
           <GhostButton
             label="Cancel"
             disabled={busy}
-            onPress={() => { setLookup(null); setCode(""); }}
+            onPress={() => { ; setCode(""); }}
           />
         </View>
killedBy: pairing lookup shows the therapist card on success and resets on cancel
statusReason: expected 'Need help now? Crisis resources Shari…' not to contain 'Dr. Real'

[Killed] BooleanLiteral
src/screens/TherapistShareScreen.tsx:299:29
         </View>
       )}
 
-      {sharingAvailable === true && pending && (
+      {sharingAvailable === false && pending && (
         <View style={[styles.reauthCard, { backgroundColor: t.colors.cardDeep, borderRadius: t.radius.lg }]}>
           <Text style={[styles.reauthTitle, { color: t.colors.text }]}>
killedBy: grant wraps the vault data key and grants after password re-auth
statusReason: no TextInput with placeholder "password"
