[Killed] StringLiteral
src/theme.tsx:33:27
  *  once by the provider in App.tsx. */
 export type ThemeMode = "system" | "dark" | "light";
 
-const THEME_STORAGE_KEY = "@mindpattern/theme.mode";
+const THEME_STORAGE_KEY = "";
 
 const ThemeModeContext = createContext<ThemeMode>("system");
killedBy: theme radio initial value shows the provider default while the persisted read is in flight — never a palette-derived value
statusReason: resolveStored is not a function

[Killed] BlockStatement
src/theme.tsx:37:43
 
 const ThemeModeContext = createContext<ThemeMode>("system");
 
-export function themeStorageKey(): string {
-  return THEME_STORAGE_KEY;
-}
+export function themeStorageKey(): string {}
 
 export interface ThemeColors {
killedBy: theme radio initial value shows the provider default while the persisted read is in flight — never a palette-derived value
statusReason: resolveStored is not a function

[Killed] ObjectLiteral
src/theme.tsx:106:12
 }
 
 const scales = {
-  spacing: { xs: 4, sm: 8, md: 12, lg: 16, xl: 20, xxl: 24, xxxl: 32 },
+  spacing: {},
   radius: { sm: 3, md: 10, lg: 12, xl: 14 },
   type: {
killedBy: UnlockScreen pins the visual language of the screen
statusReason: style not rendered: {"backgroundColor":"#0f1115","padding":32,"gap":12}
rendered styles:
{"flex":1,"justifyContent":"center"}
{"backgroundColor":"#0f1115"}
{"fontSize":34,"fontWeight":"700","textAlign":"center"}
{"color":"#e8eaf0"}
{"textAlign":"center","marginBottom":24,"lineHeight":20}
{"color":"#8a91a3","fontSize":14}

[Killed] ObjectLiteral
src/theme.tsx:109:14
   spacing: { xs: 4, sm: 8, md: 12, lg: 16, xl: 20, xxl: 24, xxxl: 32 },
   radius: { sm: 3, md: 10, lg: 12, xl: 14 },
   type: {
-    display: { fontSize: 34, fontWeight: "700" as const },
+    display: {},
     question: { fontSize: 22, fontWeight: "600" as const, lineHeight: 30 },
     titleLg: { fontSize: 20, fontWeight: "700" as const, lineHeight: 27 },
killedBy: theme pins: exact scale and palette values the display/question/titleLg type entries are the full contract
statusReason: expected {} to deeply equal { fontSize: 34, fontWeight: '700' }

[Killed] ObjectLiteral
src/theme.tsx:120:14
     caption: { fontSize: 11, fontWeight: "700" as const, letterSpacing: 1 },
   },
   minTouch: 44,
-  touchSlop: { top: 12, bottom: 12, left: 12, right: 12 },
+  touchSlop: {},
 };
 
killedBy: CrisisScreen pins: the full StyleSheet contract the helpline link carries [link, {minHeight, justifyContent: center}] and its exact hitSlop
statusReason: expected {} to deeply equal { top: 12, bottom: 12, left: 12, …(1) }

[Killed] ObjectLiteral
src/theme.tsx:123:33
   touchSlop: { top: 12, bottom: 12, left: 12, right: 12 },
 };
 
-export const darkTheme: Theme = {
-  dark: true,
-  colors: {
-    bg: "#0f1115",
-    card: "#1a1e26",
-    cardDeep: "#141821",
-    border: "#222733",
-    text: "#e8eaf0",
-    body: "#b6bdc9",
-    muted: "#8a91a3",
-    placeholder: "#8a91a3",
-    accent: "#7f9bff",
-    primary: "#3b5bdb",
-    primaryBright: "#4f7cff",
-    onPrimary: "#ffffff",
-    danger: "#c0392b",
-    error: "#ff6b6b",
-    success: "#59c98a",
-    sparkDown: "#e06c75",
-    helpBg: "#242a38",
-  },
-  ...scales,
-};
+export const darkTheme: Theme = {};
 
 export const lightTheme: Theme = {
killedBy: InsightsScreen phases shows the loading spinner only while the first load is in flight
statusReason: Cannot read properties of undefined (reading 'card')

[Killed] BooleanLiteral
src/theme.tsx:124:9
 };
 
 export const darkTheme: Theme = {
-  dark: true,
+  dark: false,
   colors: {
     bg: "#0f1115",
killedBy: theme pins: exact scale and palette values theme flags and the otherwise-unpinned palette hexes are exact
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/theme.tsx:126:9
 export const darkTheme: Theme = {
   dark: true,
   colors: {
-    bg: "#0f1115",
+    bg: "",
     card: "#1a1e26",
     cardDeep: "#141821",
killedBy: InsightsScreen phases pins the visual language of the screen (patterns + error states)
statusReason: style not rendered: {"backgroundColor":"#0f1115"}
rendered styles:
{"flex":1}
{"backgroundColor":""}
{"backgroundColor":"#1a1e26","borderRadius":12,"padding":16,"gap":6}
{"flexDirection":"row","justifyContent":"space-between","alignItems":"center"}
{"color":"#7f9bff","fontSize":11,"fontWeight":"700","letterSpacing":1}
{"color":"#8a91a3","fontSize":11,"fontWeight":"600"}

[Killed] StringLiteral
src/theme.tsx:129:13
     bg: "#0f1115",
     card: "#1a1e26",
     cardDeep: "#141821",
-    border: "#222733",
+    border: "",
     text: "#e8eaf0",
     body: "#b6bdc9",
killedBy: theme pins: exact scale and palette values theme flags and the otherwise-unpinned palette hexes are exact
statusReason: expected '' to be '#222733' // Object.is equality

[Killed] StringLiteral
src/theme.tsx:135:14
     muted: "#8a91a3",
     placeholder: "#8a91a3",
     accent: "#7f9bff",
-    primary: "#3b5bdb",
+    primary: "",
     primaryBright: "#4f7cff",
     onPrimary: "#ffffff",
killedBy: SettingsScreen chrome pins the visual language of the screen
statusReason: style not rendered: {"backgroundColor":"#3b5bdb","minHeight":44}
rendered styles:
{"flex":1}
{"backgroundColor":"#0f1115","padding":24,"gap":14}
{"padding":16,"alignItems":"center","justifyContent":"center"}
{"backgroundColor":"#242a38","borderRadius":10,"minHeight":44}
{"fontWeight":"700"}
{"color":"#e8eaf0","fontSize":14}

[Killed] StringLiteral
src/theme.tsx:139:12
     primaryBright: "#4f7cff",
     onPrimary: "#ffffff",
     danger: "#c0392b",
-    error: "#ff6b6b",
+    error: "",
     success: "#59c98a",
     sparkDown: "#e06c75",
killedBy: HistoryScreen pins: state cards and presence guards a server error renders its exact card, and neither empty nor offline copy
statusReason: expected { color: '', fontSize: 13 } to deeply equal { color: '#ff6b6b', fontSize: 13 }

[Killed] StringLiteral
src/theme.tsx:141:16
     danger: "#c0392b",
     error: "#ff6b6b",
     success: "#59c98a",
-    sparkDown: "#e06c75",
+    sparkDown: "",
     helpBg: "#242a38",
   },
killedBy: InsightsScreen evidence view baseline: shows the writing streak and the on-device mood sparkline
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/theme.tsx:147:34
   ...scales,
 };
 
-export const lightTheme: Theme = {
-  dark: false,
-  colors: {
-    bg: "#f5f6fa",
-    card: "#ffffff",
-    cardDeep: "#eef0f6",
-    border: "#d5dae4",
-    text: "#161a22",
-    body: "#3d4453",
-    muted: "#5a6272",
-    placeholder: "#5a6272",
-    accent: "#2f4bd0",
-    primary: "#2f4bd0",
-    primaryBright: "#3b5bdb",
-    onPrimary: "#ffffff",
-    danger: "#b03525",
-    error: "#c92f22",
-    success: "#187a41",
-    sparkDown: "#c64650",
-    helpBg: "#e4e9f5",
-  },
-  ...scales,
-};
+export const lightTheme: Theme = {};
 
 /** The active theme: the user's explicit override when set, otherwise the
killedBy: theme pins: exact scale and palette values the display/question/titleLg type entries are the full contract
statusReason: Cannot read properties of undefined (reading 'display')

[Killed] BooleanLiteral
src/theme.tsx:148:9
 };
 
 export const lightTheme: Theme = {
-  dark: false,
+  dark: true,
   colors: {
     bg: "#f5f6fa",
killedBy: theme pins: exact scale and palette values theme flags and the otherwise-unpinned palette hexes are exact
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/theme.tsx:149:11
 
 export const lightTheme: Theme = {
   dark: false,
-  colors: {
-    bg: "#f5f6fa",
-    card: "#ffffff",
-    cardDeep: "#eef0f6",
-    border: "#d5dae4",
-    text: "#161a22",
-    body: "#3d4453",
-    muted: "#5a6272",
-    placeholder: "#5a6272",
-    accent: "#2f4bd0",
-    primary: "#2f4bd0",
-    primaryBright: "#3b5bdb",
-    onPrimary: "#ffffff",
-    danger: "#b03525",
-    error: "#c92f22",
-    success: "#187a41",
-    sparkDown: "#c64650",
-    helpBg: "#e4e9f5",
-  },
+  colors: {},
   ...scales,
 };
killedBy: theme contrast (WCAG AA, computed) light: the same promises hold on the light surfaces
statusReason: Cannot read properties of undefined (reading 'slice')

[Killed] StringLiteral
src/theme.tsx:150:9
 export const lightTheme: Theme = {
   dark: false,
   colors: {
-    bg: "#f5f6fa",
+    bg: "",
     card: "#ffffff",
     cardDeep: "#eef0f6",
killedBy: theme contrast (WCAG AA, computed) light: the same promises hold on the light surfaces
statusReason: expected NaN to be greater than or equal to 4.5

[Killed] StringLiteral
src/theme.tsx:151:11
   dark: false,
   colors: {
     bg: "#f5f6fa",
-    card: "#ffffff",
+    card: "",
     cardDeep: "#eef0f6",
     border: "#d5dae4",
killedBy: theme contrast (WCAG AA, computed) light: the same promises hold on the light surfaces
statusReason: expected NaN to be greater than or equal to 4.5

[Killed] StringLiteral
src/theme.tsx:154:11
     card: "#ffffff",
     cardDeep: "#eef0f6",
     border: "#d5dae4",
-    text: "#161a22",
+    text: "",
     body: "#3d4453",
     muted: "#5a6272",
killedBy: theme contrast (WCAG AA, computed) light: the same promises hold on the light surfaces
statusReason: expected NaN to be greater than or equal to 4.5

[Killed] StringLiteral
src/theme.tsx:155:11
     cardDeep: "#eef0f6",
     border: "#d5dae4",
     text: "#161a22",
-    body: "#3d4453",
+    body: "",
     muted: "#5a6272",
     placeholder: "#5a6272",
killedBy: theme contrast (WCAG AA, computed) light: the same promises hold on the light surfaces
statusReason: expected NaN to be greater than or equal to 4.5

[Killed] StringLiteral
src/theme.tsx:156:12
     border: "#d5dae4",
     text: "#161a22",
     body: "#3d4453",
-    muted: "#5a6272",
+    muted: "",
     placeholder: "#5a6272",
     accent: "#2f4bd0",
killedBy: theme contrast (WCAG AA, computed) light: the same promises hold on the light surfaces
statusReason: expected NaN to be greater than or equal to 4.5

[Killed] StringLiteral
src/theme.tsx:161:16
     accent: "#2f4bd0",
     primary: "#2f4bd0",
     primaryBright: "#3b5bdb",
-    onPrimary: "#ffffff",
+    onPrimary: "",
     danger: "#b03525",
     error: "#c92f22",
killedBy: theme contrast (WCAG AA, computed) light: the same promises hold on the light surfaces
statusReason: expected NaN to be greater than or equal to 4.5

[Killed] StringLiteral
src/theme.tsx:162:13
     primary: "#2f4bd0",
     primaryBright: "#3b5bdb",
     onPrimary: "#ffffff",
-    danger: "#b03525",
+    danger: "",
     error: "#c92f22",
     success: "#187a41",
killedBy: theme contrast (WCAG AA, computed) light: the same promises hold on the light surfaces
statusReason: expected NaN to be greater than or equal to 4.5

[Killed] StringLiteral
src/theme.tsx:163:12
     primaryBright: "#3b5bdb",
     onPrimary: "#ffffff",
     danger: "#b03525",
-    error: "#c92f22",
+    error: "",
     success: "#187a41",
     sparkDown: "#c64650",
killedBy: theme contrast (WCAG AA, computed) light: the same promises hold on the light surfaces
statusReason: expected NaN to be greater than or equal to 4.5

[Killed] StringLiteral
src/theme.tsx:165:16
     danger: "#b03525",
     error: "#c92f22",
     success: "#187a41",
-    sparkDown: "#c64650",
+    sparkDown: "",
     helpBg: "#e4e9f5",
   },
killedBy: theme pins: exact scale and palette values theme flags and the otherwise-unpinned palette hexes are exact
statusReason: expected '' to be '#c64650' // Object.is equality

[Killed] BlockStatement
src/theme.tsx:175:35
  *  OS color scheme — dark by default (and for any unrecognized scheme
  *  value). Screens render WITHOUT a provider in tests: the context default
  *  ("system") reproduces the old behavior exactly. */
-export function useTheme(): Theme {
-  const scheme = useColorScheme();
-  const mode = useContext(ThemeModeContext);
-  if (mode === "dark") return darkTheme;
-  if (mode === "light") return lightTheme;
-  return scheme === "light" ? lightTheme : darkTheme;
-}
+export function useTheme(): Theme {}
 
 /** App-level provider: loads the persisted override once, exposes the
killedBy: HistoryScreen list renders past entries decrypted on-device, newest day first
statusReason: Cannot read properties of undefined (reading 'colors')

[Killed] ConditionalExpression
src/theme.tsx:178:7
 export function useTheme(): Theme {
   const scheme = useColorScheme();
   const mode = useContext(ThemeModeContext);
-  if (mode === "dark") return darkTheme;
+  if (true) return darkTheme;
   if (mode === "light") return lightTheme;
   return scheme === "light" ? lightTheme : darkTheme;
killedBy: useTheme defaults to the dark palette and follows an explicit light scheme
statusReason: expected { dark: true, colors: { …(17) }, …(5) } to be { Object (dark, colors, ...) } // Object.is equality

[Killed] EqualityOperator
src/theme.tsx:178:7
 export function useTheme(): Theme {
   const scheme = useColorScheme();
   const mode = useContext(ThemeModeContext);
-  if (mode === "dark") return darkTheme;
+  if (mode !== "dark") return darkTheme;
   if (mode === "light") return lightTheme;
   return scheme === "light" ? lightTheme : darkTheme;
killedBy: useTheme defaults to the dark palette and follows an explicit light scheme
statusReason: expected { dark: true, colors: { …(17) }, …(5) } to be { Object (dark, colors, ...) } // Object.is equality

[Killed] ConditionalExpression
src/theme.tsx:179:7
   const scheme = useColorScheme();
   const mode = useContext(ThemeModeContext);
   if (mode === "dark") return darkTheme;
-  if (mode === "light") return lightTheme;
+  if (true) return lightTheme;
   return scheme === "light" ? lightTheme : darkTheme;
 }
killedBy: useTheme defaults to the dark palette and follows an explicit light scheme
statusReason: expected { Object (dark, colors, ...) } to be { dark: true, colors: { …(17) }, …(5) } // Object.is equality

[Killed] EqualityOperator
src/theme.tsx:179:7
   const scheme = useColorScheme();
   const mode = useContext(ThemeModeContext);
   if (mode === "dark") return darkTheme;
-  if (mode === "light") return lightTheme;
+  if (mode !== "light") return lightTheme;
   return scheme === "light" ? lightTheme : darkTheme;
 }
killedBy: useTheme defaults to the dark palette and follows an explicit light scheme
statusReason: expected { Object (dark, colors, ...) } to be { dark: true, colors: { …(17) }, …(5) } // Object.is equality

[Killed] ConditionalExpression
src/theme.tsx:180:10
   const mode = useContext(ThemeModeContext);
   if (mode === "dark") return darkTheme;
   if (mode === "light") return lightTheme;
-  return scheme === "light" ? lightTheme : darkTheme;
+  return true ? lightTheme : darkTheme;
 }
 
killedBy: useTheme defaults to the dark palette and follows an explicit light scheme
statusReason: expected { Object (dark, colors, ...) } to be { dark: true, colors: { …(17) }, …(5) } // Object.is equality

[Killed] EqualityOperator
src/theme.tsx:180:10
   const mode = useContext(ThemeModeContext);
   if (mode === "dark") return darkTheme;
   if (mode === "light") return lightTheme;
-  return scheme === "light" ? lightTheme : darkTheme;
+  return scheme !== "light" ? lightTheme : darkTheme;
 }
 
killedBy: useTheme defaults to the dark palette and follows an explicit light scheme
statusReason: expected { Object (dark, colors, ...) } to be { dark: true, colors: { …(17) }, …(5) } // Object.is equality

[NoCoverage] CallExpression
src/theme.tsx:188:3
 export function ThemeProvider({ children }: { children: React.ReactNode }): React.JSX.Element {
   const [mode, setModeState] = useState<ThemeMode>("system");
 
-  useEffect(() => {
-    let cancelled = false;
-    AsyncStorage.getItem(THEME_STORAGE_KEY)
-      .then((stored: string | null) => {
-        if (cancelled) return;
-        if (stored === "dark" || stored === "light" || stored === "system") {
-          setModeState(stored);
-        }
-      })
-      .catch(() => {});
-    return () => {
-      cancelled = true;
-    };
-  }, []);
+  ;
 
   const setMode = (next: ThemeMode) => {

[NoCoverage] BlockStatement
src/theme.tsx:188:19
 export function ThemeProvider({ children }: { children: React.ReactNode }): React.JSX.Element {
   const [mode, setModeState] = useState<ThemeMode>("system");
 
-  useEffect(() => {
-    let cancelled = false;
-    AsyncStorage.getItem(THEME_STORAGE_KEY)
-      .then((stored: string | null) => {
-        if (cancelled) return;
-        if (stored === "dark" || stored === "light" || stored === "system") {
-          setModeState(stored);
-        }
-      })
-      .catch(() => {});
-    return () => {
-      cancelled = true;
-    };
-  }, []);
+  useEffect(() => {}, []);
 
   const setMode = (next: ThemeMode) => {

[NoCoverage] CallExpression
src/theme.tsx:190:5
 
   useEffect(() => {
     let cancelled = false;
-    AsyncStorage.getItem(THEME_STORAGE_KEY)
-      .then((stored: string | null) => {
-        if (cancelled) return;
-        if (stored === "dark" || stored === "light" || stored === "system") {
-          setModeState(stored);
-        }
-      })
-      .catch(() => {});
+    ;
     return () => {
       cancelled = true;

[NoCoverage] BlockStatement
src/theme.tsx:191:40
   useEffect(() => {
     let cancelled = false;
     AsyncStorage.getItem(THEME_STORAGE_KEY)
-      .then((stored: string | null) => {
-        if (cancelled) return;
-        if (stored === "dark" || stored === "light" || stored === "system") {
-          setModeState(stored);
-        }
-      })
+      .then((stored: string | null) => {})
       .catch(() => {});
     return () => {

[NoCoverage] ConditionalExpression
src/theme.tsx:192:13
     let cancelled = false;
     AsyncStorage.getItem(THEME_STORAGE_KEY)
       .then((stored: string | null) => {
-        if (cancelled) return;
+        if (true) return;
         if (stored === "dark" || stored === "light" || stored === "system") {
           setModeState(stored);

[NoCoverage] ConditionalExpression
src/theme.tsx:192:13
     let cancelled = false;
     AsyncStorage.getItem(THEME_STORAGE_KEY)
       .then((stored: string | null) => {
-        if (cancelled) return;
+        if (false) return;
         if (stored === "dark" || stored === "light" || stored === "system") {
           setModeState(stored);

[NoCoverage] LogicalOperator
src/theme.tsx:193:13
     AsyncStorage.getItem(THEME_STORAGE_KEY)
       .then((stored: string | null) => {
         if (cancelled) return;
-        if (stored === "dark" || stored === "light" || stored === "system") {
+        if (stored === "dark" && stored === "light" || stored === "system") {
           setModeState(stored);
         }

[NoCoverage] EqualityOperator
src/theme.tsx:193:34
     AsyncStorage.getItem(THEME_STORAGE_KEY)
       .then((stored: string | null) => {
         if (cancelled) return;
-        if (stored === "dark" || stored === "light" || stored === "system") {
+        if (stored === "dark" || stored !== "light" || stored === "system") {
           setModeState(stored);
         }

[NoCoverage] CallExpression
src/theme.tsx:194:11
       .then((stored: string | null) => {
         if (cancelled) return;
         if (stored === "dark" || stored === "light" || stored === "system") {
-          setModeState(stored);
+          ;
         }
       })

[NoCoverage] BlockStatement
src/theme.tsx:198:18
         }
       })
       .catch(() => {});
-    return () => {
-      cancelled = true;
-    };
+    return () => {};
   }, []);
 

[NoCoverage] BlockStatement
src/theme.tsx:203:40
     };
   }, []);
 
-  const setMode = (next: ThemeMode) => {
-    setModeState(next);
-    AsyncStorage.setItem(THEME_STORAGE_KEY, next).catch(() => {});
-  };
+  const setMode = (next: ThemeMode) => {};
 
   return (

[NoCoverage] CallExpression
src/theme.tsx:204:5
   }, []);
 
   const setMode = (next: ThemeMode) => {
-    setModeState(next);
+    ;
     AsyncStorage.setItem(THEME_STORAGE_KEY, next).catch(() => {});
   };

[NoCoverage] CallExpression
src/theme.tsx:205:5
 
   const setMode = (next: ThemeMode) => {
     setModeState(next);
-    AsyncStorage.setItem(THEME_STORAGE_KEY, next).catch(() => {});
+    ;
   };
 

[Survived] BlockStatement
src/theme.tsx:217:62
 
 /** The setter Settings consumes (changing the override re-renders the
  *  tree through the provider's state). */
-export function useSetThemeMode(): (mode: ThemeMode) => void {
-  return useContext(ThemeSetterContext);
-}
+export function useSetThemeMode(): (mode: ThemeMode) => void {}
 
 const ThemeSetterContext = createContext<(mode: ThemeMode) => void>(() => {});
