[Killed] BlockStatement
src/screens/CrisisScreen.tsx:25:34
 /** Texting a crisis line uses a different query separator per platform:
  *  Android's "?body=" is silently dropped by iOS (which wants "&body="),
  *  and "HOME" pre-filled is the whole point of the shortcut. */
-function crisisTextUrl(): string {
-  return `sms:741741${Platform.select({ ios: "&body=HOME", default: "?body=HOME" })}`;
-}
+function crisisTextUrl(): string {}
 
 /** Every external open can reject (no dialer, no browser, a simulator) —
killedBy: CrisisScreen actions pre-fills HOME with '&body=' on iOS (regression: '?body=' is silently dropped)
statusReason: expected "vi.fn()" to be called with arguments: [ 'sms:741741&body=HOME' ]

Received:

  1st vi.fn() call:

  [
-   "sms:741741&body=HOME",

[Killed] StringLiteral
src/screens/CrisisScreen.tsx:26:46
  *  Android's "?body=" is silently dropped by iOS (which wants "&body="),
  *  and "HOME" pre-filled is the whole point of the shortcut. */
 function crisisTextUrl(): string {
-  return `sms:741741${Platform.select({ ios: "&body=HOME", default: "?body=HOME" })}`;
+  return `sms:741741${Platform.select({ ios: "", default: "?body=HOME" })}`;
 }
 
killedBy: CrisisScreen actions pre-fills HOME with '&body=' on iOS (regression: '?body=' is silently dropped)
statusReason: expected "vi.fn()" to be called with arguments: [ 'sms:741741&body=HOME' ]

Received:

  1st vi.fn() call:

  [
-   "sms:741741&body=HOME",

[Killed] BlockStatement
src/screens/CrisisScreen.tsx:32:60
 /** Every external open can reject (no dialer, no browser, a simulator) —
  *  and a dead tap on THIS screen is the worst possible failure. Fall back
  *  to telling the user the number/address itself. */
-function openExternal(url: string, fallback: string): void {
-  Linking.openURL(url).catch(() => {
-    Alert.alert("Couldn't open it from here", fallback);
-  });
-}
+function openExternal(url: string, fallback: string): void {}
 
 /** The device's region from its locale ("en-US" → "US"), or null when the
killedBy: CrisisScreen actions opens tel:988 for the lifeline and tel:911 for emergencies
statusReason: expected [] to deeply equal [ [ 'tel:988' ], [ 'tel:911' ] ]

[Killed] BlockStatement
src/screens/CrisisScreen.tsx:33:36
  *  and a dead tap on THIS screen is the worst possible failure. Fall back
  *  to telling the user the number/address itself. */
 function openExternal(url: string, fallback: string): void {
-  Linking.openURL(url).catch(() => {
-    Alert.alert("Couldn't open it from here", fallback);
-  });
+  Linking.openURL(url).catch(() => {});
 }
 
killedBy: CrisisScreen failure handling a rejected openURL on "Call or text 988" surfaces the number/address instead of a dead tap
statusReason: expected "vi.fn()" to be called with arguments: [ 'Couldn\'t open it from here', …(1) ]

Number of calls: 0

[Killed] Regex
src/screens/CrisisScreen.tsx:43:19
 export function deviceRegion(): string | null {
   try {
     const locale = Intl.DateTimeFormat().resolvedOptions().locale;
-    const match = /[-_]([A-Za-z]{2})\b/.exec(locale);
+    const match = /[-_]([^A-Za-z]{2})\b/.exec(locale);
     const region = match?.[1];
killedBy: CrisisScreen pins: deviceRegion regex (exact two-letter capture) parses hyphen and underscore locales to the exact uppercased region
statusReason: expected null to be 'US' // Object.is equality

[Killed] MethodExpression
src/screens/CrisisScreen.tsx:46:21
     const match = /[-_]([A-Za-z]{2})\b/.exec(locale);
     const region = match?.[1];
-    return region ? region.toUpperCase() : null;
+    return region ? region.toLowerCase() : null;
   } catch {
     return null;
killedBy: CrisisScreen upgrades (call anxiety + chat + locale) US layout (default): hotlines first, findahelpline as the outside-US note
statusReason: expected 4 to be greater than 6

[Killed] BlockStatement
src/screens/CrisisScreen.tsx:47:11
     const region = match?.[1];
     return region ? region.toUpperCase() : null;
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 
killedBy: deviceRegion parses the locale region and survives hostile Intl implementations
statusReason: expected undefined to be null

[Killed] BlockStatement
src/screens/CrisisScreen.tsx:62:4
   detail: string;
   onPress: () => void;
   theme: ReturnType<typeof useTheme>;
-}) {
-  return (
-    <TouchableOpacity
-      style={[
-        styles.action,
-        {
-          backgroundColor: theme.colors.card,
-          borderRadius: theme.radius.lg,
-          minHeight: theme.minTouch,
-        },
-      ]}
-      onPress={onPress}
-      accessibilityRole="button"
-      accessibilityLabel={`${label} — ${detail}`}
-    >
-      <View style={{ flex: 1 }}>
-        <Text style={[styles.actionLabel, { color: theme.colors.text }]}>{label}</Text>
-        <Text style={[styles.actionDetail, { color: theme.colors.muted, fontSize: 13 }]}>{detail}</Text>
-      </View>
-      <Text style={[styles.actionGo, { color: theme.colors.accent }]}>Go</Text>
-    </TouchableOpacity>
-  );
-}
+}) {}
 
 /** `region` is injectable for tests; production callers leave it to the
killedBy: CrisisScreen pins: the full StyleSheet contract renders every base style object exactly ({} and string mutants die)
statusReason: style not rendered: {"flexDirection":"row","alignItems":"center","padding":16,"gap":12}
rendered styles:
{"flex":1}
{"backgroundColor":"#0f1115"}
{"fontSize":20,"fontWeight":"700","lineHeight":27}
{"color":"#e8eaf0"}
{"fontSize":15,"lineHeight":22}
{"color":"#b6bdc9"}

[Killed] ObjectLiteral
src/screens/CrisisScreen.tsx:78:43
       accessibilityLabel={`${label} — ${detail}`}
     >
       <View style={{ flex: 1 }}>
-        <Text style={[styles.actionLabel, { color: theme.colors.text }]}>{label}</Text>
+        <Text style={[styles.actionLabel, {}]}>{label}</Text>
         <Text style={[styles.actionDetail, { color: theme.colors.muted, fontSize: 13 }]}>{detail}</Text>
       </View>
killedBy: CrisisScreen pins: the full StyleSheet contract renders every base style object exactly ({} and string mutants die)
statusReason: expected [ { flex: 1 }, …(53) ] to not deep equally contain {}

[Killed] ArrayDeclaration
src/screens/CrisisScreen.tsx:81:20
         <Text style={[styles.actionLabel, { color: theme.colors.text }]}>{label}</Text>
         <Text style={[styles.actionDetail, { color: theme.colors.muted, fontSize: 13 }]}>{detail}</Text>
       </View>
-      <Text style={[styles.actionGo, { color: theme.colors.accent }]}>Go</Text>
+      <Text style={[]}>Go</Text>
     </TouchableOpacity>
   );
killedBy: CrisisScreen pins: the full StyleSheet contract renders every base style object exactly ({} and string mutants die)
statusReason: style not rendered: {"fontSize":14,"fontWeight":"700"}
rendered styles:
{"flex":1}
{"backgroundColor":"#0f1115"}
{"fontSize":20,"fontWeight":"700","lineHeight":27}
{"color":"#e8eaf0"}
{"fontSize":15,"lineHeight":22}
{"color":"#b6bdc9"}

[Killed] LogicalOperator
src/screens/CrisisScreen.tsx:90:27
  *  device locale. */
 export function CrisisScreen({ region }: { region?: string }): React.JSX.Element {
   const t = useTheme();
-  const effectiveRegion = region ?? deviceRegion();
+  const effectiveRegion = region && deviceRegion();
   // null (unknown) keeps the US-first layout — the services are US-based,
   // and a misdetection must never hide them from a US user mid-crisis.
killedBy: CrisisScreen pins: unknown region keeps the US-first layout a locale with no region subtag renders the US layout, not the non-US one
statusReason: expected 'If you are thinking about harming you…' to contain 'These are US services'

[Killed] ConditionalExpression
src/screens/CrisisScreen.tsx:93:47
   const effectiveRegion = region ?? deviceRegion();
   // null (unknown) keeps the US-first layout — the services are US-based,
   // and a misdetection must never hide them from a US user mid-crisis.
-  const usFirst = effectiveRegion === null || effectiveRegion === "US";
+  const usFirst = effectiveRegion === null || false;
 
   const usServices = (
killedBy: CrisisScreen upgrades (call anxiety + chat + locale) US layout (default): hotlines first, findahelpline as the outside-US note
statusReason: expected 4 to be greater than 6

[Killed] ConditionalExpression
src/screens/CrisisScreen.tsx:93:19
   const effectiveRegion = region ?? deviceRegion();
   // null (unknown) keeps the US-first layout — the services are US-based,
   // and a misdetection must never hide them from a US user mid-crisis.
-  const usFirst = effectiveRegion === null || effectiveRegion === "US";
+  const usFirst = false;
 
   const usServices = (
killedBy: CrisisScreen pins: unknown region keeps the US-first layout a locale with no region subtag renders the US layout, not the non-US one
statusReason: expected 'If you are thinking about harming you…' to contain 'These are US services'

[Killed] StringLiteral
src/screens/CrisisScreen.tsx:98:19
   const usServices = (
     <>
       <ActionButton
-        label={tr("crisis.call988")}
+        label={tr("")}
         detail={tr("crisis.call988.detail")}
         onPress={() => openExternal("tel:988", tr("crisis.call988.fallback"))}
killedBy: CrisisScreen content pins the hotline resources: 988, Crisis Text Line 741741, 911, findahelpline.com
statusReason: expected 'If you are thinking about harming you…' to contain 'Call or text 988'

[Killed] ArrowFunction
src/screens/CrisisScreen.tsx:100:18
       <ActionButton
         label={tr("crisis.call988")}
         detail={tr("crisis.call988.detail")}
-        onPress={() => openExternal("tel:988", tr("crisis.call988.fallback"))}
+        onPress={() => undefined}
         theme={t}
       />
killedBy: CrisisScreen actions opens tel:988 for the lifeline and tel:911 for emergencies
statusReason: expected [ [ 'tel:911' ] ] to deeply equal [ [ 'tel:988' ], [ 'tel:911' ] ]

[Killed] ArrowFunction
src/screens/CrisisScreen.tsx:106:18
       <ActionButton
         label={tr("crisis.text741741")}
         detail={tr("crisis.text741741.detail")}
-        onPress={() => openExternal(crisisTextUrl(), "You can still text HOME to 741741 from your messages app.")}
+        onPress={() => undefined}
         theme={t}
       />
killedBy: CrisisScreen actions pre-fills HOME with '&body=' on iOS (regression: '?body=' is silently dropped)
statusReason: expected "vi.fn()" to be called with arguments: [ 'sms:741741&body=HOME' ]

Number of calls: 0

[Killed] ArrowFunction
src/screens/CrisisScreen.tsx:112:18
       <ActionButton
         label="Chat online at 988lifeline.org"
         detail="The same lifeline, in your browser — no phone call needed"
-        onPress={() =>
-          openExternal("https://988lifeline.org/chat", "You can still visit 988lifeline.org/chat in a browser.")
+        onPress={() => undefined
         }
         theme={t}
killedBy: CrisisScreen upgrades (call anxiety + chat + locale) offers the 988 chat alongside call and text
statusReason: expected "vi.fn()" to be called with arguments: [ 'https://988lifeline.org/chat' ]

Number of calls: 0

[Killed] StringLiteral
src/screens/CrisisScreen.tsx:118:39
         theme={t}
       />
       <ActionButton
-        label={usFirst ? "Call 911" : "Call 911 (US)"}
+        label={usFirst ? "Call 911" : ""}
         detail="If you are in immediate danger or have already hurt yourself"
         onPress={() => openExternal("tel:911", "You can still dial 911 from your phone.")}
killedBy: CrisisScreen upgrades (call anxiety + chat + locale) non-US region: the 911 action carries the US-only label too (and still dials)
statusReason: expected 'If you are thinking about harming you…' to contain 'Call 911 (US)'

[Killed] ArrowFunction
src/screens/CrisisScreen.tsx:120:18
       <ActionButton
         label={usFirst ? "Call 911" : "Call 911 (US)"}
         detail="If you are in immediate danger or have already hurt yourself"
-        onPress={() => openExternal("tel:911", "You can still dial 911 from your phone.")}
+        onPress={() => undefined}
         theme={t}
       />
killedBy: CrisisScreen actions opens tel:988 for the lifeline and tel:911 for emergencies
statusReason: expected [ [ 'tel:988' ] ] to deeply equal [ [ 'tel:988' ], [ 'tel:911' ] ]

[Killed] StringLiteral
src/screens/CrisisScreen.tsx:120:48
       <ActionButton
         label={usFirst ? "Call 911" : "Call 911 (US)"}
         detail="If you are in immediate danger or have already hurt yourself"
-        onPress={() => openExternal("tel:911", "You can still dial 911 from your phone.")}
+        onPress={() => openExternal("tel:911", "")}
         theme={t}
       />
killedBy: CrisisScreen failure handling a rejected openURL on "Call 911" surfaces the number/address instead of a dead tap
statusReason: expected "vi.fn()" to be called with arguments: [ 'Couldn\'t open it from here', …(1) ]

Received:

  1st vi.fn() call:

  [
    "Couldn't open it from here",

[Killed] ArrayDeclaration
src/screens/CrisisScreen.tsx:128:14
 
   const helpline = (
     <TouchableOpacity
-      style={[styles.link, { minHeight: t.minTouch, justifyContent: "center" }]}
+      style={[]}
       hitSlop={t.touchSlop}
       onPress={() => openExternal("https://findahelpline.com", "You can still visit findahelpline.com in a browser.")}
killedBy: CrisisScreen pins: the full StyleSheet contract renders every base style object exactly ({} and string mutants die)
statusReason: style not rendered: {"padding":4}
rendered styles:
{"flex":1}
{"backgroundColor":"#0f1115"}
{"fontSize":20,"fontWeight":"700","lineHeight":27}
{"color":"#e8eaf0"}
{"fontSize":15,"lineHeight":22}
{"color":"#b6bdc9"}

[Killed] StringLiteral
src/screens/CrisisScreen.tsx:128:69
 
   const helpline = (
     <TouchableOpacity
-      style={[styles.link, { minHeight: t.minTouch, justifyContent: "center" }]}
+      style={[styles.link, { minHeight: t.minTouch, justifyContent: "" }]}
       hitSlop={t.touchSlop}
       onPress={() => openExternal("https://findahelpline.com", "You can still visit findahelpline.com in a browser.")}
killedBy: CrisisScreen pins: the full StyleSheet contract the helpline link carries [link, {minHeight, justifyContent: center}] and its exact hitSlop
statusReason: expected [ { padding: 4 }, …(1) ] to deeply equal [ { padding: 4 }, …(1) ]

[Killed] ArrowFunction
src/screens/CrisisScreen.tsx:130:16
     <TouchableOpacity
       style={[styles.link, { minHeight: t.minTouch, justifyContent: "center" }]}
       hitSlop={t.touchSlop}
-      onPress={() => openExternal("https://findahelpline.com", "You can still visit findahelpline.com in a browser.")}
+      onPress={() => undefined}
       accessibilityRole="link"
       accessibilityLabel="Open findahelpline.com — crisis lines worldwide"
killedBy: CrisisScreen actions opens findahelpline.com for non-US users
statusReason: expected "vi.fn()" to be called with arguments: [ 'https://findahelpline.com' ]

Number of calls: 0

[Killed] StringLiteral
src/screens/CrisisScreen.tsx:130:64
     <TouchableOpacity
       style={[styles.link, { minHeight: t.minTouch, justifyContent: "center" }]}
       hitSlop={t.touchSlop}
-      onPress={() => openExternal("https://findahelpline.com", "You can still visit findahelpline.com in a browser.")}
+      onPress={() => openExternal("https://findahelpline.com", "")}
       accessibilityRole="link"
       accessibilityLabel="Open findahelpline.com — crisis lines worldwide"
killedBy: CrisisScreen failure handling a rejected openURL on "Open findahelpline.com" surfaces the number/address instead of a dead tap
statusReason: expected "vi.fn()" to be called with arguments: [ 'Couldn\'t open it from here', …(1) ]

Received:

  1st vi.fn() call:

  [
    "Couldn't open it from here",

[Killed] ArrayDeclaration
src/screens/CrisisScreen.tsx:143:20
       style={[styles.container, { backgroundColor: t.colors.bg }]}
       contentContainerStyle={{ padding: t.spacing.xl, gap: 14 }}
     >
-      <Text style={[styles.headline, { color: t.colors.text }]}>If you are thinking about harming yourself</Text>
+      <Text style={[]}>If you are thinking about harming yourself</Text>
       <Text style={[styles.body, { color: t.colors.body }]}>
         Please reach out right now. These services are free, confidential, and staffed by trained
killedBy: CrisisScreen pins: the full StyleSheet contract renders every base style object exactly ({} and string mutants die)
statusReason: style not rendered: {"fontSize":20,"fontWeight":"700","lineHeight":27}
rendered styles:
{"flex":1}
{"backgroundColor":"#0f1115"}
{"fontSize":15,"lineHeight":22}
{"color":"#b6bdc9"}
{"fontSize":15,"lineHeight":22}
{"color":"#b6bdc9"}

[Killed] ArrayDeclaration
src/screens/CrisisScreen.tsx:144:20
       contentContainerStyle={{ padding: t.spacing.xl, gap: 14 }}
     >
       <Text style={[styles.headline, { color: t.colors.text }]}>If you are thinking about harming yourself</Text>
-      <Text style={[styles.body, { color: t.colors.body }]}>
+      <Text style={[]}>
         Please reach out right now. These services are free, confidential, and staffed by trained
         people — 24 hours a day.
killedBy: CrisisScreen pins: themed text overlays pinned to their own nodes US layout: headline, both static bodies, the US note and the disclaimer note
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] ObjectLiteral
src/screens/CrisisScreen.tsx:148:34
         Please reach out right now. These services are free, confidential, and staffed by trained
         people — 24 hours a day.
       </Text>
-      <Text style={[styles.body, { color: t.colors.body }]}>
+      <Text style={[styles.body, {}]}>
         What to expect when you call or text: a trained counselor answers, and you can say as much
         or as little as you want — there is no script and no wrong way to start.
killedBy: CrisisScreen pins: the full StyleSheet contract renders every base style object exactly ({} and string mutants die)
statusReason: expected [ { flex: 1 }, …(53) ] to not deep equally contain {}

[Killed] ArrayDeclaration
src/screens/CrisisScreen.tsx:156:24
       {usFirst ? (
         <>
           {usServices}
-          <Text style={[styles.body, { color: t.colors.body }]}>
+          <Text style={[]}>
             These are US services. Outside the US, find your local line at findahelpline.com.
           </Text>
killedBy: CrisisScreen pins: themed text overlays pinned to their own nodes US layout: headline, both static bodies, the US note and the disclaimer note
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] ObjectLiteral
src/screens/CrisisScreen.tsx:163:38
         </>
       ) : (
         <>
-          <Text style={[styles.body, { color: t.colors.body }]}>
+          <Text style={[styles.body, {}]}>
             Your region doesn't look like the US — find your local line first:
           </Text>
killedBy: CrisisScreen pins: themed text overlays pinned to their own nodes non-US layout: both region bodies carry the same body-color overlays
statusReason: expected [ Array(2) ] to deeply equal [ …(2) ]

[Killed] ObjectLiteral
src/screens/CrisisScreen.tsx:185:13
 
 const styles = StyleSheet.create({
   container: { flex: 1 },
-  headline: { fontSize: 20, fontWeight: "700", lineHeight: 27 },
+  headline: {},
   body: { fontSize: 15, lineHeight: 22 },
   action: {
killedBy: CrisisScreen pins: the full StyleSheet contract renders every base style object exactly ({} and string mutants die)
statusReason: style not rendered: {"fontSize":20,"fontWeight":"700","lineHeight":27}
rendered styles:
{"flex":1}
{"backgroundColor":"#0f1115"}
{}
{"color":"#e8eaf0"}
{"fontSize":15,"lineHeight":22}
{"color":"#b6bdc9"}

[Killed] StringLiteral
src/screens/CrisisScreen.tsx:188:20
   headline: { fontSize: 20, fontWeight: "700", lineHeight: 27 },
   body: { fontSize: 15, lineHeight: 22 },
   action: {
-    flexDirection: "row",
+    flexDirection: "",
     alignItems: "center",
     padding: 16,
killedBy: CrisisScreen pins: the full StyleSheet contract renders every base style object exactly ({} and string mutants die)
statusReason: style not rendered: {"flexDirection":"row","alignItems":"center","padding":16,"gap":12}
rendered styles:
{"flex":1}
{"backgroundColor":"#0f1115"}
{"fontSize":20,"fontWeight":"700","lineHeight":27}
{"color":"#e8eaf0"}
{"fontSize":15,"lineHeight":22}
{"color":"#b6bdc9"}

[Killed] StringLiteral
src/screens/CrisisScreen.tsx:193:44
     padding: 16,
     gap: 12,
   },
-  actionLabel: { fontSize: 16, fontWeight: "700" },
+  actionLabel: { fontSize: 16, fontWeight: "" },
   actionDetail: { marginTop: 3, lineHeight: 18 },
   actionGo: { fontSize: 14, fontWeight: "700" },
killedBy: CrisisScreen pins: the full StyleSheet contract renders every base style object exactly ({} and string mutants die)
statusReason: style not rendered: {"fontSize":16,"fontWeight":"700"}
rendered styles:
{"flex":1}
{"backgroundColor":"#0f1115"}
{"fontSize":20,"fontWeight":"700","lineHeight":27}
{"color":"#e8eaf0"}
{"fontSize":15,"lineHeight":22}
{"color":"#b6bdc9"}

[Killed] ObjectLiteral
src/screens/CrisisScreen.tsx:198:12
   actionGo: { fontSize: 14, fontWeight: "700" },
   link: { padding: 4 },
   linkText: { fontSize: 15, fontWeight: "600" },
-  divider: { height: 1, marginTop: 6 },
+  divider: {},
   note: { fontSize: 12, lineHeight: 18 },
 });
killedBy: CrisisScreen pins: the full StyleSheet contract renders every base style object exactly ({} and string mutants die)
statusReason: style not rendered: {"height":1,"marginTop":6}
rendered styles:
{"flex":1}
{"backgroundColor":"#0f1115"}
{"fontSize":20,"fontWeight":"700","lineHeight":27}
{"color":"#e8eaf0"}
{"fontSize":15,"lineHeight":22}
{"color":"#b6bdc9"}

[Killed] ObjectLiteral
src/screens/CrisisScreen.tsx:199:9
   link: { padding: 4 },
   linkText: { fontSize: 15, fontWeight: "600" },
   divider: { height: 1, marginTop: 6 },
-  note: { fontSize: 12, lineHeight: 18 },
+  note: {},
 });
 
killedBy: CrisisScreen pins: the full StyleSheet contract renders every base style object exactly ({} and string mutants die)
statusReason: style not rendered: {"fontSize":12,"lineHeight":18}
rendered styles:
{"flex":1}
{"backgroundColor":"#0f1115"}
{"fontSize":20,"fontWeight":"700","lineHeight":27}
{"color":"#e8eaf0"}
{"fontSize":15,"lineHeight":22}
{"color":"#b6bdc9"}
