[Killed] StringLiteral
src/screens/UnlockScreen.tsx:49:44
 export function UnlockScreen({ navigation }: { navigation: any }): React.JSX.Element {
   const t = useTheme();
   const { signOut, refreshActiveDays } = useSession();
-  const [password, setPassword] = useState("");
+  const [password, setPassword] = useState("Stryker was here!");
   const [busy, setBusy] = useState(false);
 
killedBy: UnlockScreen renders the locked gate with a disabled unlock button until a password is typed
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/screens/UnlockScreen.tsx:53:9
   const [busy, setBusy] = useState(false);
 
   const unlock = async () => {
-    if (!password || busy) return;
+    if (password || busy) return;
     setBusy(true);
     let derived: Keys | null = null;
killedBy: UnlockScreen re-derives keys, re-verifies and unlocks the vault
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/screens/UnlockScreen.tsx:53:9
   const [busy, setBusy] = useState(false);
 
   const unlock = async () => {
-    if (!password || busy) return;
+    if (true) return;
     setBusy(true);
     let derived: Keys | null = null;
killedBy: UnlockScreen pins a verified online unlock binds the vault to the stored account id
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/screens/UnlockScreen.tsx:54:13
 
   const unlock = async () => {
     if (!password || busy) return;
-    setBusy(true);
+    setBusy(false);
     let derived: Keys | null = null;
     try {
killedBy: UnlockScreen ignores a second unlock press while one is in flight
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
src/screens/UnlockScreen.tsx:58:11
     let derived: Keys | null = null;
     try {
       const username = await api.getUsername();
-      if (!username) throw new Error("no saved account on this device — please sign in");
+      if (false) throw new Error("no saved account on this device — please sign in");
       let saltB64: string;
       let offline = false;
killedBy: UnlockScreen refuses to unlock when no saved account exists
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/screens/UnlockScreen.tsx:58:11
     let derived: Keys | null = null;
     try {
       const username = await api.getUsername();
-      if (!username) throw new Error("no saved account on this device — please sign in");
+      if (true) throw new Error("no saved account on this device — please sign in");
       let saltB64: string;
       let offline = false;
killedBy: UnlockScreen re-derives keys, re-verifies and unlocks the vault
statusReason: expected "vi.fn()" to be called with arguments: [ 'alice' ]

Number of calls: 0

[Killed] BooleanLiteral
src/screens/UnlockScreen.tsx:60:21
       const username = await api.getUsername();
       if (!username) throw new Error("no saved account on this device — please sign in");
       let saltB64: string;
-      let offline = false;
+      let offline = true;
       try {
         const { salt } = await api.saltFor(username);
killedBy: UnlockScreen re-derives keys, re-verifies and unlocks the vault
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/screens/UnlockScreen.tsx:61:11
       if (!username) throw new Error("no saved account on this device — please sign in");
       let saltB64: string;
       let offline = false;
-      try {
-        const { salt } = await api.saltFor(username);
-        saltB64 = salt;
-        // Cache the (public, origin-bound) salt: it is what makes the NEXT
-        // unlock work when the network is unreachable.
-        await api.cacheSalt(username, salt);
-      } catch (saltErr) {
+      try {} catch (saltErr) {
         // Offline with a cached salt: derive keys locally. Unlocking the
         // vault never needed a bearer token — sync just fails and retries.
killedBy: UnlockScreen re-derives keys, re-verifies and unlocks the vault
statusReason: expected "vi.fn()" to be called with arguments: [ 'alice' ]

Number of calls: 0

[Killed] BlockStatement
src/screens/UnlockScreen.tsx:67:25
         // Cache the (public, origin-bound) salt: it is what makes the NEXT
         // unlock work when the network is unreachable.
         await api.cacheSalt(username, salt);
-      } catch (saltErr) {
-        // Offline with a cached salt: derive keys locally. Unlocking the
-        // vault never needed a bearer token — sync just fails and retries.
-        const cached = await api.getCachedSalt(username);
-        if (!cached) throw saltErr;
-        saltB64 = cached;
-        offline = true; // the salt fetch already proved the network dead
-      }
+      } catch (saltErr) {}
       // Async derivation: no 100–400ms JS-thread freeze mid-flow.
       derived = await deriveKeysAsync(password, Buffer.from(saltB64, "base64"));
killedBy: UnlockScreen unlocks OFFLINE using the cached salt — no login round-trip, no token
statusReason: expected "vi.fn()" to be called with arguments: [ 'correct horse', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
src/screens/UnlockScreen.tsx:71:13
         // Offline with a cached salt: derive keys locally. Unlocking the
         // vault never needed a bearer token — sync just fails and retries.
         const cached = await api.getCachedSalt(username);
-        if (!cached) throw saltErr;
+        if (false) throw saltErr;
         saltB64 = cached;
         offline = true; // the salt fetch already proved the network dead
killedBy: UnlockScreen offline with no cached salt: honest error, locked vault, crisis still reachable
statusReason: expected "vi.fn()" to be called with arguments: [ 'Unlock failed', …(1) ]

Received:

  1st vi.fn() call:

  [
    "Unlock failed",

[Killed] ConditionalExpression
src/screens/UnlockScreen.tsx:71:13
         // Offline with a cached salt: derive keys locally. Unlocking the
         // vault never needed a bearer token — sync just fails and retries.
         const cached = await api.getCachedSalt(username);
-        if (!cached) throw saltErr;
+        if (true) throw saltErr;
         saltB64 = cached;
         offline = true; // the salt fetch already proved the network dead
killedBy: UnlockScreen unlocks OFFLINE using the cached salt — no login round-trip, no token
statusReason: expected "vi.fn()" to be called with arguments: [ 'correct horse', …(1) ]

Number of calls: 0

[Killed] BooleanLiteral
src/screens/UnlockScreen.tsx:73:19
         const cached = await api.getCachedSalt(username);
         if (!cached) throw saltErr;
         saltB64 = cached;
-        offline = true; // the salt fetch already proved the network dead
+        offline = false; // the salt fetch already proved the network dead
       }
       // Async derivation: no 100–400ms JS-thread freeze mid-flow.
killedBy: UnlockScreen unlocks OFFLINE using the cached salt — no login round-trip, no token
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "alice",

[Killed] BooleanLiteral
src/screens/UnlockScreen.tsx:78:28
       // Async derivation: no 100–400ms JS-thread freeze mid-flow.
       derived = await deriveKeysAsync(password, Buffer.from(saltB64, "base64"));
       const keys = derived;
-      let verifiedOnline = false;
+      let verifiedOnline = true;
       if (!offline) {
         try {
killedBy: UnlockScreen REFUSES a wrong password offline (sealed proof fails)
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/screens/UnlockScreen.tsx:79:21
       derived = await deriveKeysAsync(password, Buffer.from(saltB64, "base64"));
       const keys = derived;
       let verifiedOnline = false;
-      if (!offline) {
-        try {
-          const body = await api.login(username, keys.authKey.toString("base64"));
-          await api.setSession(body.token, body.user_id, username);
-          // Verified against the server: refresh the sealed proof so the
-          // next offline unlock checks against this very key.
-          await storeUnlockProof(keys.dataKey, body.user_id);
-          verifiedOnline = true;
-        } catch (loginErr) {
-          // A definitive wrong-password rejection is never an offline case.
-          if (loginErr instanceof ApiError && loginErr.status === 401) throw loginErr;
-          // Otherwise (network died mid-flow): fall through to the sealed
-          // proof below — it verifies the password without the server.
-        }
-      }
+      if (!offline) {}
       if (!verifiedOnline) {
         // OFFLINE PATH — must be VERIFIED, never assumed. The sealed
killedBy: UnlockScreen re-derives keys, re-verifies and unlocks the vault
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/screens/UnlockScreen.tsx:79:11
       derived = await deriveKeysAsync(password, Buffer.from(saltB64, "base64"));
       const keys = derived;
       let verifiedOnline = false;
-      if (!offline) {
+      if (true) {
         try {
           const body = await api.login(username, keys.authKey.toString("base64"));
killedBy: UnlockScreen unlocks OFFLINE using the cached salt — no login round-trip, no token
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "alice",

[Killed] BlockStatement
src/screens/UnlockScreen.tsx:80:13
       const keys = derived;
       let verifiedOnline = false;
       if (!offline) {
-        try {
-          const body = await api.login(username, keys.authKey.toString("base64"));
-          await api.setSession(body.token, body.user_id, username);
-          // Verified against the server: refresh the sealed proof so the
-          // next offline unlock checks against this very key.
-          await storeUnlockProof(keys.dataKey, body.user_id);
-          verifiedOnline = true;
-        } catch (loginErr) {
+        try {} catch (loginErr) {
           // A definitive wrong-password rejection is never an offline case.
           if (loginErr instanceof ApiError && loginErr.status === 401) throw loginErr;
killedBy: UnlockScreen re-derives keys, re-verifies and unlocks the vault
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
src/screens/UnlockScreen.tsx:86:28
           // Verified against the server: refresh the sealed proof so the
           // next offline unlock checks against this very key.
           await storeUnlockProof(keys.dataKey, body.user_id);
-          verifiedOnline = true;
+          verifiedOnline = false;
         } catch (loginErr) {
           // A definitive wrong-password rejection is never an offline case.
killedBy: UnlockScreen a successful online unlock tolerates a missing stored user id
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/screens/UnlockScreen.tsx:87:28
           // next offline unlock checks against this very key.
           await storeUnlockProof(keys.dataKey, body.user_id);
           verifiedOnline = true;
-        } catch (loginErr) {
-          // A definitive wrong-password rejection is never an offline case.
-          if (loginErr instanceof ApiError && loginErr.status === 401) throw loginErr;
-          // Otherwise (network died mid-flow): fall through to the sealed
-          // proof below — it verifies the password without the server.
-        }
+        } catch (loginErr) {}
       }
       if (!verifiedOnline) {
killedBy: UnlockScreen says 'Wrong password.' specifically on 401
statusReason: expected "vi.fn()" to be called with arguments: [ 'Unlock failed', 'Wrong password.' ]

Number of calls: 0

[Killed] EqualityOperator
src/screens/UnlockScreen.tsx:89:47
           verifiedOnline = true;
         } catch (loginErr) {
           // A definitive wrong-password rejection is never an offline case.
-          if (loginErr instanceof ApiError && loginErr.status === 401) throw loginErr;
+          if (loginErr instanceof ApiError && loginErr.status !== 401) throw loginErr;
           // Otherwise (network died mid-flow): fall through to the sealed
           // proof below — it verifies the password without the server.
killedBy: UnlockScreen a non-401 login failure falls back to the sealed proof (not to blind trust)
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/screens/UnlockScreen.tsx:89:15
           verifiedOnline = true;
         } catch (loginErr) {
           // A definitive wrong-password rejection is never an offline case.
-          if (loginErr instanceof ApiError && loginErr.status === 401) throw loginErr;
+          if (true) throw loginErr;
           // Otherwise (network died mid-flow): fall through to the sealed
           // proof below — it verifies the password without the server.
killedBy: UnlockScreen a non-401 login failure falls back to the sealed proof (not to blind trust)
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/screens/UnlockScreen.tsx:94:28
           // proof below — it verifies the password without the server.
         }
       }
-      if (!verifiedOnline) {
-        // OFFLINE PATH — must be VERIFIED, never assumed. The sealed
-        // marker only opens under the correct data key.
-        const userId = await api.getUserId();
-        if (!userId) throw new Error("no saved account on this device — please sign in");
-        const proof = await verifyUnlockProof(keys.dataKey, userId);
-        if (proof === "absent") {
-          throw new Error(
-            "offline unlock is not enabled on this device yet — sign in once while online to enable it",
-          );
-        }
-        if (proof === "wrong") {
-          await new Promise((resolve) => setTimeout(resolve, FAILED_PROOF_DELAY_MS));
-          // Stryker disable next-line StringLiteral: dead message — the catch maps ANY 401 to the constant "Wrong password." dialog, so this thrown text is never read
-          throw new ApiError(401, "Wrong password.");
-        }
-      }
+      if (!verifiedOnline) {}
       vault.unlock(derived, (await api.getUserId()) ?? undefined); // vault takes ownership and zeroizes the master key
       derived = null;
killedBy: UnlockScreen REFUSES a wrong password offline (sealed proof fails)
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/screens/UnlockScreen.tsx:94:11
           // proof below — it verifies the password without the server.
         }
       }
-      if (!verifiedOnline) {
+      if (verifiedOnline) {
         // OFFLINE PATH — must be VERIFIED, never assumed. The sealed
         // marker only opens under the correct data key.
killedBy: UnlockScreen REFUSES a wrong password offline (sealed proof fails)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/screens/UnlockScreen.tsx:98:13
         // OFFLINE PATH — must be VERIFIED, never assumed. The sealed
         // marker only opens under the correct data key.
         const userId = await api.getUserId();
-        if (!userId) throw new Error("no saved account on this device — please sign in");
+        if (false) throw new Error("no saved account on this device — please sign in");
         const proof = await verifyUnlockProof(keys.dataKey, userId);
         if (proof === "absent") {
killedBy: UnlockScreen offline path with no saved account id: honest error, locked vault
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/screens/UnlockScreen.tsx:98:13
         // OFFLINE PATH — must be VERIFIED, never assumed. The sealed
         // marker only opens under the correct data key.
         const userId = await api.getUserId();
-        if (!userId) throw new Error("no saved account on this device — please sign in");
+        if (userId) throw new Error("no saved account on this device — please sign in");
         const proof = await verifyUnlockProof(keys.dataKey, userId);
         if (proof === "absent") {
killedBy: UnlockScreen unlocks OFFLINE using the cached salt — no login round-trip, no token
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/screens/UnlockScreen.tsx:100:13
         const userId = await api.getUserId();
         if (!userId) throw new Error("no saved account on this device — please sign in");
         const proof = await verifyUnlockProof(keys.dataKey, userId);
-        if (proof === "absent") {
+        if (false) {
           throw new Error(
             "offline unlock is not enabled on this device yet — sign in once while online to enable it",
killedBy: UnlockScreen refuses offline unlock when no proof was ever sealed (first-run device)
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/screens/UnlockScreen.tsx:100:13
         const userId = await api.getUserId();
         if (!userId) throw new Error("no saved account on this device — please sign in");
         const proof = await verifyUnlockProof(keys.dataKey, userId);
-        if (proof === "absent") {
+        if (proof !== "absent") {
           throw new Error(
             "offline unlock is not enabled on this device yet — sign in once while online to enable it",
killedBy: UnlockScreen unlocks OFFLINE using the cached salt — no login round-trip, no token
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/screens/UnlockScreen.tsx:105:13
             "offline unlock is not enabled on this device yet — sign in once while online to enable it",
           );
         }
-        if (proof === "wrong") {
+        if (true) {
           await new Promise((resolve) => setTimeout(resolve, FAILED_PROOF_DELAY_MS));
           // Stryker disable next-line StringLiteral: dead message — the catch maps ANY 401 to the constant "Wrong password." dialog, so this thrown text is never read
killedBy: UnlockScreen unlocks OFFLINE using the cached salt — no login round-trip, no token
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/screens/UnlockScreen.tsx:105:13
             "offline unlock is not enabled on this device yet — sign in once while online to enable it",
           );
         }
-        if (proof === "wrong") {
+        if (proof !== "wrong") {
           await new Promise((resolve) => setTimeout(resolve, FAILED_PROOF_DELAY_MS));
           // Stryker disable next-line StringLiteral: dead message — the catch maps ANY 401 to the constant "Wrong password." dialog, so this thrown text is never read
killedBy: UnlockScreen unlocks OFFLINE using the cached salt — no login round-trip, no token
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/screens/UnlockScreen.tsx:106:29
           );
         }
         if (proof === "wrong") {
-          await new Promise((resolve) => setTimeout(resolve, FAILED_PROOF_DELAY_MS));
+          await new Promise(() => undefined);
           // Stryker disable next-line StringLiteral: dead message — the catch maps ANY 401 to the constant "Wrong password." dialog, so this thrown text is never read
           throw new ApiError(401, "Wrong password.");
killedBy: UnlockScreen REFUSES a wrong password offline (sealed proof fails)
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] CallExpression
src/screens/UnlockScreen.tsx:108:11
         if (proof === "wrong") {
           await new Promise((resolve) => setTimeout(resolve, FAILED_PROOF_DELAY_MS));
           // Stryker disable next-line StringLiteral: dead message — the catch maps ANY 401 to the constant "Wrong password." dialog, so this thrown text is never read
-          throw new ApiError(401, "Wrong password.");
+          ;
         }
       }
killedBy: UnlockScreen REFUSES a wrong password offline (sealed proof fails)
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/screens/UnlockScreen.tsx:111:29
           throw new ApiError(401, "Wrong password.");
         }
       }
-      vault.unlock(derived, (await api.getUserId()) ?? undefined); // vault takes ownership and zeroizes the master key
+      vault.unlock(derived, (await api.getUserId()) && undefined); // vault takes ownership and zeroizes the master key
       derived = null;
       setPassword(""); // minimize the password's lifetime in memory
killedBy: UnlockScreen pins a verified online unlock binds the vault to the stored account id
statusReason: expected null to be 'user-1' // Object.is equality

[Killed] BlockStatement
src/screens/UnlockScreen.tsx:115:19
       derived = null;
       setPassword(""); // minimize the password's lifetime in memory
       await refreshActiveDays();
-    } catch (err) {
-      if (derived) zeroize(derived.masterKey, derived.authKey, derived.dataKey);
-      vault.lock(); // a failed unlock must never leave stale keys live
-      // 401 = wrong password (our own sealed proof throws the same). Other
-      // ApiErrors map to calm copy; our own local Error text passes through.
-      const message =
-        err instanceof ApiError && err.status === 401
-          ? "Wrong password."
-          : requestFailureCopy(err);
-      Alert.alert("Unlock failed", message);
-    } finally {
+    } catch (err) {} finally {
       setBusy(false);
     }
killedBy: UnlockScreen REFUSES a wrong password offline (sealed proof fails)
statusReason: expected "vi.fn()" to be called with arguments: [ 'Unlock failed', 'Wrong password.' ]

Number of calls: 0

[Killed] ConditionalExpression
src/screens/UnlockScreen.tsx:116:11
       setPassword(""); // minimize the password's lifetime in memory
       await refreshActiveDays();
     } catch (err) {
-      if (derived) zeroize(derived.masterKey, derived.authKey, derived.dataKey);
+      if (true) zeroize(derived.masterKey, derived.authKey, derived.dataKey);
       vault.lock(); // a failed unlock must never leave stale keys live
       // 401 = wrong password (our own sealed proof throws the same). Other
killedBy: UnlockScreen offline with no cached salt: honest error, locked vault, crisis still reachable
statusReason: Cannot read properties of null (reading 'masterKey')

[Killed] CallExpression
src/screens/UnlockScreen.tsx:116:20
       setPassword(""); // minimize the password's lifetime in memory
       await refreshActiveDays();
     } catch (err) {
-      if (derived) zeroize(derived.masterKey, derived.authKey, derived.dataKey);
+      if (derived) ;
       vault.lock(); // a failed unlock must never leave stale keys live
       // 401 = wrong password (our own sealed proof throws the same). Other
killedBy: UnlockScreen zeroizes keys that failed to unlock and stays locked
statusReason: expected false to be true // Object.is equality

[Killed] CallExpression
src/screens/UnlockScreen.tsx:117:7
       await refreshActiveDays();
     } catch (err) {
       if (derived) zeroize(derived.masterKey, derived.authKey, derived.dataKey);
-      vault.lock(); // a failed unlock must never leave stale keys live
+      ; // a failed unlock must never leave stale keys live
       // 401 = wrong password (our own sealed proof throws the same). Other
       // ApiErrors map to calm copy; our own local Error text passes through.
killedBy: UnlockScreen a non-Error login rejection falls to the sealed proof
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/screens/UnlockScreen.tsx:121:9
       // 401 = wrong password (our own sealed proof throws the same). Other
       // ApiErrors map to calm copy; our own local Error text passes through.
       const message =
-        err instanceof ApiError && err.status === 401
+        true
           ? "Wrong password."
           : requestFailureCopy(err);
killedBy: UnlockScreen refuses offline unlock when no proof was ever sealed (first-run device)
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Received:

  1st vi.fn() call:

  [
    "Unlock failed",

[Killed] EqualityOperator
src/screens/UnlockScreen.tsx:121:36
       // 401 = wrong password (our own sealed proof throws the same). Other
       // ApiErrors map to calm copy; our own local Error text passes through.
       const message =
-        err instanceof ApiError && err.status === 401
+        err instanceof ApiError && err.status !== 401
           ? "Wrong password."
           : requestFailureCopy(err);
killedBy: UnlockScreen REFUSES a wrong password offline (sealed proof fails)
statusReason: expected "vi.fn()" to be called with arguments: [ 'Unlock failed', 'Wrong password.' ]

Received:

  1st vi.fn() call:

  [
    "Unlock failed",

[Killed] StringLiteral
src/screens/UnlockScreen.tsx:124:19
         err instanceof ApiError && err.status === 401
           ? "Wrong password."
           : requestFailureCopy(err);
-      Alert.alert("Unlock failed", message);
+      Alert.alert("", message);
     } finally {
       setBusy(false);
killedBy: UnlockScreen REFUSES a wrong password offline (sealed proof fails)
statusReason: expected "vi.fn()" to be called with arguments: [ 'Unlock failed', 'Wrong password.' ]

Received:

  1st vi.fn() call:

  [
-   "Unlock failed",

[Killed] BlockStatement
src/screens/UnlockScreen.tsx:125:15
           ? "Wrong password."
           : requestFailureCopy(err);
       Alert.alert("Unlock failed", message);
-    } finally {
-      setBusy(false);
-    }
+    } finally {}
   };
 
killedBy: UnlockScreen re-derives keys, re-verifies and unlocks the vault
statusReason: no Text node containing "Unlock":
Locked | Your journal is encrypted with keys only you hold. Re-enter your password to unlock this device. When you ask for your patterns, the key visits the server once — held in memory, then destroyed. Nothing else ever leaves. | Sign out instead | Need help now? Crisis resources

[Killed] ArrayDeclaration
src/screens/UnlockScreen.tsx:132:14
 
   return (
     <KeyboardAvoidingView
-      style={[styles.container, { backgroundColor: t.colors.bg, padding: t.spacing.xxxl, gap: t.spacing.md }]}
+      style={[]}
       behavior={Platform.OS === "ios" ? "padding" : undefined}
     >
killedBy: UnlockScreen pins the visual language of the screen
statusReason: style not rendered: {"flex":1,"justifyContent":"center"}
rendered styles:
{"fontSize":34,"fontWeight":"700","textAlign":"center"}
{"color":"#e8eaf0"}
{"textAlign":"center","marginBottom":24,"lineHeight":20}
{"color":"#8a91a3","fontSize":14}
{"backgroundColor":"#1a1e26","color":"#e8eaf0","borderRadius":10,"padding":14,"fontSize":16}
{"borderRadius":10,"padding":16,"alignItems":"center","justifyCont

[Killed] ConditionalExpression
src/screens/UnlockScreen.tsx:133:17
   return (
     <KeyboardAvoidingView
       style={[styles.container, { backgroundColor: t.colors.bg, padding: t.spacing.xxxl, gap: t.spacing.md }]}
-      behavior={Platform.OS === "ios" ? "padding" : undefined}
+      behavior={true ? "padding" : undefined}
     >
       <ScrollView
killedBy: UnlockScreen uses the padding keyboard behavior on iOS and none on Android
statusReason: expected 'padding' to be undefined

[Killed] ConditionalExpression
src/screens/UnlockScreen.tsx:133:17
   return (
     <KeyboardAvoidingView
       style={[styles.container, { backgroundColor: t.colors.bg, padding: t.spacing.xxxl, gap: t.spacing.md }]}
-      behavior={Platform.OS === "ios" ? "padding" : undefined}
+      behavior={false ? "padding" : undefined}
     >
       <ScrollView
killedBy: UnlockScreen uses the padding keyboard behavior on iOS and none on Android
statusReason: expected undefined to be 'padding' // Object.is equality

[Survived] StringLiteral
src/screens/UnlockScreen.tsx:136:63
       behavior={Platform.OS === "ios" ? "padding" : undefined}
     >
       <ScrollView
-        contentContainerStyle={{ flexGrow: 1, justifyContent: "center", gap: t.spacing.md }}
+        contentContainerStyle={{ flexGrow: 1, justifyContent: "", gap: t.spacing.md }}
         keyboardShouldPersistTaps="handled"
       >

[Killed] ArrayDeclaration
src/screens/UnlockScreen.tsx:139:20
         contentContainerStyle={{ flexGrow: 1, justifyContent: "center", gap: t.spacing.md }}
         keyboardShouldPersistTaps="handled"
       >
-      <Text style={[styles.title, { color: t.colors.text }]} maxFontSizeMultiplier={1.6}>
+      <Text style={[]} maxFontSizeMultiplier={1.6}>
         Locked
       </Text>
killedBy: UnlockScreen pins the visual language of the screen
statusReason: style not rendered: {"fontSize":34,"fontWeight":"700","textAlign":"center"}
rendered styles:
{"flex":1,"justifyContent":"center"}
{"backgroundColor":"#0f1115","padding":32,"gap":12}
{"textAlign":"center","marginBottom":24,"lineHeight":20}
{"color":"#8a91a3","fontSize":14}
{"backgroundColor":"#1a1e26","color":"#e8eaf0","borderRadius":10,"padding":14,"fontSize":16}
{"borderRadius":10,"padding":16,"a
