[Killed] ObjectLiteral
src/screens/UnlockScreen.tsx:148:16
         then destroyed. Nothing else ever leaves.
       </Text>
       <TextInput
-        style={{
-          backgroundColor: t.colors.card,
-          color: t.colors.text,
-          borderRadius: t.radius.md,
-          padding: 14,
-          fontSize: 16,
-        }}
+        style={{}}
         placeholder="password"
         placeholderTextColor={t.colors.placeholder}
killedBy: UnlockScreen pins the visual language of the screen
statusReason: style not rendered: {"backgroundColor":"#1a1e26","color":"#e8eaf0","borderRadius":10,"padding":14,"fontSize":16}
rendered styles:
{"flex":1,"justifyContent":"center"}
{"backgroundColor":"#0f1115","padding":32,"gap":12}
{"fontSize":34,"fontWeight":"700","textAlign":"center"}
{"color":"#e8eaf0"}
{"textAlign":"center","marginBottom":24,"lineHeight":20}
{"color":"#8a91a3","fontSize":14}

[Killed] BooleanLiteral
src/screens/UnlockScreen.tsx:165:64
         textContentType="password"
         autoComplete="current-password"
       />
-      <PrimaryButton label="Unlock" onPress={unlock} disabled={!password} busy={busy} />
+      <PrimaryButton label="Unlock" onPress={unlock} disabled={password} busy={busy} />
       <GhostButton label="Sign out instead" onPress={() => void signOut()} />
       {/* Crisis help needs no unlock and no network — the locked state is
killedBy: UnlockScreen renders the locked gate with a disabled unlock button until a password is typed
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/screens/UnlockScreen.tsx:166:54
         autoComplete="current-password"
       />
       <PrimaryButton label="Unlock" onPress={unlock} disabled={!password} busy={busy} />
-      <GhostButton label="Sign out instead" onPress={() => void signOut()} />
+      <GhostButton label="Sign out instead" onPress={() => undefined} />
       {/* Crisis help needs no unlock and no network — the locked state is
           exactly when it must be one tap away. */}
killedBy: UnlockScreen offers sign-out instead
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ArrowFunction
src/screens/UnlockScreen.tsx:169:34
       <GhostButton label="Sign out instead" onPress={() => void signOut()} />
       {/* Crisis help needs no unlock and no network — the locked state is
           exactly when it must be one tap away. */}
-      <CrisisHelpButton onPress={() => navigation.navigate("Crisis")} />
+      <CrisisHelpButton onPress={() => undefined} />
       </ScrollView>
     </KeyboardAvoidingView>
killedBy: UnlockScreen offers crisis resources from the locked state without unlocking
statusReason: expected "vi.fn()" to be called with arguments: [ 'Crisis' ]

Number of calls: 0

[Killed] ObjectLiteral
src/screens/UnlockScreen.tsx:175:34
   );
 }
 
-const styles = StyleSheet.create({
-  container: { flex: 1, justifyContent: "center" },
-  title: { fontSize: 34, fontWeight: "700", textAlign: "center" },
-  subtitle: { textAlign: "center", marginBottom: 24, lineHeight: 20 },
-});
+const styles = StyleSheet.create({});
 
killedBy: UnlockScreen pins the visual language of the screen
statusReason: style not rendered: {"flex":1,"justifyContent":"center"}
rendered styles:
{"backgroundColor":"#0f1115","padding":32,"gap":12}
{"color":"#e8eaf0"}
{"color":"#8a91a3","fontSize":14}
{"backgroundColor":"#1a1e26","color":"#e8eaf0","borderRadius":10,"padding":14,"fontSize":16}
{"borderRadius":10,"padding":16,"alignItems":"center","justifyContent":"center"}
{"backgroundColor":"#3b5bdb","minHeight":44}

[Killed] ObjectLiteral
src/screens/UnlockScreen.tsx:177:10
 
 const styles = StyleSheet.create({
   container: { flex: 1, justifyContent: "center" },
-  title: { fontSize: 34, fontWeight: "700", textAlign: "center" },
+  title: {},
   subtitle: { textAlign: "center", marginBottom: 24, lineHeight: 20 },
 });
killedBy: UnlockScreen pins the visual language of the screen
statusReason: style not rendered: {"fontSize":34,"fontWeight":"700","textAlign":"center"}
rendered styles:
{"flex":1,"justifyContent":"center"}
{"backgroundColor":"#0f1115","padding":32,"gap":12}
{}
{"color":"#e8eaf0"}
{"textAlign":"center","marginBottom":24,"lineHeight":20}
{"color":"#8a91a3","fontSize":14}

[Killed] StringLiteral
src/screens/UnlockScreen.tsx:177:38
 
 const styles = StyleSheet.create({
   container: { flex: 1, justifyContent: "center" },
-  title: { fontSize: 34, fontWeight: "700", textAlign: "center" },
+  title: { fontSize: 34, fontWeight: "", textAlign: "center" },
   subtitle: { textAlign: "center", marginBottom: 24, lineHeight: 20 },
 });
killedBy: UnlockScreen pins the visual language of the screen
statusReason: style not rendered: {"fontSize":34,"fontWeight":"700","textAlign":"center"}
rendered styles:
{"flex":1,"justifyContent":"center"}
{"backgroundColor":"#0f1115","padding":32,"gap":12}
{"fontSize":34,"fontWeight":"","textAlign":"center"}
{"color":"#e8eaf0"}
{"textAlign":"center","marginBottom":24,"lineHeight":20}
{"color":"#8a91a3","fontSize":14}
