[Killed] BlockStatement
src/components/InlineStatus.tsx:17:109
 /** A one-line status ("Saved ✓" / "Saved — will sync when online"). The
  *  parent owns the lifetime: set the message, clear it after a moment.
  *  Announced politely to screen readers (live region). */
-export function InlineStatus({ message, tone = "ok" }: { message: string | null; tone?: InlineStatusTone }) {
-  const t = useTheme();
-  if (!message) return null;
-  return (
-    <View
-      style={[styles.status, { backgroundColor: t.colors.cardDeep, borderRadius: t.radius.md }]}
-      accessibilityLiveRegion="polite"
-      accessibilityRole="text"
-      accessibilityLabel={message}
-    >
-      <Text style={{ color: tone === "ok" ? t.colors.success : t.colors.muted, fontSize: t.type.bodySmall.fontSize }}>
-        {message}
-      </Text>
-    </View>
-  );
-}
+export function InlineStatus({ message, tone = "ok" }: { message: string | null; tone?: InlineStatusTone }) {}
 
 /** A small persistent pill ("Draft restored") — calmer than a dialog, more
killedBy: InlineStatus pins the status line: exact surface array and the DEFAULT ok tone's success color
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/components/InlineStatus.tsx:19:7
  *  Announced politely to screen readers (live region). */
 export function InlineStatus({ message, tone = "ok" }: { message: string | null; tone?: InlineStatusTone }) {
   const t = useTheme();
-  if (!message) return null;
+  if (false) return null;
   return (
     <View
killedBy: InlineStatus pins a null message renders nothing at all — not even a View
statusReason: expected [ ReactTestInstance{ …(1) } ] to have a length of +0 but got 1

[Killed] BooleanLiteral
src/components/InlineStatus.tsx:19:7
  *  Announced politely to screen readers (live region). */
 export function InlineStatus({ message, tone = "ok" }: { message: string | null; tone?: InlineStatusTone }) {
   const t = useTheme();
-  if (!message) return null;
+  if (message) return null;
   return (
     <View
killedBy: InlineStatus pins a null message renders nothing at all — not even a View
statusReason: expected [ ReactTestInstance{ …(1) } ] to have a length of +0 but got 1

[Killed] ObjectLiteral
src/components/InlineStatus.tsx:22:30
   if (!message) return null;
   return (
     <View
-      style={[styles.status, { backgroundColor: t.colors.cardDeep, borderRadius: t.radius.md }]}
+      style={[styles.status, {}]}
       accessibilityLiveRegion="polite"
       accessibilityRole="text"
killedBy: InlineStatus pins the status line: exact surface array and the DEFAULT ok tone's success color
statusReason: expected [ { paddingVertical: 10, …(2) }, {} ] to deeply equal [ { paddingVertical: 10, …(2) }, …(1) ]

[Killed] ConditionalExpression
src/components/InlineStatus.tsx:27:29
       accessibilityRole="text"
       accessibilityLabel={message}
     >
-      <Text style={{ color: tone === "ok" ? t.colors.success : t.colors.muted, fontSize: t.type.bodySmall.fontSize }}>
+      <Text style={{ color: true ? t.colors.success : t.colors.muted, fontSize: t.type.bodySmall.fontSize }}>
         {message}
       </Text>
killedBy: InlineStatus pins the neutral tone renders the muted color exactly
statusReason: expected { color: '#59c98a', fontSize: 13 } to deeply equal { color: '#8a91a3', fontSize: 13 }

[Killed] EqualityOperator
src/components/InlineStatus.tsx:27:29
       accessibilityRole="text"
       accessibilityLabel={message}
     >
-      <Text style={{ color: tone === "ok" ? t.colors.success : t.colors.muted, fontSize: t.type.bodySmall.fontSize }}>
+      <Text style={{ color: tone !== "ok" ? t.colors.success : t.colors.muted, fontSize: t.type.bodySmall.fontSize }}>
         {message}
       </Text>
killedBy: InlineStatus pins the status line: exact surface array and the DEFAULT ok tone's success color
statusReason: expected { color: '#8a91a3', fontSize: 13 } to deeply equal { color: '#59c98a', fontSize: 13 }

[Killed] BlockStatement
src/components/InlineStatus.tsx:36:105
 
 /** A small persistent pill ("Draft restored") — calmer than a dialog, more
  *  durable than a status line. */
-export function NoticeChip({ text, accessibilityLabel }: { text: string; accessibilityLabel?: string }) {
-  const t = useTheme();
-  return (
-    <View
-      style={[styles.chip, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}
-      accessibilityRole="text"
-      accessibilityLabel={accessibilityLabel ?? text}
-    >
-      <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize }}>{text}</Text>
-    </View>
-  );
-}
+export function NoticeChip({ text, accessibilityLabel }: { text: string; accessibilityLabel?: string }) {}
 
 const styles = StyleSheet.create({
killedBy: NoticeChip pins the chip surface and its text carry their exact styles
statusReason: expected undefined to be defined

[Killed] ArrayDeclaration
src/components/InlineStatus.tsx:40:14
   const t = useTheme();
   return (
     <View
-      style={[styles.chip, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}
+      style={[]}
       accessibilityRole="text"
       accessibilityLabel={accessibilityLabel ?? text}
killedBy: NoticeChip pins the chip surface and its text carry their exact styles
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] ObjectLiteral
src/components/InlineStatus.tsx:40:28
   const t = useTheme();
   return (
     <View
-      style={[styles.chip, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}
+      style={[styles.chip, {}]}
       accessibilityRole="text"
       accessibilityLabel={accessibilityLabel ?? text}
killedBy: NoticeChip pins the chip surface and its text carry their exact styles
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] LogicalOperator
src/components/InlineStatus.tsx:42:27
     <View
       style={[styles.chip, { backgroundColor: t.colors.card, borderRadius: t.radius.lg }]}
       accessibilityRole="text"
-      accessibilityLabel={accessibilityLabel ?? text}
+      accessibilityLabel={accessibilityLabel && text}
     >
       <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize }}>{text}</Text>
killedBy: NoticeChip renders the notice text with a text role
statusReason: expected undefined to be 'Draft restored' // Object.is equality

[Killed] ObjectLiteral
src/components/InlineStatus.tsx:44:20
       accessibilityRole="text"
       accessibilityLabel={accessibilityLabel ?? text}
     >
-      <Text style={{ color: t.colors.muted, fontSize: t.type.meta.fontSize }}>{text}</Text>
+      <Text style={{}}>{text}</Text>
     </View>
   );
killedBy: NoticeChip pins the chip surface and its text carry their exact styles
statusReason: expected {} to deeply equal { color: '#8a91a3', fontSize: 12 }

[Killed] ObjectLiteral
src/components/InlineStatus.tsx:51:9
 
 const styles = StyleSheet.create({
   status: { paddingVertical: 10, paddingHorizontal: 14, alignItems: "center" },
-  chip: { alignSelf: "flex-start", paddingVertical: 6, paddingHorizontal: 12 },
+  chip: {},
 });
 
killedBy: NoticeChip pins the chip surface and its text carry their exact styles
statusReason: expected [ {}, { …(2) } ] to deeply equal [ …(2) ]

[Killed] StringLiteral
src/components/InlineStatus.tsx:51:22
 
 const styles = StyleSheet.create({
   status: { paddingVertical: 10, paddingHorizontal: 14, alignItems: "center" },
-  chip: { alignSelf: "flex-start", paddingVertical: 6, paddingHorizontal: 12 },
+  chip: { alignSelf: "", paddingVertical: 6, paddingHorizontal: 12 },
 });
 
killedBy: NoticeChip pins the chip surface and its text carry their exact styles
statusReason: expected [ { alignSelf: '', …(2) }, { …(2) } ] to deeply equal [ …(2) ]
