[Killed] ArrowFunction
src/components/keyConsent.ts:15:13
  */
 import AsyncStorage from "@react-native-async-storage/async-storage";
 
-const key = (userId: string): string => `@mindpattern/keyship_consent_${userId}`;
+const key = () => undefined;
 
 export async function hasKeyShipConsent(userId: string): Promise<boolean> {
killedBy: destructive delete deletion also wipes the mood log, recompute stamp, cached salt and queue
statusReason: expected '1' to be null

[Killed] BlockStatement
src/components/keyConsent.ts:17:75
 
 const key = (userId: string): string => `@mindpattern/keyship_consent_${userId}`;
 
-export async function hasKeyShipConsent(userId: string): Promise<boolean> {
-  return (await AsyncStorage.getItem(key(userId))) !== null;
-}
+export async function hasKeyShipConsent(userId: string): Promise<boolean> {}
 
 export async function recordKeyShipConsent(userId: string): Promise<void> {
killedBy: keyConsent persistence records, reads and clears the per-account acknowledgment
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/components/keyConsent.ts:18:10
 const key = (userId: string): string => `@mindpattern/keyship_consent_${userId}`;
 
 export async function hasKeyShipConsent(userId: string): Promise<boolean> {
-  return (await AsyncStorage.getItem(key(userId))) !== null;
+  return false;
 }
 
killedBy: keyConsent persistence records, reads and clears the per-account acknowledgment
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/components/keyConsent.ts:18:10
 const key = (userId: string): string => `@mindpattern/keyship_consent_${userId}`;
 
 export async function hasKeyShipConsent(userId: string): Promise<boolean> {
-  return (await AsyncStorage.getItem(key(userId))) !== null;
+  return (await AsyncStorage.getItem(key(userId))) === null;
 }
 
killedBy: keyConsent persistence records, reads and clears the per-account acknowledgment
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/components/keyConsent.ts:21:75
   return (await AsyncStorage.getItem(key(userId))) !== null;
 }
 
-export async function recordKeyShipConsent(userId: string): Promise<void> {
-  await AsyncStorage.setItem(key(userId), "1");
-}
+export async function recordKeyShipConsent(userId: string): Promise<void> {}
 
 /** Account-deletion hygiene: the consent flag must not outlive its account. */
killedBy: keyConsent persistence records, reads and clears the per-account acknowledgment
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/components/keyConsent.ts:22:43
 }
 
 export async function recordKeyShipConsent(userId: string): Promise<void> {
-  await AsyncStorage.setItem(key(userId), "1");
+  await AsyncStorage.setItem(key(userId), "");
 }
 
killedBy: QuestionScreen key-shipment consent (informed consent fix) 'Continue' records the acknowledgment per account and proceeds
statusReason: expected '' to be '1' // Object.is equality

[Killed] BlockStatement
src/components/keyConsent.ts:26:74
 }
 
 /** Account-deletion hygiene: the consent flag must not outlive its account. */
-export async function clearKeyShipConsent(userId: string): Promise<void> {
-  await AsyncStorage.removeItem(key(userId));
-}
+export async function clearKeyShipConsent(userId: string): Promise<void> {}
 
killedBy: destructive delete requires two confirmations and the sign-in key
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA=",
