[Killed] ArrowFunction
src/onboarding.ts:23:13
  */
 import AsyncStorage from "@react-native-async-storage/async-storage";
 
-const key = (userId: string): string => `@mindpattern/onboarding_seen_${userId}`;
+const key = () => undefined;
 
 let pending = false;
killedBy: destructive delete deletion also wipes the mood log, recompute stamp, cached salt and queue
statusReason: expected '1' to be null

[Killed] BooleanLiteral
src/onboarding.ts:25:15
 
 const key = (userId: string): string => `@mindpattern/onboarding_seen_${userId}`;
 
-let pending = false;
+let pending = true;
 
 /** Mark that THIS session just created its account — the navigator routes
killedBy: onboarding pins a fresh module starts with NO pending onboarding
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/onboarding.ts:29:41
 
 /** Mark that THIS session just created its account — the navigator routes
  *  the first render of the main flow through onboarding. */
-export function queueOnboarding(): void {
-  pending = true;
-}
+export function queueOnboarding(): void {}
 
 /** One-shot read: true exactly once per queueOnboarding() call, so a later
killedBy: onboarding pins a fresh module starts with NO pending onboarding
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/onboarding.ts:30:13
 /** Mark that THIS session just created its account — the navigator routes
  *  the first render of the main flow through onboarding. */
 export function queueOnboarding(): void {
-  pending = true;
+  pending = false;
 }
 
killedBy: onboarding pins a fresh module starts with NO pending onboarding
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/onboarding.ts:35:50
 
 /** One-shot read: true exactly once per queueOnboarding() call, so a later
  *  login inside the same session can never trigger onboarding. */
-export function takePendingOnboarding(): boolean {
-  const wasPending = pending;
-  pending = false;
-  return wasPending;
-}
+export function takePendingOnboarding(): boolean {}
 
 export async function hasSeenOnboarding(userId: string): Promise<boolean> {
killedBy: AppNavigator a just-registered account lands on onboarding FIRST, before the journal
statusReason: expected [ Array(8) ] to deeply equal [ 'Onboarding', 'Entry', …(7) ]

[Killed] BooleanLiteral
src/onboarding.ts:37:13
  *  login inside the same session can never trigger onboarding. */
 export function takePendingOnboarding(): boolean {
   const wasPending = pending;
-  pending = false;
+  pending = true;
   return wasPending;
 }
killedBy: onboarding pins a fresh module starts with NO pending onboarding
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/onboarding.ts:41:75
   return wasPending;
 }
 
-export async function hasSeenOnboarding(userId: string): Promise<boolean> {
-  return (await AsyncStorage.getItem(key(userId))) !== null;
-}
+export async function hasSeenOnboarding(userId: string): Promise<boolean> {}
 
 export async function recordOnboardingSeen(userId: string): Promise<void> {
killedBy: OnboardingScreen walks the three panels in order and records the acknowledgment on completion
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/onboarding.ts:42:10
 }
 
 export async function hasSeenOnboarding(userId: string): Promise<boolean> {
-  return (await AsyncStorage.getItem(key(userId))) !== null;
+  return true;
 }
 
killedBy: OnboardingScreen a missing account id still completes — there is nothing to bind the flag to
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/onboarding.ts:42:10
 }
 
 export async function hasSeenOnboarding(userId: string): Promise<boolean> {
-  return (await AsyncStorage.getItem(key(userId))) !== null;
+  return false;
 }
 
killedBy: OnboardingScreen walks the three panels in order and records the acknowledgment on completion
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/onboarding.ts:45:75
   return (await AsyncStorage.getItem(key(userId))) !== null;
 }
 
-export async function recordOnboardingSeen(userId: string): Promise<void> {
-  await AsyncStorage.setItem(key(userId), "1");
-}
+export async function recordOnboardingSeen(userId: string): Promise<void> {}
 
 /** Account-deletion hygiene: the flag must not outlive its account. */
killedBy: OnboardingScreen walks the three panels in order and records the acknowledgment on completion
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/onboarding.ts:50:74
 }
 
 /** Account-deletion hygiene: the flag must not outlive its account. */
-export async function clearOnboardingSeen(userId: string): Promise<void> {
-  await AsyncStorage.removeItem(key(userId));
-}
+export async function clearOnboardingSeen(userId: string): Promise<void> {}
 
killedBy: destructive delete requires two confirmations and the sign-in key
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA=",
