[Killed] StringLiteral
src/strings.ts:40:19
   | "unlock.body";
 
 const en: Record<StringKey, string> = {
-  "crisis.title": "Support is always one tap away",
+  "crisis.title": "",
   "crisis.subtitle":
     "Free, confidential, open 24/7. Talking to someone is never a wrong move — these lines exist for exactly this.",
killedBy: strings catalog every crisis key resolves to non-empty copy (safety-critical: no key bleed)
statusReason: expected 0 to be greater than 8

[Killed] StringLiteral
src/strings.ts:45:30
     "Free, confidential, open 24/7. Talking to someone is never a wrong move — these lines exist for exactly this.",
   "crisis.call988": "Call or text 988",
   "crisis.call988.detail": "988 Suicide & Crisis Lifeline — call 988 or text it, any time",
-  "crisis.call988.fallback": "You can still dial or text 988 from your phone — it is free and answers 24/7.",
+  "crisis.call988.fallback": "",
   "crisis.text741741": "Text HOME to 741741",
   "crisis.text741741.detail": "Crisis Text Line — text conversation with a trained counselor",
killedBy: CrisisScreen failure handling a rejected openURL on "Call or text 988" surfaces the number/address instead of a dead tap
statusReason: expected "vi.fn()" to be called with arguments: [ 'Couldn\'t open it from here', …(1) ]

Received:

  1st vi.fn() call:

  [
    "Couldn't open it from here",

[Killed] StringLiteral
src/strings.ts:47:31
   "crisis.call988.detail": "988 Suicide & Crisis Lifeline — call 988 or text it, any time",
   "crisis.call988.fallback": "You can still dial or text 988 from your phone — it is free and answers 24/7.",
   "crisis.text741741": "Text HOME to 741741",
-  "crisis.text741741.detail": "Crisis Text Line — text conversation with a trained counselor",
+  "crisis.text741741.detail": "",
   "crisis.chat": "Chat with a counselor",
   "crisis.chat.detail": "Crisis Text Line web chat — no phone needed",
killedBy: CrisisScreen pins: themed text overlays pinned to their own nodes every action button's label, detail and Go texts carry their own overlays

[Survived] StringLiteral
src/strings.ts:49:25
   "crisis.text741741": "Text HOME to 741741",
   "crisis.text741741.detail": "Crisis Text Line — text conversation with a trained counselor",
   "crisis.chat": "Chat with a counselor",
-  "crisis.chat.detail": "Crisis Text Line web chat — no phone needed",
+  "crisis.chat.detail": "",
   "crisis.emergency": "Immediate danger",
   "crisis.emergency.detail": "If you are thinking of acting on thoughts of ending your life, call 911 or go to an emergency room now",

[Survived] StringLiteral
src/strings.ts:54:24
   "crisis.emergency.detail": "If you are thinking of acting on thoughts of ending your life, call 911 or go to an emergency room now",
   "crisis.findhelpline": "Find help outside the US",
   "crisis.findhelpline.detail": "findahelpline.com lists free, local crisis lines for most countries",
-  "crisis.localeNote": "These numbers are US-based; your region may have its own line.",
+  "crisis.localeNote": "",
   "unlock.title": "Welcome back",
   "unlock.body": "Enter your password to unlock your journal on this device.",

[Survived] StringLiteral
src/strings.ts:55:19
   "crisis.findhelpline": "Find help outside the US",
   "crisis.findhelpline.detail": "findahelpline.com lists free, local crisis lines for most countries",
   "crisis.localeNote": "These numbers are US-based; your region may have its own line.",
-  "unlock.title": "Welcome back",
+  "unlock.title": "",
   "unlock.body": "Enter your password to unlock your journal on this device.",
 };

[Survived] StringLiteral
src/strings.ts:56:18
   "crisis.findhelpline.detail": "findahelpline.com lists free, local crisis lines for most countries",
   "crisis.localeNote": "These numbers are US-based; your region may have its own line.",
   "unlock.title": "Welcome back",
-  "unlock.body": "Enter your password to unlock your journal on this device.",
+  "unlock.body": "",
 };
 

[Killed] BlockStatement
src/strings.ts:59:43
   "unlock.body": "Enter your password to unlock your journal on this device.",
 };
 
-export function t(key: StringKey): string {
-  return en[key] ?? key;
-}
+export function t(key: StringKey): string {}
 
killedBy: CrisisScreen pins: the full StyleSheet contract every ActionButton carries [action, themed card overlay] on its own touchable
statusReason: no Text node containing "Call or text 988":

[Killed] LogicalOperator
src/strings.ts:60:10
 };
 
 export function t(key: StringKey): string {
-  return en[key] ?? key;
+  return en[key] && key;
 }
 
killedBy: CrisisScreen pins: the full StyleSheet contract every ActionButton carries [action, themed card overlay] on its own touchable
statusReason: no Text node containing "Call or text 988":
