[Killed] StringLiteral
src/crisisPhrases.ts:32:3
 
 /** The dialog tier: high-signal phrases that surface support resources. */
 export const CRISIS_DIALOG_PATTERNS: readonly string[] = [
-  "\\bsuicid(?:e|al)\\b",
+  "",
   "\\bkill(?:ing)?\\s+myself\\b",
   "\\b(?:wants?|wanted|wanting)\\s+to\\s+die\\b",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '', …(52) ] to deeply equal [ '\bsuicid(?:e|al)\b', …(52) ]

[Killed] StringLiteral
src/crisisPhrases.ts:33:3
 /** The dialog tier: high-signal phrases that surface support resources. */
 export const CRISIS_DIALOG_PATTERNS: readonly string[] = [
   "\\bsuicid(?:e|al)\\b",
-  "\\bkill(?:ing)?\\s+myself\\b",
+  "",
   "\\b(?:wants?|wanted|wanting)\\s+to\\s+die\\b",
   "\\bwanna\\s+(?:to\\s+)?die\\b",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid(?:e|al)\b', '', …(51) ] to deeply equal [ '\bsuicid(?:e|al)\b', …(52) ]

[Killed] StringLiteral
src/crisisPhrases.ts:34:3
 export const CRISIS_DIALOG_PATTERNS: readonly string[] = [
   "\\bsuicid(?:e|al)\\b",
   "\\bkill(?:ing)?\\s+myself\\b",
-  "\\b(?:wants?|wanted|wanting)\\s+to\\s+die\\b",
+  "",
   "\\bwanna\\s+(?:to\\s+)?die\\b",
   "\\bwish\\s+(?:i\\s+)?(?:was|were)\\s+dead\\b",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid(?:e|al)\b', …(52) ] to deeply equal [ '\bsuicid(?:e|al)\b', …(52) ]

[Killed] StringLiteral
src/crisisPhrases.ts:37:3
   "\\b(?:wants?|wanted|wanting)\\s+to\\s+die\\b",
   "\\bwanna\\s+(?:to\\s+)?die\\b",
   "\\bwish\\s+(?:i\\s+)?(?:was|were)\\s+dead\\b",
-  "\\bwish\\s+(?:i\\s+)?could\\s+die\\b",
+  "",
   "\\bfeel(?:s|ing)?\\s+like\\s+dying\\b",
   "\\bend(?:ing)?\\s+it\\s+all\\b",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid(?:e|al)\b', …(52) ] to deeply equal [ '\bsuicid(?:e|al)\b', …(52) ]

[Killed] StringLiteral
src/crisisPhrases.ts:41:3
   "\\bfeel(?:s|ing)?\\s+like\\s+dying\\b",
   "\\bend(?:ing)?\\s+it\\s+all\\b",
   "\\b(?:end|ending|take|taking)\\s+my\\s+(?:own\\s+)?life\\b",
-  "\\bself[-\\s]?harm(?:ing)?\\b",
+  "",
   "\\bhurt(?:ing)?\\s+myself\\b",
   "\\bharm(?:ing)?\\s+myself\\b",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid(?:e|al)\b', …(52) ] to deeply equal [ '\bsuicid(?:e|al)\b', …(52) ]

[Killed] StringLiteral
src/crisisPhrases.ts:46:3
   "\\bharm(?:ing)?\\s+myself\\b",
   "\\bcut(?:ting)?\\s+myself\\b",
   "\\bno\\s+reason\\s+to\\s+(?:live|go\\s+on)\\b",
-  "\\bnothing\\s+to\\s+live\\s+for\\b",
+  "",
   "\\b(?:can['\\u2019]?t|cannot)\\s+go\\s+on\\b",
   "\\bbetter\\s+off\\s+without\\s+me\\b",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid(?:e|al)\b', …(52) ] to deeply equal [ '\bsuicid(?:e|al)\b', …(52) ]

[Killed] StringLiteral
src/crisisPhrases.ts:52:3
   "\\b(?:don['\\u2019]?t|do\\s+not)\\s+want\\s+to\\s+(?:be\\s+here|live|exist|be\\s+alive|wake\\s+up)\\b",
   "\\bwant(?:s|ed|ing)?\\s+to\\s+disappear\\b",
   "\\bend(?:ing)?\\s+everything\\b",
-  "\\bno\\s+point\\s+(?:in\\s+)?going\\s+on\\b",
+  "",
   "\\bwish\\s+(?:i\\s+)?(?:was|were)\\s+never\\s+born\\b",
   "\\bunalive\\b",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid(?:e|al)\b', …(52) ] to deeply equal [ '\bsuicid(?:e|al)\b', …(52) ]

[Killed] StringLiteral
src/crisisPhrases.ts:55:3
   "\\bno\\s+point\\s+(?:in\\s+)?going\\s+on\\b",
   "\\bwish\\s+(?:i\\s+)?(?:was|were)\\s+never\\s+born\\b",
   "\\bunalive\\b",
-  "\\bkys\\b",
+  "",
   "\\bno\\s+way\\s+out\\b",
   "\\bsleep\\s+forever\\b",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid(?:e|al)\b', …(52) ] to deeply equal [ '\bsuicid(?:e|al)\b', …(52) ]

[Killed] StringLiteral
src/crisisPhrases.ts:57:3
   "\\bunalive\\b",
   "\\bkys\\b",
   "\\bno\\s+way\\s+out\\b",
-  "\\bsleep\\s+forever\\b",
+  "",
   "\\b(?:can['\\u2019]?t|cannot)\\s+do\\s+this\\s+anymore\\b",
   "\\boff(?:ing)?\\s+myself\\b",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid(?:e|al)\b', …(52) ] to deeply equal [ '\bsuicid(?:e|al)\b', …(52) ]

[Killed] StringLiteral
src/crisisPhrases.ts:60:3
   "\\bsleep\\s+forever\\b",
   "\\b(?:can['\\u2019]?t|cannot)\\s+do\\s+this\\s+anymore\\b",
   "\\boff(?:ing)?\\s+myself\\b",
-  "\\bput\\s+me\\s+out\\s+of\\s+my\\s+misery\\b",
+  "",
   "\\bquiero\\s+morir\\b",
   "\\bme\\s+quiero\\s+matar\\b",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid(?:e|al)\b', …(52) ] to deeply equal [ '\bsuicid(?:e|al)\b', …(52) ]

[Killed] StringLiteral
src/crisisPhrases.ts:62:3
   "\\boff(?:ing)?\\s+myself\\b",
   "\\bput\\s+me\\s+out\\s+of\\s+my\\s+misery\\b",
   "\\bquiero\\s+morir\\b",
-  "\\bme\\s+quiero\\s+matar\\b",
+  "",
   "\\bquitarme\\s+la\\s+vida\\b",
   "\\bje\\s+veux\\s+mourir\\b",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid(?:e|al)\b', …(52) ] to deeply equal [ '\bsuicid(?:e|al)\b', …(52) ]

[Killed] StringLiteral
src/crisisPhrases.ts:64:3
   "\\bquiero\\s+morir\\b",
   "\\bme\\s+quiero\\s+matar\\b",
   "\\bquitarme\\s+la\\s+vida\\b",
-  "\\bje\\s+veux\\s+mourir\\b",
+  "",
   "\\bme\\s+suicider\\b",
   "\\bsuizid\\w*",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid(?:e|al)\b', …(52) ] to deeply equal [ '\bsuicid(?:e|al)\b', …(52) ]

[Killed] StringLiteral
src/crisisPhrases.ts:67:3
   "\\bje\\s+veux\\s+mourir\\b",
   "\\bme\\s+suicider\\b",
   "\\bsuizid\\w*",
-  "\\bich\\s+will\\s+sterben\\b",
+  "",
   "\\bbringe\\s+mich\\s+um\\b",
   "\\bvoglio\\s+morire\\b",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid(?:e|al)\b', …(52) ] to deeply equal [ '\bsuicid(?:e|al)\b', …(52) ]

[Killed] StringLiteral
src/crisisPhrases.ts:69:3
   "\\bsuizid\\w*",
   "\\bich\\s+will\\s+sterben\\b",
   "\\bbringe\\s+mich\\s+um\\b",
-  "\\bvoglio\\s+morire\\b",
+  "",
   "\\bquero\\s+morrer\\b",
   "\\bme\\s+matar\\b",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid(?:e|al)\b', …(52) ] to deeply equal [ '\bsuicid(?:e|al)\b', …(52) ]

[Killed] StringLiteral
src/crisisPhrases.ts:70:3
   "\\bich\\s+will\\s+sterben\\b",
   "\\bbringe\\s+mich\\s+um\\b",
   "\\bvoglio\\s+morire\\b",
-  "\\bquero\\s+morrer\\b",
+  "",
   "\\bme\\s+matar\\b",
   "我想死",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid(?:e|al)\b', …(52) ] to deeply equal [ '\bsuicid(?:e|al)\b', …(52) ]

[Killed] StringLiteral
src/crisisPhrases.ts:71:3
   "\\bbringe\\s+mich\\s+um\\b",
   "\\bvoglio\\s+morire\\b",
   "\\bquero\\s+morrer\\b",
-  "\\bme\\s+matar\\b",
+  "",
   "我想死",
   "我想去死",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid(?:e|al)\b', …(52) ] to deeply equal [ '\bsuicid(?:e|al)\b', …(52) ]

[Killed] StringLiteral
src/crisisPhrases.ts:72:3
   "\\bvoglio\\s+morire\\b",
   "\\bquero\\s+morrer\\b",
   "\\bme\\s+matar\\b",
-  "我想死",
+  "",
   "我想去死",
   "自杀",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid(?:e|al)\b', …(52) ] to deeply equal [ '\bsuicid(?:e|al)\b', …(52) ]

[Killed] StringLiteral
src/crisisPhrases.ts:73:3
   "\\bquero\\s+morrer\\b",
   "\\bme\\s+matar\\b",
   "我想死",
-  "我想去死",
+  "",
   "自杀",
   "死にたい",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid(?:e|al)\b', …(52) ] to deeply equal [ '\bsuicid(?:e|al)\b', …(52) ]

[Killed] StringLiteral
src/crisisPhrases.ts:78:3
   "死にたい",
   "自殺",
   "자살하고 싶다",
-  "죽고 싶다",
+  "",
   "أريد أن أموت",
   "أريد أن أنتحر",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid(?:e|al)\b', …(52) ] to deeply equal [ '\bsuicid(?:e|al)\b', …(52) ]

[Killed] StringLiteral
src/crisisPhrases.ts:80:3
   "자살하고 싶다",
   "죽고 싶다",
   "أريد أن أموت",
-  "أريد أن أنتحر",
+  "",
   "मरना चाहता",
   "मरना चाहती",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid(?:e|al)\b', …(52) ] to deeply equal [ '\bsuicid(?:e|al)\b', …(52) ]

[Killed] StringLiteral
src/crisisPhrases.ts:81:3
   "죽고 싶다",
   "أريد أن أموت",
   "أريد أن أنتحر",
-  "मरना चाहता",
+  "",
   "मरना चाहती",
   "\\bintihar\\s+etmek\\s+istiyorum\\b",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid(?:e|al)\b', …(52) ] to deeply equal [ '\bsuicid(?:e|al)\b', …(52) ]

[Killed] StringLiteral
src/crisisPhrases.ts:84:3
   "मरना चाहता",
   "मरना चाहती",
   "\\bintihar\\s+etmek\\s+istiyorum\\b",
-  "\\bcanını\\s+almak\\s+istiyorum\\b",
+  "",
 ];
 
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid(?:e|al)\b', …(52) ] to deeply equal [ '\bsuicid(?:e|al)\b', …(52) ]

[Killed] StringLiteral
src/crisisPhrases.ts:91:3
  *  list is dialog + these). Used for non-quoting cards / question
  *  suppression — never for the support dialog. */
 export const CRISIS_SUPPRESS_EXTRA_PATTERNS: readonly string[] = [
-  "\\bsuicid\\w+",
+  "",
   "\\bkill(?:ing)?\\s+me\\b",
   "\\bwant(?:s|ed|ing)?\\s+to\\s+be\\s+dead\\b",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '', '\bkill(?:ing)?\s+me\b', …(17) ] to deeply equal [ '\bsuicid\w+', …(18) ]

[Killed] StringLiteral
src/crisisPhrases.ts:93:3
 export const CRISIS_SUPPRESS_EXTRA_PATTERNS: readonly string[] = [
   "\\bsuicid\\w+",
   "\\bkill(?:ing)?\\s+me\\b",
-  "\\bwant(?:s|ed|ing)?\\s+to\\s+be\\s+dead\\b",
+  "",
   "\\brather\\s+be\\s+dead\\b",
   "\\bbetter\\s+off\\s+dead\\b",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid\w+', …(18) ] to deeply equal [ '\bsuicid\w+', …(18) ]

[Killed] StringLiteral
src/crisisPhrases.ts:94:3
   "\\bsuicid\\w+",
   "\\bkill(?:ing)?\\s+me\\b",
   "\\bwant(?:s|ed|ing)?\\s+to\\s+be\\s+dead\\b",
-  "\\brather\\s+be\\s+dead\\b",
+  "",
   "\\bbetter\\s+off\\s+dead\\b",
   "\\boverdose(?:d)?\\b",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid\w+', …(18) ] to deeply equal [ '\bsuicid\w+', …(18) ]

[Killed] StringLiteral
src/crisisPhrases.ts:95:3
   "\\bkill(?:ing)?\\s+me\\b",
   "\\bwant(?:s|ed|ing)?\\s+to\\s+be\\s+dead\\b",
   "\\brather\\s+be\\s+dead\\b",
-  "\\bbetter\\s+off\\s+dead\\b",
+  "",
   "\\boverdose(?:d)?\\b",
   "\\beveryone\\s+would\\s+be\\s+better\\s+off\\b",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid\w+', …(18) ] to deeply equal [ '\bsuicid\w+', …(18) ]

[Killed] StringLiteral
src/crisisPhrases.ts:98:3
   "\\bbetter\\s+off\\s+dead\\b",
   "\\boverdose(?:d)?\\b",
   "\\beveryone\\s+would\\s+be\\s+better\\s+off\\b",
-  "\\bnot\\s+want(?:ing)?\\s+to\\s+(?:live|be\\s+here)\\b",
+  "",
   "\\bcutting\\b",
   "\\bself[-\\s]?loathing\\b",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid\w+', …(18) ] to deeply equal [ '\bsuicid\w+', …(18) ]

[Killed] StringLiteral
src/crisisPhrases.ts:99:3
   "\\boverdose(?:d)?\\b",
   "\\beveryone\\s+would\\s+be\\s+better\\s+off\\b",
   "\\bnot\\s+want(?:ing)?\\s+to\\s+(?:live|be\\s+here)\\b",
-  "\\bcutting\\b",
+  "",
   "\\bself[-\\s]?loathing\\b",
   "\\bburn(?:ing|ed)?\\s+myself\\b",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid\w+', …(18) ] to deeply equal [ '\bsuicid\w+', …(18) ]

[Killed] StringLiteral
src/crisisPhrases.ts:104:3
   "\\bburn(?:ing|ed)?\\s+myself\\b",
   "\\bstarv(?:e|ing|ed)\\s+myself\\b",
   "\\bmake\\s+myself\\s+(?:throw\\s+up|puke|vomit)\\b",
-  "\\b(?:made|making)\\s+myself\\s+(?:throw\\s+up|puke|vomit)\\b",
+  "",
   "\\bdon['\\u2019]?t\\s+see\\s+(?:a\\s+|any\\s+)?future\\b",
   "\\bno\\s+future\\s+for\\s+me\\b",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid\w+', …(18) ] to deeply equal [ '\bsuicid\w+', …(18) ]

[Killed] StringLiteral
src/crisisPhrases.ts:105:3
   "\\bstarv(?:e|ing|ed)\\s+myself\\b",
   "\\bmake\\s+myself\\s+(?:throw\\s+up|puke|vomit)\\b",
   "\\b(?:made|making)\\s+myself\\s+(?:throw\\s+up|puke|vomit)\\b",
-  "\\bdon['\\u2019]?t\\s+see\\s+(?:a\\s+|any\\s+)?future\\b",
+  "",
   "\\bno\\s+future\\s+for\\s+me\\b",
   "\\bhappier\\s+(?:if|when)\\s+(?:i['\\u2019]?m|i\\s+am|i\\s+was)\\s+gone\\b",
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid\w+', …(18) ] to deeply equal [ '\bsuicid\w+', …(18) ]

[Killed] StringLiteral
src/crisisPhrases.ts:108:3
   "\\bdon['\\u2019]?t\\s+see\\s+(?:a\\s+|any\\s+)?future\\b",
   "\\bno\\s+future\\s+for\\s+me\\b",
   "\\bhappier\\s+(?:if|when)\\s+(?:i['\\u2019]?m|i\\s+am|i\\s+was)\\s+gone\\b",
-  "\\bhappier\\s+without\\s+me\\b",
+  "",
   "\\beveryone\\s+would\\s+be\\s+happier\\b",
 ];
killedBy: shared/crisis_phrases.json parity embeds the dialog and suppress_extra lists exactly
statusReason: expected [ '\bsuicid\w+', …(18) ] to deeply equal [ '\bsuicid\w+', …(18) ]

[Killed] ArrayDeclaration
src/crisisPhrases.ts:119:59
  * tier, and "we discussed suicide prevention in class" neither. Any
  * genuine crisis phrasing around them still matches on its own words.
  */
-export const CRISIS_BENIGN_COMPOUNDS: readonly string[] = [
-  "suicide squad",
-  "suicide silence",
-  "suicideboys",
-  "suicide prevention",
-  "suicide awareness",
-];
+export const CRISIS_BENIGN_COMPOUNDS: readonly string[] = [];
 
killedBy: shared/crisis_phrases.json parity embeds the benign_compounds list exactly
statusReason: expected [] to deeply equal [ 'suicide squad', …(4) ]

[Killed] StringLiteral
src/crisisPhrases.ts:120:3
  * genuine crisis phrasing around them still matches on its own words.
  */
 export const CRISIS_BENIGN_COMPOUNDS: readonly string[] = [
-  "suicide squad",
+  "",
   "suicide silence",
   "suicideboys",
killedBy: shared/crisis_phrases.json parity embeds the benign_compounds list exactly
statusReason: expected [ '', 'suicide silence', …(3) ] to deeply equal [ 'suicide squad', …(4) ]

[Killed] StringLiteral
src/crisisPhrases.ts:121:3
  */
 export const CRISIS_BENIGN_COMPOUNDS: readonly string[] = [
   "suicide squad",
-  "suicide silence",
+  "",
   "suicideboys",
   "suicide prevention",
killedBy: shared/crisis_phrases.json parity embeds the benign_compounds list exactly
statusReason: expected [ 'suicide squad', '', …(3) ] to deeply equal [ 'suicide squad', …(4) ]

[Killed] StringLiteral
src/crisisPhrases.ts:122:3
 export const CRISIS_BENIGN_COMPOUNDS: readonly string[] = [
   "suicide squad",
   "suicide silence",
-  "suicideboys",
+  "",
   "suicide prevention",
   "suicide awareness",
killedBy: shared/crisis_phrases.json parity embeds the benign_compounds list exactly
statusReason: expected [ 'suicide squad', …(4) ] to deeply equal [ 'suicide squad', …(4) ]

[Killed] StringLiteral
src/crisisPhrases.ts:124:3
   "suicide silence",
   "suicideboys",
   "suicide prevention",
-  "suicide awareness",
+  "",
 ];
 
killedBy: shared/crisis_phrases.json parity embeds the benign_compounds list exactly
statusReason: expected [ 'suicide squad', …(4) ] to deeply equal [ 'suicide squad', …(4) ]
