[Killed] ArithmeticOperator
src/App.tsx:24:22
 /** Idle auto-lock (2026-09-17): 10 minutes without interaction drops
  *  every key from memory — a chart left open on a shared clinic laptop
  *  shows decrypted journal text exactly until the clinician walks away. */
-const IDLE_LOCK_MS = 10 * 60 * 1000;
+const IDLE_LOCK_MS = 10 * 60 / 1000;
 
 /** Best-effort overwrite for extractable raw key bytes. CryptoKey instances
killedBy: App logs in, unlocks the sharing key, and lands on Patients
statusReason: expected 'Server: this portal\'s own secure ori…' to contain 'Patients — Dr. Portal'

[Survived] ArithmeticOperator
src/App.tsx:24:22
 /** Idle auto-lock (2026-09-17): 10 minutes without interaction drops
  *  every key from memory — a chart left open on a shared clinic laptop
  *  shows decrypted journal text exactly until the clinician walks away. */
-const IDLE_LOCK_MS = 10 * 60 * 1000;
+const IDLE_LOCK_MS = 10 / 60 * 1000;
 
 /** Best-effort overwrite for extractable raw key bytes. CryptoKey instances

[Survived] BlockStatement
src/App.tsx:31:80
  * browser-supported way to clear those. The wrap KEK is zeroed the moment
  * the private key is unwrapped (see onLoginReady), so it never reaches the
  * session this function retires. */
-function wipePortalSession(value: Pick<PortalSession, "noteKey"> | null): void {
-  if (!value) return;
-  value.noteKey.fill(0);
-}
+function wipePortalSession(value: Pick<PortalSession, "noteKey"> | null): void {}
 
 export function App(): React.JSX.Element {

[Survived] BooleanLiteral
src/App.tsx:32:7
  * the private key is unwrapped (see onLoginReady), so it never reaches the
  * session this function retires. */
 function wipePortalSession(value: Pick<PortalSession, "noteKey"> | null): void {
-  if (!value) return;
+  if (value) return;
   value.noteKey.fill(0);
 }

[Survived] ConditionalExpression
src/App.tsx:32:7
  * the private key is unwrapped (see onLoginReady), so it never reaches the
  * session this function retires. */
 function wipePortalSession(value: Pick<PortalSession, "noteKey"> | null): void {
-  if (!value) return;
+  if (false) return;
   value.noteKey.fill(0);
 }

[Survived] CallExpression
src/App.tsx:33:3
  * session this function retires. */
 function wipePortalSession(value: Pick<PortalSession, "noteKey"> | null): void {
   if (!value) return;
-  value.noteKey.fill(0);
+  ;
 }
 

[Survived] BlockStatement
src/App.tsx:46:82
   const lifecycle = useRef(0);
   const loginAttempt = useRef(0);
 
-  const replacePortalSession = useCallback((next: PortalSession | null): void => {
-    const previous = sessionRef.current;
-    if (previous && previous !== next) wipePortalSession(previous);
-    sessionRef.current = next;
-    setSessionState(next);
-  }, []);
+  const replacePortalSession = useCallback((next: PortalSession | null): void => {}, []);
 
   const lockDown = useCallback((message: string) => {

[Survived] EqualityOperator
src/App.tsx:48:21
 
   const replacePortalSession = useCallback((next: PortalSession | null): void => {
     const previous = sessionRef.current;
-    if (previous && previous !== next) wipePortalSession(previous);
+    if (previous && previous === next) wipePortalSession(previous);
     sessionRef.current = next;
     setSessionState(next);

[Survived] CallExpression
src/App.tsx:48:40
 
   const replacePortalSession = useCallback((next: PortalSession | null): void => {
     const previous = sessionRef.current;
-    if (previous && previous !== next) wipePortalSession(previous);
+    if (previous && previous !== next) ;
     sessionRef.current = next;
     setSessionState(next);

[Survived] CallExpression
src/App.tsx:50:5
     const previous = sessionRef.current;
     if (previous && previous !== next) wipePortalSession(previous);
     sessionRef.current = next;
-    setSessionState(next);
+    ;
   }, []);
 

[Survived] BlockStatement
src/App.tsx:53:53
     setSessionState(next);
   }, []);
 
-  const lockDown = useCallback((message: string) => {
-    lifecycle.current += 1;
-    loginAttempt.current += 1;
-    const retiring = sessionRef.current;
-    if (retiring) localStore.removePrefix(`mindpattern.lastVisit.${retiring.userId}.`);
-    clearSession();
-    replacePortalSession(null);
-    setDisplayName("");
-    setUnlockError("");
-    setNotice(message);
-    setView({ kind: "login" });
-  }, [replacePortalSession]);
+  const lockDown = useCallback((message: string) => {}, [replacePortalSession]);
 
   // Session-expiry (2026-09-17): any 401 swaps the UI to an explicit

[Survived] AssignmentOperator
src/App.tsx:54:5
   }, []);
 
   const lockDown = useCallback((message: string) => {
-    lifecycle.current += 1;
+    lifecycle.current -= 1;
     loginAttempt.current += 1;
     const retiring = sessionRef.current;

[Survived] AssignmentOperator
src/App.tsx:55:5
 
   const lockDown = useCallback((message: string) => {
     lifecycle.current += 1;
-    loginAttempt.current += 1;
+    loginAttempt.current -= 1;
     const retiring = sessionRef.current;
     if (retiring) localStore.removePrefix(`mindpattern.lastVisit.${retiring.userId}.`);

[Survived] ConditionalExpression
src/App.tsx:57:9
     lifecycle.current += 1;
     loginAttempt.current += 1;
     const retiring = sessionRef.current;
-    if (retiring) localStore.removePrefix(`mindpattern.lastVisit.${retiring.userId}.`);
+    if (true) localStore.removePrefix(`mindpattern.lastVisit.${retiring.userId}.`);
     clearSession();
     replacePortalSession(null);

[Survived] ConditionalExpression
src/App.tsx:57:9
     lifecycle.current += 1;
     loginAttempt.current += 1;
     const retiring = sessionRef.current;
-    if (retiring) localStore.removePrefix(`mindpattern.lastVisit.${retiring.userId}.`);
+    if (false) localStore.removePrefix(`mindpattern.lastVisit.${retiring.userId}.`);
     clearSession();
     replacePortalSession(null);

[Survived] CallExpression
src/App.tsx:58:5
     loginAttempt.current += 1;
     const retiring = sessionRef.current;
     if (retiring) localStore.removePrefix(`mindpattern.lastVisit.${retiring.userId}.`);
-    clearSession();
+    ;
     replacePortalSession(null);
     setDisplayName("");

[Survived] CallExpression
src/App.tsx:59:5
     const retiring = sessionRef.current;
     if (retiring) localStore.removePrefix(`mindpattern.lastVisit.${retiring.userId}.`);
     clearSession();
-    replacePortalSession(null);
+    ;
     setDisplayName("");
     setUnlockError("");

[Survived] CallExpression
src/App.tsx:62:5
     replacePortalSession(null);
     setDisplayName("");
     setUnlockError("");
-    setNotice(message);
+    ;
     setView({ kind: "login" });
   }, [replacePortalSession]);

[Survived] ObjectLiteral
src/App.tsx:63:13
     setDisplayName("");
     setUnlockError("");
     setNotice(message);
-    setView({ kind: "login" });
+    setView({});
   }, [replacePortalSession]);
 

[Survived] ArrayDeclaration
src/App.tsx:64:6
     setUnlockError("");
     setNotice(message);
     setView({ kind: "login" });
-  }, [replacePortalSession]);
+  }, []);
 
   // Session-expiry (2026-09-17): any 401 swaps the UI to an explicit

[Survived] BlockStatement
src/App.tsx:68:19
 
   // Session-expiry (2026-09-17): any 401 swaps the UI to an explicit
   // expired state instead of a cryptic banner over live keys.
-  useEffect(() => {
-    setUnauthorizedHandler(() => lockDown("Session expired — please sign in again."));
-    return () => setUnauthorizedHandler(null);
-  }, []);
+  useEffect(() => {}, []);
 
   // Teardown matters on route replacement / hot reload too, not just the

[Survived] ArrowFunction
src/App.tsx:69:28
   // Session-expiry (2026-09-17): any 401 swaps the UI to an explicit
   // expired state instead of a cryptic banner over live keys.
   useEffect(() => {
-    setUnauthorizedHandler(() => lockDown("Session expired — please sign in again."));
+    setUnauthorizedHandler(() => undefined);
     return () => setUnauthorizedHandler(null);
   }, []);

[Survived] ArrowFunction
src/App.tsx:70:12
   // expired state instead of a cryptic banner over live keys.
   useEffect(() => {
     setUnauthorizedHandler(() => lockDown("Session expired — please sign in again."));
-    return () => setUnauthorizedHandler(null);
+    return () => undefined;
   }, []);
 

[Survived] BlockStatement
src/App.tsx:75:25
 
   // Teardown matters on route replacement / hot reload too, not just the
   // explicit sign-out button.
-  useEffect(() => () => {
-    lifecycle.current += 1;
-    clearSession();
-    const retiring = sessionRef.current;
-    if (retiring) localStore.removePrefix(`mindpattern.lastVisit.${retiring.userId}.`);
-    wipePortalSession(retiring);
-    sessionRef.current = null;
-  }, []);
+  useEffect(() => () => {}, []);
 
   // Idle auto-lock: reset on any real interaction.

[Survived] ArrowFunction
src/App.tsx:75:13
 
   // Teardown matters on route replacement / hot reload too, not just the
   // explicit sign-out button.
-  useEffect(() => () => {
-    lifecycle.current += 1;
-    clearSession();
-    const retiring = sessionRef.current;
-    if (retiring) localStore.removePrefix(`mindpattern.lastVisit.${retiring.userId}.`);
-    wipePortalSession(retiring);
-    sessionRef.current = null;
-  }, []);
+  useEffect(() => undefined, []);
 
   // Idle auto-lock: reset on any real interaction.

[Survived] AssignmentOperator
src/App.tsx:76:5
   // Teardown matters on route replacement / hot reload too, not just the
   // explicit sign-out button.
   useEffect(() => () => {
-    lifecycle.current += 1;
+    lifecycle.current -= 1;
     clearSession();
     const retiring = sessionRef.current;

[Survived] CallExpression
src/App.tsx:77:5
   // explicit sign-out button.
   useEffect(() => () => {
     lifecycle.current += 1;
-    clearSession();
+    ;
     const retiring = sessionRef.current;
     if (retiring) localStore.removePrefix(`mindpattern.lastVisit.${retiring.userId}.`);

[Survived] CallExpression
src/App.tsx:80:5
     clearSession();
     const retiring = sessionRef.current;
     if (retiring) localStore.removePrefix(`mindpattern.lastVisit.${retiring.userId}.`);
-    wipePortalSession(retiring);
+    ;
     sessionRef.current = null;
   }, []);

[Survived] CallExpression
src/App.tsx:85:3
   }, []);
 
   // Idle auto-lock: reset on any real interaction.
-  useEffect(() => {
-    if (!session) return;
-    let timer = setTimeout(() => lockDown("Locked after inactivity — sign in again to continue."), IDLE_LOCK_MS);
-    const bump = (): void => {
-      clearTimeout(timer);
-      timer = setTimeout(() => lockDown("Locked after inactivity — sign in again to continue."), IDLE_LOCK_MS);
-    };
-    const events: (keyof WindowEventMap)[] = ["click", "keydown", "mousemove", "scroll", "touchstart"];
-    events.forEach((ev) => window.addEventListener(ev, bump, { passive: true }));
-    return () => {
-      clearTimeout(timer);
-      events.forEach((ev) => window.removeEventListener(ev, bump));
-    };
-  }, [session]);
+  ;
 
   const onLoginReady = async (keys: PortalKeys) => {

[Survived] BlockStatement
src/App.tsx:85:19
   }, []);
 
   // Idle auto-lock: reset on any real interaction.
-  useEffect(() => {
-    if (!session) return;
-    let timer = setTimeout(() => lockDown("Locked after inactivity — sign in again to continue."), IDLE_LOCK_MS);
-    const bump = (): void => {
-      clearTimeout(timer);
-      timer = setTimeout(() => lockDown("Locked after inactivity — sign in again to continue."), IDLE_LOCK_MS);
-    };
-    const events: (keyof WindowEventMap)[] = ["click", "keydown", "mousemove", "scroll", "touchstart"];
-    events.forEach((ev) => window.addEventListener(ev, bump, { passive: true }));
-    return () => {
-      clearTimeout(timer);
-      events.forEach((ev) => window.removeEventListener(ev, bump));
-    };
-  }, [session]);
+  useEffect(() => {}, [session]);
 
   const onLoginReady = async (keys: PortalKeys) => {

[Survived] ConditionalExpression
src/App.tsx:86:9
 
   // Idle auto-lock: reset on any real interaction.
   useEffect(() => {
-    if (!session) return;
+    if (false) return;
     let timer = setTimeout(() => lockDown("Locked after inactivity — sign in again to continue."), IDLE_LOCK_MS);
     const bump = (): void => {

[Survived] BooleanLiteral
src/App.tsx:86:9
 
   // Idle auto-lock: reset on any real interaction.
   useEffect(() => {
-    if (!session) return;
+    if (session) return;
     let timer = setTimeout(() => lockDown("Locked after inactivity — sign in again to continue."), IDLE_LOCK_MS);
     const bump = (): void => {

[Survived] ArrowFunction
src/App.tsx:87:28
   // Idle auto-lock: reset on any real interaction.
   useEffect(() => {
     if (!session) return;
-    let timer = setTimeout(() => lockDown("Locked after inactivity — sign in again to continue."), IDLE_LOCK_MS);
+    let timer = setTimeout(() => undefined, IDLE_LOCK_MS);
     const bump = (): void => {
       clearTimeout(timer);

[NoCoverage] BlockStatement
src/App.tsx:88:30
   useEffect(() => {
     if (!session) return;
     let timer = setTimeout(() => lockDown("Locked after inactivity — sign in again to continue."), IDLE_LOCK_MS);
-    const bump = (): void => {
-      clearTimeout(timer);
-      timer = setTimeout(() => lockDown("Locked after inactivity — sign in again to continue."), IDLE_LOCK_MS);
-    };
+    const bump = (): void => {};
     const events: (keyof WindowEventMap)[] = ["click", "keydown", "mousemove", "scroll", "touchstart"];
     events.forEach((ev) => window.addEventListener(ev, bump, { passive: true }));

[NoCoverage] CallExpression
src/App.tsx:89:7
     if (!session) return;
     let timer = setTimeout(() => lockDown("Locked after inactivity — sign in again to continue."), IDLE_LOCK_MS);
     const bump = (): void => {
-      clearTimeout(timer);
+      ;
       timer = setTimeout(() => lockDown("Locked after inactivity — sign in again to continue."), IDLE_LOCK_MS);
     };

[NoCoverage] ArrowFunction
src/App.tsx:90:26
     let timer = setTimeout(() => lockDown("Locked after inactivity — sign in again to continue."), IDLE_LOCK_MS);
     const bump = (): void => {
       clearTimeout(timer);
-      timer = setTimeout(() => lockDown("Locked after inactivity — sign in again to continue."), IDLE_LOCK_MS);
+      timer = setTimeout(() => undefined, IDLE_LOCK_MS);
     };
     const events: (keyof WindowEventMap)[] = ["click", "keydown", "mousemove", "scroll", "touchstart"];

[Survived] StringLiteral
src/App.tsx:92:67
       clearTimeout(timer);
       timer = setTimeout(() => lockDown("Locked after inactivity — sign in again to continue."), IDLE_LOCK_MS);
     };
-    const events: (keyof WindowEventMap)[] = ["click", "keydown", "mousemove", "scroll", "touchstart"];
+    const events: (keyof WindowEventMap)[] = ["click", "keydown", "", "scroll", "touchstart"];
     events.forEach((ev) => window.addEventListener(ev, bump, { passive: true }));
     return () => {

[Survived] ArrowFunction
src/App.tsx:93:20
       timer = setTimeout(() => lockDown("Locked after inactivity — sign in again to continue."), IDLE_LOCK_MS);
     };
     const events: (keyof WindowEventMap)[] = ["click", "keydown", "mousemove", "scroll", "touchstart"];
-    events.forEach((ev) => window.addEventListener(ev, bump, { passive: true }));
+    events.forEach(() => undefined);
     return () => {
       clearTimeout(timer);

[Survived] BooleanLiteral
src/App.tsx:93:73
       timer = setTimeout(() => lockDown("Locked after inactivity — sign in again to continue."), IDLE_LOCK_MS);
     };
     const events: (keyof WindowEventMap)[] = ["click", "keydown", "mousemove", "scroll", "touchstart"];
-    events.forEach((ev) => window.addEventListener(ev, bump, { passive: true }));
+    events.forEach((ev) => window.addEventListener(ev, bump, { passive: false }));
     return () => {
       clearTimeout(timer);

[Survived] BlockStatement
src/App.tsx:94:18
     };
     const events: (keyof WindowEventMap)[] = ["click", "keydown", "mousemove", "scroll", "touchstart"];
     events.forEach((ev) => window.addEventListener(ev, bump, { passive: true }));
-    return () => {
-      clearTimeout(timer);
-      events.forEach((ev) => window.removeEventListener(ev, bump));
-    };
+    return () => {};
   }, [session]);
 

[Survived] CallExpression
src/App.tsx:95:7
     const events: (keyof WindowEventMap)[] = ["click", "keydown", "mousemove", "scroll", "touchstart"];
     events.forEach((ev) => window.addEventListener(ev, bump, { passive: true }));
     return () => {
-      clearTimeout(timer);
+      ;
       events.forEach((ev) => window.removeEventListener(ev, bump));
     };

[Survived] ArrowFunction
src/App.tsx:96:22
     events.forEach((ev) => window.addEventListener(ev, bump, { passive: true }));
     return () => {
       clearTimeout(timer);
-      events.forEach((ev) => window.removeEventListener(ev, bump));
+      events.forEach(() => undefined);
     };
   }, [session]);

[Survived] UpdateOperator
src/App.tsx:102:21
 
   const onLoginReady = async (keys: PortalKeys) => {
     const startedAt = lifecycle.current;
-    const attempt = ++loginAttempt.current;
+    const attempt = --loginAttempt.current;
     setUnlockError("");
     setNotice(null);

[Survived] StringLiteral
src/App.tsx:103:20
   const onLoginReady = async (keys: PortalKeys) => {
     const startedAt = lifecycle.current;
     const attempt = ++loginAttempt.current;
-    setUnlockError("");
+    setUnlockError("Stryker was here!");
     setNotice(null);
     try {

[Survived] CallExpression
src/App.tsx:104:5
     const startedAt = lifecycle.current;
     const attempt = ++loginAttempt.current;
     setUnlockError("");
-    setNotice(null);
+    ;
     try {
       const me = await api.me();

[Survived] BlockStatement
src/App.tsx:105:9
     const attempt = ++loginAttempt.current;
     setUnlockError("");
     setNotice(null);
-    try {
-      const me = await api.me();
-      const privateKey = await unlockWrapPrivateKey(keys.wrapKek, me.wrap_key_blob, keys.username);
-      // The wrap KEK's only job is this one unwrap; the session keeps the
-      // non-extractable private-key handle instead. Zero the raw KEK bytes
-      // now so a memory disclosure for the rest of the session (extension,
-      // crash dump) cannot recover the key that decrypts wrap_key_blob.
-      keys.wrapKek.fill(0);
-      // A 401, explicit logout, or component teardown may have occurred
-      // while the encrypted wrap key was being fetched/decrypted.  Never
-      // resurrect a completed session after that boundary.
-      if (attempt !== loginAttempt.current || startedAt !== lifecycle.current || !hasSession()) {
-        wipePortalSession(keys);
-        return;
-      }
-      replacePortalSession({
-        username: keys.username,
-        userId: keys.userId,
-        noteKey: keys.noteKey,
-        privateKey,
-        publicKeyB64: me.wrap_pub_key,
-      });
-      setDisplayName(me.display_name);
-      setView({ kind: "patients" });
-    } catch (err) {
+    try {} catch (err) {
       wipePortalSession(keys);
       if (attempt === loginAttempt.current && startedAt === lifecycle.current) {

[Survived] CallExpression
src/App.tsx:112:7
       // non-extractable private-key handle instead. Zero the raw KEK bytes
       // now so a memory disclosure for the rest of the session (extension,
       // crash dump) cannot recover the key that decrypts wrap_key_blob.
-      keys.wrapKek.fill(0);
+      ;
       // A 401, explicit logout, or component teardown may have occurred
       // while the encrypted wrap key was being fetched/decrypted.  Never

[Survived] LogicalOperator
src/App.tsx:116:11
       // A 401, explicit logout, or component teardown may have occurred
       // while the encrypted wrap key was being fetched/decrypted.  Never
       // resurrect a completed session after that boundary.
-      if (attempt !== loginAttempt.current || startedAt !== lifecycle.current || !hasSession()) {
+      if ((attempt !== loginAttempt.current || startedAt !== lifecycle.current) && !hasSession()) {
         wipePortalSession(keys);
         return;

[Survived] BooleanLiteral
src/App.tsx:116:82
       // A 401, explicit logout, or component teardown may have occurred
       // while the encrypted wrap key was being fetched/decrypted.  Never
       // resurrect a completed session after that boundary.
-      if (attempt !== loginAttempt.current || startedAt !== lifecycle.current || !hasSession()) {
+      if (attempt !== loginAttempt.current || startedAt !== lifecycle.current || hasSession()) {
         wipePortalSession(keys);
         return;

[NoCoverage] CallExpression
src/App.tsx:117:9
       // while the encrypted wrap key was being fetched/decrypted.  Never
       // resurrect a completed session after that boundary.
       if (attempt !== loginAttempt.current || startedAt !== lifecycle.current || !hasSession()) {
-        wipePortalSession(keys);
+        ;
         return;
       }

[Survived] ObjectLiteral
src/App.tsx:120:28
         wipePortalSession(keys);
         return;
       }
-      replacePortalSession({
-        username: keys.username,
-        userId: keys.userId,
-        noteKey: keys.noteKey,
-        privateKey,
-        publicKeyB64: me.wrap_pub_key,
-      });
+      replacePortalSession({});
       setDisplayName(me.display_name);
       setView({ kind: "patients" });

[Survived] CallExpression
src/App.tsx:127:7
         privateKey,
         publicKeyB64: me.wrap_pub_key,
       });
-      setDisplayName(me.display_name);
+      ;
       setView({ kind: "patients" });
     } catch (err) {

[Survived] BlockStatement
src/App.tsx:129:19
       });
       setDisplayName(me.display_name);
       setView({ kind: "patients" });
-    } catch (err) {
-      wipePortalSession(keys);
-      if (attempt === loginAttempt.current && startedAt === lifecycle.current) {
-        clearSession();
-        replacePortalSession(null);
-        setUnlockError(
-          err instanceof Error && err.name === "TamperError"
-            ? "your stored sharing key could not be unlocked with this password — sign in with the account's password"
-            : err instanceof Error
-              ? err.message
-              : "could not unlock your sharing key",
-        );
-        setView({ kind: "login" });
-      }
-    }
+    } catch (err) {}
   };
 

[Survived] CallExpression
src/App.tsx:130:7
       setDisplayName(me.display_name);
       setView({ kind: "patients" });
     } catch (err) {
-      wipePortalSession(keys);
+      ;
       if (attempt === loginAttempt.current && startedAt === lifecycle.current) {
         clearSession();

[Survived] BlockStatement
src/App.tsx:131:80
       setView({ kind: "patients" });
     } catch (err) {
       wipePortalSession(keys);
-      if (attempt === loginAttempt.current && startedAt === lifecycle.current) {
-        clearSession();
-        replacePortalSession(null);
-        setUnlockError(
-          err instanceof Error && err.name === "TamperError"
-            ? "your stored sharing key could not be unlocked with this password — sign in with the account's password"
-            : err instanceof Error
-              ? err.message
-              : "could not unlock your sharing key",
-        );
-        setView({ kind: "login" });
-      }
+      if (attempt === loginAttempt.current && startedAt === lifecycle.current) {}
     }
   };

[Survived] LogicalOperator
src/App.tsx:131:11
       setView({ kind: "patients" });
     } catch (err) {
       wipePortalSession(keys);
-      if (attempt === loginAttempt.current && startedAt === lifecycle.current) {
+      if (attempt === loginAttempt.current || startedAt === lifecycle.current) {
         clearSession();
         replacePortalSession(null);

[Survived] CallExpression
src/App.tsx:132:9
     } catch (err) {
       wipePortalSession(keys);
       if (attempt === loginAttempt.current && startedAt === lifecycle.current) {
-        clearSession();
+        ;
         replacePortalSession(null);
         setUnlockError(

[Survived] EqualityOperator
src/App.tsx:135:35
         clearSession();
         replacePortalSession(null);
         setUnlockError(
-          err instanceof Error && err.name === "TamperError"
+          err instanceof Error && err.name !== "TamperError"
             ? "your stored sharing key could not be unlocked with this password — sign in with the account's password"
             : err instanceof Error

[Survived] ConditionalExpression
src/App.tsx:135:11
         clearSession();
         replacePortalSession(null);
         setUnlockError(
-          err instanceof Error && err.name === "TamperError"
+          true
             ? "your stored sharing key could not be unlocked with this password — sign in with the account's password"
             : err instanceof Error

[Survived] StringLiteral
src/App.tsx:136:15
         replacePortalSession(null);
         setUnlockError(
           err instanceof Error && err.name === "TamperError"
-            ? "your stored sharing key could not be unlocked with this password — sign in with the account's password"
+            ? ""
             : err instanceof Error
               ? err.message

[Survived] ObjectLiteral
src/App.tsx:141:17
               ? err.message
               : "could not unlock your sharing key",
         );
-        setView({ kind: "login" });
+        setView({});
       }
     }

[Survived] EqualityOperator
src/App.tsx:146:7
     }
   };
 
-  if (view.kind === "login") {
+  if (view.kind !== "login") {
     return (
       <>

[Survived] ConditionalExpression
src/App.tsx:146:7
     }
   };
 
-  if (view.kind === "login") {
+  if (true) {
     return (
       <>

[Survived] ConditionalExpression
src/App.tsx:149:10
   if (view.kind === "login") {
     return (
       <>
-        {notice && (
-          <div style={{ backgroundColor: "#1d2433", color: "#a8c0f0", padding: "10px 16px", fontSize: 14 }}>
-            {notice}
-          </div>
-        )}
+        {false}
         {unlockError && (
           <div style={{ backgroundColor: "#2a1a17", color: "#f0b6ad", padding: "10px 16px", fontSize: 14 }}>

[Survived] LogicalOperator
src/App.tsx:149:10
   if (view.kind === "login") {
     return (
       <>
-        {notice && (
-          <div style={{ backgroundColor: "#1d2433", color: "#a8c0f0", padding: "10px 16px", fontSize: 14 }}>
-            {notice}
-          </div>
-        )}
+        {notice || <div style={{
+  backgroundColor: "#1d2433",
+  color: "#a8c0f0",
+  padding: "10px 16px",
+  fontSize: 14
+}}>
+            {notice}
+          </div>}
         {unlockError && (
           <div style={{ backgroundColor: "#2a1a17", color: "#f0b6ad", padding: "10px 16px", fontSize: 14 }}>

[Survived] ConditionalExpression
src/App.tsx:154:10
             {notice}
           </div>
         )}
-        {unlockError && (
-          <div style={{ backgroundColor: "#2a1a17", color: "#f0b6ad", padding: "10px 16px", fontSize: 14 }}>
-            {unlockError}
-          </div>
-        )}
+        {true}
         <LoginView onReady={(keys) => onLoginReady(keys)} />
       </>

[Survived] ConditionalExpression
src/App.tsx:154:10
             {notice}
           </div>
         )}
-        {unlockError && (
-          <div style={{ backgroundColor: "#2a1a17", color: "#f0b6ad", padding: "10px 16px", fontSize: 14 }}>
-            {unlockError}
-          </div>
-        )}
+        {false}
         <LoginView onReady={(keys) => onLoginReady(keys)} />
       </>

[Survived] ArrowFunction
src/App.tsx:159:29
             {unlockError}
           </div>
         )}
-        <LoginView onReady={(keys) => onLoginReady(keys)} />
+        <LoginView onReady={() => undefined} />
       </>
     );

[NoCoverage] BlockStatement
src/App.tsx:164:17
     );
   }
 
-  if (!session) {
-    return <p style={{ color: theme.text }}>Unlocking…</p>;
-  }
+  if (!session) {}
 
   if (view.kind === "patient") {

[Survived] ConditionalExpression
src/App.tsx:168:7
     return <p style={{ color: theme.text }}>Unlocking…</p>;
   }
 
-  if (view.kind === "patient") {
+  if (false) {
     return (
       <PatientView

[Survived] ConditionalExpression
src/App.tsx:168:7
     return <p style={{ color: theme.text }}>Unlocking…</p>;
   }
 
-  if (view.kind === "patient") {
+  if (true) {
     return (
       <PatientView

[Survived] ArrowFunction
src/App.tsx:173:17
       <PatientView
         patient={view.patient}
         session={session}
-        onBack={() => setView({ kind: "patients" })}
+        onBack={() => undefined}
         onSignOut={() => lockDown("Signed out. Your in-memory keys were cleared.")}
       />

[Survived] ObjectLiteral
src/App.tsx:173:31
       <PatientView
         patient={view.patient}
         session={session}
-        onBack={() => setView({ kind: "patients" })}
+        onBack={() => setView({})}
         onSignOut={() => lockDown("Signed out. Your in-memory keys were cleared.")}
       />

[Survived] ArrowFunction
src/App.tsx:174:20
         patient={view.patient}
         session={session}
         onBack={() => setView({ kind: "patients" })}
-        onSignOut={() => lockDown("Signed out. Your in-memory keys were cleared.")}
+        onSignOut={() => undefined}
       />
     );

[Survived] ArrowFunction
src/App.tsx:183:15
     <PatientsView
       displayName={displayName}
       session={session}
-      onOpen={(patient) => setView({ kind: "patient", patient })}
+      onOpen={() => undefined}
       onSignOut={() => {
         lockDown("Signed out. Your in-memory keys were cleared.");

[Survived] BlockStatement
src/App.tsx:184:24
       displayName={displayName}
       session={session}
       onOpen={(patient) => setView({ kind: "patient", patient })}
-      onSignOut={() => {
-        lockDown("Signed out. Your in-memory keys were cleared.");
-      }}
+      onSignOut={() => {}}
     />
   );
