[Killed] ArrowFunction
src/views/PatientView.tsx:53:15
   sentiment: number | null | undefined;
 }
 
-const dayOf = (iso: string): string => iso.slice(0, 10);
+const dayOf = () => undefined;
 // The server also caps each page at 2 MiB of raw ciphertext.  Keep the
 // client-side aggregate finite: an evidence card describes at most 60 dates,
killedBy: PatientView flags patterns new since the last visit via the local stamp
statusReason: expected 'The new-pattern count anchors the fir…' to contain '1 pattern new since you marked review…'

[Survived] MethodExpression
src/views/PatientView.tsx:53:40
   sentiment: number | null | undefined;
 }
 
-const dayOf = (iso: string): string => iso.slice(0, 10);
+const dayOf = (iso: string): string => iso;
 // The server also caps each page at 2 MiB of raw ciphertext.  Keep the
 // client-side aggregate finite: an evidence card describes at most 60 dates,

[Killed] ArithmeticOperator
src/views/PatientView.tsx:60:30
 // in one drill-down without turning the browser into an unbounded cache.
 const ENTRY_PAGE_SIZE = THERAPIST_ENTRY_PAGE_SIZE;
 const MAX_ENTRY_PAGES = 8;
-const MAX_EVIDENCE_ENTRIES = ENTRY_PAGE_SIZE * MAX_ENTRY_PAGES;
+const MAX_EVIDENCE_ENTRIES = ENTRY_PAGE_SIZE / MAX_ENTRY_PAGES;
 const NOTE_PAGE_SIZE = THERAPIST_NOTE_PAGE_SIZE;
 const MAX_NOTE_PAGES = 20;
killedBy: PatientView renders pattern cards, the sensitive card non-quoting, and the drill-down
statusReason: expected 'The new-pattern count anchors the fir…' to contain 'decrypted e-1'

[Killed] ArrowFunction
src/views/PatientView.tsx:70:22
 // loop.
 const MAX_COLLECTION_CHANGE_RESTARTS = 1;
 
-const lastVisitKey = (therapistId: string, userId: string): string =>
-  `mindpattern.lastVisit.${therapistId}.${userId}`;
+const lastVisitKey = () => undefined;
 
 /** Session-note starters (2026-09-17): light scaffolds, never clinical
killedBy: PatientView flags patterns new since the last visit via the local stamp
statusReason: expected 'The new-pattern count anchors the fir…' to contain '1 pattern new since you marked review…'

[Killed] StringLiteral
src/views/PatientView.tsx:76:3
 /** Session-note starters (2026-09-17): light scaffolds, never clinical
  *  templates — the therapist's own record, their own words. */
 const NOTE_TEMPLATES: readonly string[] = [
-  "Session focus:\n- \n- \n",
+  "",
   "Observed together:\n- \n",
   "Homework / between-session plan:\n- \n",
killedBy: PatientView 2026-09-17 wave note templates and copy-forward seed the draft
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/views/PatientView.tsx:78:3
 const NOTE_TEMPLATES: readonly string[] = [
   "Session focus:\n- \n- \n",
   "Observed together:\n- \n",
-  "Homework / between-session plan:\n- \n",
+  "",
   "Questions for next visit:\n- \n",
 ];

[Survived] ConditionalExpression
src/views/PatientView.tsx:86:7
   const d = pattern.detail;
   // Crisis-adjacent wording is never quoted back (the same contract the
   // patient's app renders); the drill-down still shows the full entries.
-  if (d.sensitive) {
+  if (true) {
     return "A difficult thought has been returning in the patient's writing — the entries below show it in the patient's own words.";
   }

[Survived] ConditionalExpression
src/views/PatientView.tsx:86:7
   const d = pattern.detail;
   // Crisis-adjacent wording is never quoted back (the same contract the
   // patient's app renders); the drill-down still shows the full entries.
-  if (d.sensitive) {
+  if (false) {
     return "A difficult thought has been returning in the patient's writing — the entries below show it in the patient's own words.";
   }

[Survived] StringLiteral
src/views/PatientView.tsx:87:12
   // Crisis-adjacent wording is never quoted back (the same contract the
   // patient's app renders); the drill-down still shows the full entries.
   if (d.sensitive) {
-    return "A difficult thought has been returning in the patient's writing — the entries below show it in the patient's own words.";
+    return "";
   }
   switch (pattern.kind) {

[Survived] ConditionalExpression
src/views/PatientView.tsx:90:5
     return "A difficult thought has been returning in the patient's writing — the entries below show it in the patient's own words.";
   }
   switch (pattern.kind) {
-    case "temporal":
-      return `'${pattern.label}' concentrates on ${d.day ?? "certain days"} (${d.day_count ?? "?"} of ${pattern.occurrences} mentions).`;
+    case "temporal":
     case "mood_correlation":
       return `Entries read ${d.direction === "lower" ? "lower" : "higher"} on days '${pattern.label}' appears (mood delta ${String(d.mood_delta ?? "?")}).`;

[Survived] LogicalOperator
src/views/PatientView.tsx:91:52
   }
   switch (pattern.kind) {
     case "temporal":
-      return `'${pattern.label}' concentrates on ${d.day ?? "certain days"} (${d.day_count ?? "?"} of ${pattern.occurrences} mentions).`;
+      return `'${pattern.label}' concentrates on ${d.day && "certain days"} (${d.day_count ?? "?"} of ${pattern.occurrences} mentions).`;
     case "mood_correlation":
       return `Entries read ${d.direction === "lower" ? "lower" : "higher"} on days '${pattern.label}' appears (mood delta ${String(d.mood_delta ?? "?")}).`;

[Survived] LogicalOperator
src/views/PatientView.tsx:91:80
   }
   switch (pattern.kind) {
     case "temporal":
-      return `'${pattern.label}' concentrates on ${d.day ?? "certain days"} (${d.day_count ?? "?"} of ${pattern.occurrences} mentions).`;
+      return `'${pattern.label}' concentrates on ${d.day ?? "certain days"} (${d.day_count && "?"} of ${pattern.occurrences} mentions).`;
     case "mood_correlation":
       return `Entries read ${d.direction === "lower" ? "lower" : "higher"} on days '${pattern.label}' appears (mood delta ${String(d.mood_delta ?? "?")}).`;

[Survived] ConditionalExpression
src/views/PatientView.tsx:92:5
   switch (pattern.kind) {
     case "temporal":
       return `'${pattern.label}' concentrates on ${d.day ?? "certain days"} (${d.day_count ?? "?"} of ${pattern.occurrences} mentions).`;
-    case "mood_correlation":
-      return `Entries read ${d.direction === "lower" ? "lower" : "higher"} on days '${pattern.label}' appears (mood delta ${String(d.mood_delta ?? "?")}).`;
+    case "mood_correlation":
     case "link":
       return `About ${String(d.lag_days ?? 1)} day(s) after '${pattern.label}' comes up, entries read ${String(d.direction ?? "lower")}.`;

[Survived] ConditionalExpression
src/views/PatientView.tsx:93:30
     case "temporal":
       return `'${pattern.label}' concentrates on ${d.day ?? "certain days"} (${d.day_count ?? "?"} of ${pattern.occurrences} mentions).`;
     case "mood_correlation":
-      return `Entries read ${d.direction === "lower" ? "lower" : "higher"} on days '${pattern.label}' appears (mood delta ${String(d.mood_delta ?? "?")}).`;
+      return `Entries read ${true ? "lower" : "higher"} on days '${pattern.label}' appears (mood delta ${String(d.mood_delta ?? "?")}).`;
     case "link":
       return `About ${String(d.lag_days ?? 1)} day(s) after '${pattern.label}' comes up, entries read ${String(d.direction ?? "lower")}.`;

[Survived] ConditionalExpression
src/views/PatientView.tsx:93:30
     case "temporal":
       return `'${pattern.label}' concentrates on ${d.day ?? "certain days"} (${d.day_count ?? "?"} of ${pattern.occurrences} mentions).`;
     case "mood_correlation":
-      return `Entries read ${d.direction === "lower" ? "lower" : "higher"} on days '${pattern.label}' appears (mood delta ${String(d.mood_delta ?? "?")}).`;
+      return `Entries read ${false ? "lower" : "higher"} on days '${pattern.label}' appears (mood delta ${String(d.mood_delta ?? "?")}).`;
     case "link":
       return `About ${String(d.lag_days ?? 1)} day(s) after '${pattern.label}' comes up, entries read ${String(d.direction ?? "lower")}.`;

[Survived] ConditionalExpression
src/views/PatientView.tsx:94:5
       return `'${pattern.label}' concentrates on ${d.day ?? "certain days"} (${d.day_count ?? "?"} of ${pattern.occurrences} mentions).`;
     case "mood_correlation":
       return `Entries read ${d.direction === "lower" ? "lower" : "higher"} on days '${pattern.label}' appears (mood delta ${String(d.mood_delta ?? "?")}).`;
-    case "link":
-      return `About ${String(d.lag_days ?? 1)} day(s) after '${pattern.label}' comes up, entries read ${String(d.direction ?? "lower")}.`;
+    case "link":
     case "mood_shift":
       return `Entries have read ${String(d.direction ?? "lower")} than the patient's own baseline lately.`;

[Survived] StringLiteral
src/views/PatientView.tsx:94:10
       return `'${pattern.label}' concentrates on ${d.day ?? "certain days"} (${d.day_count ?? "?"} of ${pattern.occurrences} mentions).`;
     case "mood_correlation":
       return `Entries read ${d.direction === "lower" ? "lower" : "higher"} on days '${pattern.label}' appears (mood delta ${String(d.mood_delta ?? "?")}).`;
-    case "link":
+    case "":
       return `About ${String(d.lag_days ?? 1)} day(s) after '${pattern.label}' comes up, entries read ${String(d.direction ?? "lower")}.`;
     case "mood_shift":

[Survived] LogicalOperator
src/views/PatientView.tsx:95:112
     case "mood_correlation":
       return `Entries read ${d.direction === "lower" ? "lower" : "higher"} on days '${pattern.label}' appears (mood delta ${String(d.mood_delta ?? "?")}).`;
     case "link":
-      return `About ${String(d.lag_days ?? 1)} day(s) after '${pattern.label}' comes up, entries read ${String(d.direction ?? "lower")}.`;
+      return `About ${String(d.lag_days ?? 1)} day(s) after '${pattern.label}' comes up, entries read ${String(d.direction && "lower")}.`;
     case "mood_shift":
       return `Entries have read ${String(d.direction ?? "lower")} than the patient's own baseline lately.`;

[Survived] LogicalOperator
src/views/PatientView.tsx:95:30
     case "mood_correlation":
       return `Entries read ${d.direction === "lower" ? "lower" : "higher"} on days '${pattern.label}' appears (mood delta ${String(d.mood_delta ?? "?")}).`;
     case "link":
-      return `About ${String(d.lag_days ?? 1)} day(s) after '${pattern.label}' comes up, entries read ${String(d.direction ?? "lower")}.`;
+      return `About ${String(d.lag_days && 1)} day(s) after '${pattern.label}' comes up, entries read ${String(d.direction ?? "lower")}.`;
     case "mood_shift":
       return `Entries have read ${String(d.direction ?? "lower")} than the patient's own baseline lately.`;

[Survived] ConditionalExpression
src/views/PatientView.tsx:96:5
       return `Entries read ${d.direction === "lower" ? "lower" : "higher"} on days '${pattern.label}' appears (mood delta ${String(d.mood_delta ?? "?")}).`;
     case "link":
       return `About ${String(d.lag_days ?? 1)} day(s) after '${pattern.label}' comes up, entries read ${String(d.direction ?? "lower")}.`;
-    case "mood_shift":
-      return `Entries have read ${String(d.direction ?? "lower")} than the patient's own baseline lately.`;
+    case "mood_shift":
     case "inertia":
       return "Mood has been carrying over day to day more than usual for this patient.";

[Survived] LogicalOperator
src/views/PatientView.tsx:97:42
     case "link":
       return `About ${String(d.lag_days ?? 1)} day(s) after '${pattern.label}' comes up, entries read ${String(d.direction ?? "lower")}.`;
     case "mood_shift":
-      return `Entries have read ${String(d.direction ?? "lower")} than the patient's own baseline lately.`;
+      return `Entries have read ${String(d.direction && "lower")} than the patient's own baseline lately.`;
     case "inertia":
       return "Mood has been carrying over day to day more than usual for this patient.";

[Survived] ConditionalExpression
src/views/PatientView.tsx:98:5
       return `About ${String(d.lag_days ?? 1)} day(s) after '${pattern.label}' comes up, entries read ${String(d.direction ?? "lower")}.`;
     case "mood_shift":
       return `Entries have read ${String(d.direction ?? "lower")} than the patient's own baseline lately.`;
-    case "inertia":
-      return "Mood has been carrying over day to day more than usual for this patient.";
+    case "inertia":
     case "instability":
       return "Daily mood has swung more widely than usual for this patient.";

[Survived] StringLiteral
src/views/PatientView.tsx:99:14
     case "mood_shift":
       return `Entries have read ${String(d.direction ?? "lower")} than the patient's own baseline lately.`;
     case "inertia":
-      return "Mood has been carrying over day to day more than usual for this patient.";
+      return "";
     case "instability":
       return "Daily mood has swung more widely than usual for this patient.";

[Survived] ConditionalExpression
src/views/PatientView.tsx:100:5
       return `Entries have read ${String(d.direction ?? "lower")} than the patient's own baseline lately.`;
     case "inertia":
       return "Mood has been carrying over day to day more than usual for this patient.";
-    case "instability":
-      return "Daily mood has swung more widely than usual for this patient.";
+    case "instability":
     case "rumination":
     case "recurring_phrase":

[Survived] StringLiteral
src/views/PatientView.tsx:100:10
       return `Entries have read ${String(d.direction ?? "lower")} than the patient's own baseline lately.`;
     case "inertia":
       return "Mood has been carrying over day to day more than usual for this patient.";
-    case "instability":
+    case "":
       return "Daily mood has swung more widely than usual for this patient.";
     case "rumination":

[Survived] StringLiteral
src/views/PatientView.tsx:101:14
     case "inertia":
       return "Mood has been carrying over day to day more than usual for this patient.";
     case "instability":
-      return "Daily mood has swung more widely than usual for this patient.";
+      return "";
     case "rumination":
     case "recurring_phrase":

[Survived] ConditionalExpression
src/views/PatientView.tsx:103:5
     case "instability":
       return "Daily mood has swung more widely than usual for this patient.";
     case "rumination":
-    case "recurring_phrase":
-      return `The phrase '${pattern.label}' has returned ${pattern.occurrences} times.`;
+    case "recurring_phrase":
     case "topic":
       return `'${pattern.label}' has been taking up more space in the writing.`;

[Survived] StringLiteral
src/views/PatientView.tsx:104:14
       return "Daily mood has swung more widely than usual for this patient.";
     case "rumination":
     case "recurring_phrase":
-      return `The phrase '${pattern.label}' has returned ${pattern.occurrences} times.`;
+      return ``;
     case "topic":
       return `'${pattern.label}' has been taking up more space in the writing.`;

[Survived] ConditionalExpression
src/views/PatientView.tsx:105:5
     case "rumination":
     case "recurring_phrase":
       return `The phrase '${pattern.label}' has returned ${pattern.occurrences} times.`;
-    case "topic":
-      return `'${pattern.label}' has been taking up more space in the writing.`;
+    case "topic":
     case "avoidance":
       return `The day after '${pattern.label}' comes up, the patient tends not to write (${String(pattern.detail.silences ?? "?")} of ${String(pattern.detail.observed ?? "?")} observable such days).`;

[Survived] StringLiteral
src/views/PatientView.tsx:105:10
     case "rumination":
     case "recurring_phrase":
       return `The phrase '${pattern.label}' has returned ${pattern.occurrences} times.`;
-    case "topic":
+    case "":
       return `'${pattern.label}' has been taking up more space in the writing.`;
     case "avoidance":

[Survived] StringLiteral
src/views/PatientView.tsx:106:14
     case "recurring_phrase":
       return `The phrase '${pattern.label}' has returned ${pattern.occurrences} times.`;
     case "topic":
-      return `'${pattern.label}' has been taking up more space in the writing.`;
+      return ``;
     case "avoidance":
       return `The day after '${pattern.label}' comes up, the patient tends not to write (${String(pattern.detail.silences ?? "?")} of ${String(pattern.detail.observed ?? "?")} observable such days).`;

[NoCoverage] ConditionalExpression
src/views/PatientView.tsx:107:5
       return `The phrase '${pattern.label}' has returned ${pattern.occurrences} times.`;
     case "topic":
       return `'${pattern.label}' has been taking up more space in the writing.`;
-    case "avoidance":
-      return `The day after '${pattern.label}' comes up, the patient tends not to write (${String(pattern.detail.silences ?? "?")} of ${String(pattern.detail.observed ?? "?")} observable such days).`;
+    case "avoidance":
     case "cadence":
       return "The patient's writing rhythm has been less regular than their earlier norm.";

[Survived] StringLiteral
src/views/PatientView.tsx:107:10
       return `The phrase '${pattern.label}' has returned ${pattern.occurrences} times.`;
     case "topic":
       return `'${pattern.label}' has been taking up more space in the writing.`;
-    case "avoidance":
+    case "":
       return `The day after '${pattern.label}' comes up, the patient tends not to write (${String(pattern.detail.silences ?? "?")} of ${String(pattern.detail.observed ?? "?")} observable such days).`;
     case "cadence":

[NoCoverage] LogicalOperator
src/views/PatientView.tsx:108:99
     case "topic":
       return `'${pattern.label}' has been taking up more space in the writing.`;
     case "avoidance":
-      return `The day after '${pattern.label}' comes up, the patient tends not to write (${String(pattern.detail.silences ?? "?")} of ${String(pattern.detail.observed ?? "?")} observable such days).`;
+      return `The day after '${pattern.label}' comes up, the patient tends not to write (${String(pattern.detail.silences && "?")} of ${String(pattern.detail.observed ?? "?")} observable such days).`;
     case "cadence":
       return "The patient's writing rhythm has been less regular than their earlier norm.";

[NoCoverage] LogicalOperator
src/views/PatientView.tsx:108:144
     case "topic":
       return `'${pattern.label}' has been taking up more space in the writing.`;
     case "avoidance":
-      return `The day after '${pattern.label}' comes up, the patient tends not to write (${String(pattern.detail.silences ?? "?")} of ${String(pattern.detail.observed ?? "?")} observable such days).`;
+      return `The day after '${pattern.label}' comes up, the patient tends not to write (${String(pattern.detail.silences ?? "?")} of ${String(pattern.detail.observed && "?")} observable such days).`;
     case "cadence":
       return "The patient's writing rhythm has been less regular than their earlier norm.";

[NoCoverage] ConditionalExpression
src/views/PatientView.tsx:109:5
       return `'${pattern.label}' has been taking up more space in the writing.`;
     case "avoidance":
       return `The day after '${pattern.label}' comes up, the patient tends not to write (${String(pattern.detail.silences ?? "?")} of ${String(pattern.detail.observed ?? "?")} observable such days).`;
-    case "cadence":
-      return "The patient's writing rhythm has been less regular than their earlier norm.";
+    case "cadence":
     default:
       return `'${pattern.label}' — ${pattern.occurrences} mentions.`;

[Survived] StringLiteral
src/views/PatientView.tsx:109:10
       return `'${pattern.label}' has been taking up more space in the writing.`;
     case "avoidance":
       return `The day after '${pattern.label}' comes up, the patient tends not to write (${String(pattern.detail.silences ?? "?")} of ${String(pattern.detail.observed ?? "?")} observable such days).`;
-    case "cadence":
+    case "":
       return "The patient's writing rhythm has been less regular than their earlier norm.";
     default:

[Survived] ConditionalExpression
src/views/PatientView.tsx:111:5
       return `The day after '${pattern.label}' comes up, the patient tends not to write (${String(pattern.detail.silences ?? "?")} of ${String(pattern.detail.observed ?? "?")} observable such days).`;
     case "cadence":
       return "The patient's writing rhythm has been less regular than their earlier norm.";
-    default:
-      return `'${pattern.label}' — ${pattern.occurrences} mentions.`;
+    default:
   }
 }

[Survived] BlockStatement
src/views/PatientView.tsx:119:70
 /** Review ordering (2026-09-17): sensitive cards and down-shifts lead the
  *  list — observation-only still permits TRIAGE ordering — then rumination,
  *  then everything else by evidence density. */
-function sortForReview(patterns: PatternPayload[]): PatternPayload[] {
-  const rank = (p: PatternPayload): number => {
-    if (p.detail.sensitive) return 0;
-    if (p.kind === "mood_shift" && p.detail.direction !== "higher") return 1;
-    if (p.kind === "rumination" || p.kind === "avoidance") return 2;
-    return 3;
-  };
-  return [...patterns].sort((a, b) =>
-    rank(a) - rank(b) || (b.detail.strength ?? 0) - (a.detail.strength ?? 0),
-  );
-}
+function sortForReview(patterns: PatternPayload[]): PatternPayload[] {}
 
 /** Inline-SVG mood sparkline over the drill-down entries (their sentiment

[Survived] BlockStatement
src/views/PatientView.tsx:120:47
  *  list — observation-only still permits TRIAGE ordering — then rumination,
  *  then everything else by evidence density. */
 function sortForReview(patterns: PatternPayload[]): PatternPayload[] {
-  const rank = (p: PatternPayload): number => {
-    if (p.detail.sensitive) return 0;
-    if (p.kind === "mood_shift" && p.detail.direction !== "higher") return 1;
-    if (p.kind === "rumination" || p.kind === "avoidance") return 2;
-    return 3;
-  };
+  const rank = (p: PatternPayload): number => {};
   return [...patterns].sort((a, b) =>
     rank(a) - rank(b) || (b.detail.strength ?? 0) - (a.detail.strength ?? 0),

[Survived] ConditionalExpression
src/views/PatientView.tsx:121:9
  *  then everything else by evidence density. */
 function sortForReview(patterns: PatternPayload[]): PatternPayload[] {
   const rank = (p: PatternPayload): number => {
-    if (p.detail.sensitive) return 0;
+    if (false) return 0;
     if (p.kind === "mood_shift" && p.detail.direction !== "higher") return 1;
     if (p.kind === "rumination" || p.kind === "avoidance") return 2;

[Survived] ConditionalExpression
src/views/PatientView.tsx:121:9
  *  then everything else by evidence density. */
 function sortForReview(patterns: PatternPayload[]): PatternPayload[] {
   const rank = (p: PatternPayload): number => {
-    if (p.detail.sensitive) return 0;
+    if (true) return 0;
     if (p.kind === "mood_shift" && p.detail.direction !== "higher") return 1;
     if (p.kind === "rumination" || p.kind === "avoidance") return 2;

[Survived] ConditionalExpression
src/views/PatientView.tsx:122:9
 function sortForReview(patterns: PatternPayload[]): PatternPayload[] {
   const rank = (p: PatternPayload): number => {
     if (p.detail.sensitive) return 0;
-    if (p.kind === "mood_shift" && p.detail.direction !== "higher") return 1;
+    if (false) return 1;
     if (p.kind === "rumination" || p.kind === "avoidance") return 2;
     return 3;

[Survived] ConditionalExpression
src/views/PatientView.tsx:122:9
 function sortForReview(patterns: PatternPayload[]): PatternPayload[] {
   const rank = (p: PatternPayload): number => {
     if (p.detail.sensitive) return 0;
-    if (p.kind === "mood_shift" && p.detail.direction !== "higher") return 1;
+    if (true) return 1;
     if (p.kind === "rumination" || p.kind === "avoidance") return 2;
     return 3;

[Survived] EqualityOperator
src/views/PatientView.tsx:123:36
   const rank = (p: PatternPayload): number => {
     if (p.detail.sensitive) return 0;
     if (p.kind === "mood_shift" && p.detail.direction !== "higher") return 1;
-    if (p.kind === "rumination" || p.kind === "avoidance") return 2;
+    if (p.kind === "rumination" || p.kind !== "avoidance") return 2;
     return 3;
   };

[Survived] ConditionalExpression
src/views/PatientView.tsx:123:36
   const rank = (p: PatternPayload): number => {
     if (p.detail.sensitive) return 0;
     if (p.kind === "mood_shift" && p.detail.direction !== "higher") return 1;
-    if (p.kind === "rumination" || p.kind === "avoidance") return 2;
+    if (p.kind === "rumination" || false) return 2;
     return 3;
   };

[Survived] MethodExpression
src/views/PatientView.tsx:126:10
     if (p.kind === "rumination" || p.kind === "avoidance") return 2;
     return 3;
   };
-  return [...patterns].sort((a, b) =>
-    rank(a) - rank(b) || (b.detail.strength ?? 0) - (a.detail.strength ?? 0),
-  );
+  return [...patterns];
 }
 

[Survived] ArrowFunction
src/views/PatientView.tsx:126:29
     if (p.kind === "rumination" || p.kind === "avoidance") return 2;
     return 3;
   };
-  return [...patterns].sort((a, b) =>
-    rank(a) - rank(b) || (b.detail.strength ?? 0) - (a.detail.strength ?? 0),
+  return [...patterns].sort(() => undefined,
   );
 }

[Survived] LogicalOperator
src/views/PatientView.tsx:127:5
     return 3;
   };
   return [...patterns].sort((a, b) =>
-    rank(a) - rank(b) || (b.detail.strength ?? 0) - (a.detail.strength ?? 0),
+    rank(a) - rank(b) && (b.detail.strength ?? 0) - (a.detail.strength ?? 0),
   );
 }

[Survived] LogicalOperator
src/views/PatientView.tsx:127:54
     return 3;
   };
   return [...patterns].sort((a, b) =>
-    rank(a) - rank(b) || (b.detail.strength ?? 0) - (a.detail.strength ?? 0),
+    rank(a) - rank(b) || (b.detail.strength ?? 0) - (a.detail.strength && 0),
   );
 }

[Survived] BlockStatement
src/views/PatientView.tsx:134:108
 /** Inline-SVG mood sparkline over the drill-down entries (their sentiment
  *  is already decrypted on this page). Pure presentation; the accessible
  *  label summarizes the window. */
-function MoodSparkline(props: { points: { date: string; sentiment: number }[] }): React.JSX.Element | null {
-  const pts = props.points.filter((p) => typeof p.sentiment === "number");
-  if (pts.length < 2) return null;
-  const w = 320;
-  const h = 48;
-  const step = w / (pts.length - 1);
-  const y = (v: number): number => h / 2 - (v * (h / 2 - 3));
-  const path = pts.map((p, i) => `${i === 0 ? "M" : "L"}${(i * step).toFixed(1)},${y(p.sentiment as number).toFixed(1)}`).join(" ");
-  const avg = pts.reduce((sum, p) => sum + (p.sentiment as number), 0) / pts.length;
-  return (
-    <svg
-      viewBox={`0 0 ${w} ${h}`}
-      style={{ width: "100%", maxWidth: 420, height: 48, display: "block", marginTop: 8 }}
-      role="img"
-      aria-label={`Mood over the ${pts.length} evidence days (average ${(avg).toFixed(2)})`}
-    >
-      <line x1={0} y1={h / 2} x2={w} y2={h / 2} stroke={theme.border} strokeWidth={1} />
-      <path d={path} fill="none" stroke={theme.accent} strokeWidth={1.6} />
-    </svg>
-  );
-}
+function MoodSparkline(props: { points: { date: string; sentiment: number }[] }): React.JSX.Element | null {}
 
 function evidenceRows(pattern: PatternPayload): [string, string][] {

[Survived] ConditionalExpression
src/views/PatientView.tsx:135:42
  *  is already decrypted on this page). Pure presentation; the accessible
  *  label summarizes the window. */
 function MoodSparkline(props: { points: { date: string; sentiment: number }[] }): React.JSX.Element | null {
-  const pts = props.points.filter((p) => typeof p.sentiment === "number");
+  const pts = props.points.filter((p) => false);
   if (pts.length < 2) return null;
   const w = 320;

[Survived] MethodExpression
src/views/PatientView.tsx:135:15
  *  is already decrypted on this page). Pure presentation; the accessible
  *  label summarizes the window. */
 function MoodSparkline(props: { points: { date: string; sentiment: number }[] }): React.JSX.Element | null {
-  const pts = props.points.filter((p) => typeof p.sentiment === "number");
+  const pts = props.points;
   if (pts.length < 2) return null;
   const w = 320;

[Survived] ConditionalExpression
src/views/PatientView.tsx:136:7
  *  label summarizes the window. */
 function MoodSparkline(props: { points: { date: string; sentiment: number }[] }): React.JSX.Element | null {
   const pts = props.points.filter((p) => typeof p.sentiment === "number");
-  if (pts.length < 2) return null;
+  if (true) return null;
   const w = 320;
   const h = 48;

[Survived] ConditionalExpression
src/views/PatientView.tsx:136:7
  *  label summarizes the window. */
 function MoodSparkline(props: { points: { date: string; sentiment: number }[] }): React.JSX.Element | null {
   const pts = props.points.filter((p) => typeof p.sentiment === "number");
-  if (pts.length < 2) return null;
+  if (false) return null;
   const w = 320;
   const h = 48;

[Survived] ArithmeticOperator
src/views/PatientView.tsx:139:16
   if (pts.length < 2) return null;
   const w = 320;
   const h = 48;
-  const step = w / (pts.length - 1);
+  const step = w * (pts.length - 1);
   const y = (v: number): number => h / 2 - (v * (h / 2 - 3));
   const path = pts.map((p, i) => `${i === 0 ? "M" : "L"}${(i * step).toFixed(1)},${y(p.sentiment as number).toFixed(1)}`).join(" ");

[Survived] ArithmeticOperator
src/views/PatientView.tsx:139:21
   if (pts.length < 2) return null;
   const w = 320;
   const h = 48;
-  const step = w / (pts.length - 1);
+  const step = w / (pts.length + 1);
   const y = (v: number): number => h / 2 - (v * (h / 2 - 3));
   const path = pts.map((p, i) => `${i === 0 ? "M" : "L"}${(i * step).toFixed(1)},${y(p.sentiment as number).toFixed(1)}`).join(" ");
