[Survived] MethodExpression
src/views/PatientView.tsx:638:56
         {selected && patternNotes.length === 0 && <NoteText>No notes on this pattern yet.</NoteText>}
         {!selected && generalNotes.length === 0 && <NoteText>No notes yet.</NoteText>}
         {(selected ? patternNotes : generalNotes)
-          .filter((n) => n.text.toLowerCase().includes(noteQuery.trim().toLowerCase()))
+          .filter((n) => n.text.toLowerCase().includes(noteQuery.toLowerCase()))
           .map((note) => (
           <div key={note.id} style={{ borderTop: `1px solid ${theme.border}`, paddingTop: 8 }}>

[Survived] MethodExpression
src/views/PatientView.tsx:638:56
         {selected && patternNotes.length === 0 && <NoteText>No notes on this pattern yet.</NoteText>}
         {!selected && generalNotes.length === 0 && <NoteText>No notes yet.</NoteText>}
         {(selected ? patternNotes : generalNotes)
-          .filter((n) => n.text.toLowerCase().includes(noteQuery.trim().toLowerCase()))
+          .filter((n) => n.text.toLowerCase().includes(noteQuery.trim().toUpperCase()))
           .map((note) => (
           <div key={note.id} style={{ borderTop: `1px solid ${theme.border}`, paddingTop: 8 }}>

[Survived] StringLiteral
src/views/PatientView.tsx:640:50
         {(selected ? patternNotes : generalNotes)
           .filter((n) => n.text.toLowerCase().includes(noteQuery.trim().toLowerCase()))
           .map((note) => (
-          <div key={note.id} style={{ borderTop: `1px solid ${theme.border}`, paddingTop: 8 }}>
+          <div key={note.id} style={{ borderTop: ``, paddingTop: 8 }}>
             {editing?.id === note.id ? (
               <>

[Survived] ObjectLiteral
src/views/PatientView.tsx:640:37
         {(selected ? patternNotes : generalNotes)
           .filter((n) => n.text.toLowerCase().includes(noteQuery.trim().toLowerCase()))
           .map((note) => (
-          <div key={note.id} style={{ borderTop: `1px solid ${theme.border}`, paddingTop: 8 }}>
+          <div key={note.id} style={{}}>
             {editing?.id === note.id ? (
               <>

[Survived] EqualityOperator
src/views/PatientView.tsx:641:14
           .filter((n) => n.text.toLowerCase().includes(noteQuery.trim().toLowerCase()))
           .map((note) => (
           <div key={note.id} style={{ borderTop: `1px solid ${theme.border}`, paddingTop: 8 }}>
-            {editing?.id === note.id ? (
+            {editing?.id !== note.id ? (
               <>
                 <textarea

[Survived] OptionalChaining
src/views/PatientView.tsx:641:14
           .filter((n) => n.text.toLowerCase().includes(noteQuery.trim().toLowerCase()))
           .map((note) => (
           <div key={note.id} style={{ borderTop: `1px solid ${theme.border}`, paddingTop: 8 }}>
-            {editing?.id === note.id ? (
+            {editing.id === note.id ? (
               <>
                 <textarea

[Survived] ArrowFunction
src/views/PatientView.tsx:645:29
               <>
                 <textarea
                   value={editing.text}
-                  onChange={(e) => setEditing({ id: note.id, text: e.target.value })}
+                  onChange={() => undefined}
                   placeholder="Editing note…"
                   rows={3}

[Survived] StringLiteral
src/views/PatientView.tsx:651:29
                   style={{
                     backgroundColor: theme.cardDeep,
                     color: theme.text,
-                    border: `1px solid ${theme.border}`,
+                    border: ``,
                     borderRadius: theme.radius,
                     padding: 10,

[Survived] StringLiteral
src/views/PatientView.tsx:659:40
                     width: "100%",
                   }}
                 />
-                <div style={{ display: "flex", gap: 8, marginTop: 6 }}>
+                <div style={{ display: "", gap: 8, marginTop: 6 }}>
                   <Button label={busy ? "Saving…" : "Save edit"} small onPress={() => void saveNoteEdit(note)} disabled={busy || !editing.text.trim()} />
                   <Button label="Cancel" small onPress={() => setEditing(null)} disabled={busy} />

[Survived] ConditionalExpression
src/views/PatientView.tsx:660:122
                   }}
                 />
                 <div style={{ display: "flex", gap: 8, marginTop: 6 }}>
-                  <Button label={busy ? "Saving…" : "Save edit"} small onPress={() => void saveNoteEdit(note)} disabled={busy || !editing.text.trim()} />
+                  <Button label={busy ? "Saving…" : "Save edit"} small onPress={() => void saveNoteEdit(note)} disabled={true} />
                   <Button label="Cancel" small onPress={() => setEditing(null)} disabled={busy} />
                 </div>

[Survived] ConditionalExpression
src/views/PatientView.tsx:660:122
                   }}
                 />
                 <div style={{ display: "flex", gap: 8, marginTop: 6 }}>
-                  <Button label={busy ? "Saving…" : "Save edit"} small onPress={() => void saveNoteEdit(note)} disabled={busy || !editing.text.trim()} />
+                  <Button label={busy ? "Saving…" : "Save edit"} small onPress={() => void saveNoteEdit(note)} disabled={false} />
                   <Button label="Cancel" small onPress={() => setEditing(null)} disabled={busy} />
                 </div>

[Survived] ArrowFunction
src/views/PatientView.tsx:661:57
                 />
                 <div style={{ display: "flex", gap: 8, marginTop: 6 }}>
                   <Button label={busy ? "Saving…" : "Save edit"} small onPress={() => void saveNoteEdit(note)} disabled={busy || !editing.text.trim()} />
-                  <Button label="Cancel" small onPress={() => setEditing(null)} disabled={busy} />
+                  <Button label="Cancel" small onPress={() => undefined} disabled={busy} />
                 </div>
               </>

[Survived] ArrowFunction
src/views/PatientView.tsx:669:51
             )}
             <div style={{ display: "flex", gap: 8, alignItems: "center" }}>
               <span style={{ color: theme.muted, fontSize: 11 }}>{dayOf(note.created_at)}</span>
-              <Button label="Edit" small onPress={() => setEditing({ id: note.id, text: note.text })} disabled={busy} />
+              <Button label="Edit" small onPress={() => undefined} disabled={busy} />
               <Button label="Delete" small danger onPress={() => void removeNote(note)} disabled={busy} />
             </div>

[Survived] ObjectLiteral
src/views/PatientView.tsx:669:68
             )}
             <div style={{ display: "flex", gap: 8, alignItems: "center" }}>
               <span style={{ color: theme.muted, fontSize: 11 }}>{dayOf(note.created_at)}</span>
-              <Button label="Edit" small onPress={() => setEditing({ id: note.id, text: note.text })} disabled={busy} />
+              <Button label="Edit" small onPress={() => setEditing({})} disabled={busy} />
               <Button label="Delete" small danger onPress={() => void removeNote(note)} disabled={busy} />
             </div>

[Survived] ArrowFunction
src/views/PatientView.tsx:670:60
             <div style={{ display: "flex", gap: 8, alignItems: "center" }}>
               <span style={{ color: theme.muted, fontSize: 11 }}>{dayOf(note.created_at)}</span>
               <Button label="Edit" small onPress={() => setEditing({ id: note.id, text: note.text })} disabled={busy} />
-              <Button label="Delete" small danger onPress={() => void removeNote(note)} disabled={busy} />
+              <Button label="Delete" small danger onPress={() => undefined} disabled={busy} />
             </div>
           </div>

[Survived] StringLiteral
src/views/PatientView.tsx:674:58
             </div>
           </div>
         ))}
-        <div style={{ display: "flex", gap: 6, flexWrap: "wrap", marginBottom: 6 }}>
+        <div style={{ display: "flex", gap: 6, flexWrap: "", marginBottom: 6 }}>
           <span style={{ color: theme.muted, fontSize: 12, alignSelf: "center" }}>Start from:</span>
           {NOTE_TEMPLATES.map((tpl) => (

[Survived] ArrowFunction
src/views/PatientView.tsx:676:31
         ))}
         <div style={{ display: "flex", gap: 6, flexWrap: "wrap", marginBottom: 6 }}>
           <span style={{ color: theme.muted, fontSize: 12, alignSelf: "center" }}>Start from:</span>
-          {NOTE_TEMPLATES.map((tpl) => (
-            <button
-              key={tpl}
-              type="button"
-              onClick={() => setDraft(draft.trim() ? `${draft.trimEnd()}
-${tpl}` : tpl)}
-              style={{
-                backgroundColor: theme.cardDeep,
-                color: theme.body,
-                border: `1px solid ${theme.border}`,
-                borderRadius: theme.radius,
-                padding: "4px 10px",
-                fontSize: 12,
-                cursor: "pointer",
-              }}
-            >
-              {tpl.split("\n")[0]!.split(":")[0]}
-            </button>
-          ))}
+          {NOTE_TEMPLATES.map(() => undefined)}
           {(selected ? patternNotes : generalNotes).length > 0 && (
             <button

[NoCoverage] MethodExpression
src/views/PatientView.tsx:680:57
             <button
               key={tpl}
               type="button"
-              onClick={() => setDraft(draft.trim() ? `${draft.trimEnd()}
+              onClick={() => setDraft(draft.trim() ? `${draft.trimStart()}
 ${tpl}` : tpl)}
               style={{

[NoCoverage] MethodExpression
src/views/PatientView.tsx:680:39
             <button
               key={tpl}
               type="button"
-              onClick={() => setDraft(draft.trim() ? `${draft.trimEnd()}
+              onClick={() => setDraft(draft ? `${draft.trimEnd()}
 ${tpl}` : tpl)}
               style={{

[Survived] ConditionalExpression
src/views/PatientView.tsx:695:12
               {tpl.split("\n")[0]!.split(":")[0]}
             </button>
           ))}
-          {(selected ? patternNotes : generalNotes).length > 0 && (
-            <button
-              type="button"
-              onClick={() => setDraft((selected ? patternNotes : generalNotes)[0]?.text ?? draft)}
-              style={{
-                backgroundColor: theme.cardDeep,
-                color: theme.body,
-                border: `1px solid ${theme.border}`,
-                borderRadius: theme.radius,
-                padding: "4px 10px",
-                fontSize: 12,
-                cursor: "pointer",
-              }}
-            >
-              Copy forward last note
-            </button>
-          )}
+          {true}
         </div>
         <textarea

[Survived] ConditionalExpression
src/views/PatientView.tsx:695:12
               {tpl.split("\n")[0]!.split(":")[0]}
             </button>
           ))}
-          {(selected ? patternNotes : generalNotes).length > 0 && (
+          {true && (
             <button
               type="button"

[Survived] ArrowFunction
src/views/PatientView.tsx:698:24
           {(selected ? patternNotes : generalNotes).length > 0 && (
             <button
               type="button"
-              onClick={() => setDraft((selected ? patternNotes : generalNotes)[0]?.text ?? draft)}
+              onClick={() => undefined}
               style={{
                 backgroundColor: theme.cardDeep,

[NoCoverage] OptionalChaining
src/views/PatientView.tsx:698:39
           {(selected ? patternNotes : generalNotes).length > 0 && (
             <button
               type="button"
-              onClick={() => setDraft((selected ? patternNotes : generalNotes)[0]?.text ?? draft)}
+              onClick={() => setDraft((selected ? patternNotes : generalNotes)[0].text ?? draft)}
               style={{
                 backgroundColor: theme.cardDeep,

[Survived] StringLiteral
src/views/PatientView.tsx:704:26
                 color: theme.body,
                 border: `1px solid ${theme.border}`,
                 borderRadius: theme.radius,
-                padding: "4px 10px",
+                padding: "",
                 fontSize: 12,
                 cursor: "pointer",

[Survived] ArrowFunction
src/views/PatientView.tsx:715:21
         </div>
         <textarea
           value={draft}
-          onChange={(e) => setDraft(e.target.value)}
+          onChange={() => undefined}
           placeholder={selected ? "Note about this pattern…" : "Note about this patient…"}
           rows={3}

[Survived] StringLiteral
src/views/PatientView.tsx:716:64
         <textarea
           value={draft}
           onChange={(e) => setDraft(e.target.value)}
-          placeholder={selected ? "Note about this pattern…" : "Note about this patient…"}
+          placeholder={selected ? "Note about this pattern…" : ""}
           rows={3}
           style={{

[Survived] LogicalOperator
src/views/PatientView.tsx:729:87
           }}
         />
         <div>
-          <Button label={busy ? "Saving…" : "Save note"} onPress={saveNote} disabled={busy || !draft.trim()} />
+          <Button label={busy ? "Saving…" : "Save note"} onPress={saveNote} disabled={busy && !draft.trim()} />
         </div>
         <NoteText>

[Survived] MethodExpression
src/views/PatientView.tsx:729:96
           }}
         />
         <div>
-          <Button label={busy ? "Saving…" : "Save note"} onPress={saveNote} disabled={busy || !draft.trim()} />
+          <Button label={busy ? "Saving…" : "Save note"} onPress={saveNote} disabled={busy || !draft} />
         </div>
         <NoteText>

[Survived] ObjectLiteral
src/views/PatientView.tsx:739:42
       {/* Print-only session summary (2026-09-17): everything a paper record
           needs, nothing the interactive chrome shows. window.print() with
           .no-print hiding. */}
-      <div className="print-only" style={{ display: "none" }}>
+      <div className="print-only" style={{}}>
         <h1 style={{ fontSize: 18 }}>MindPattern session summary — {patient.username}</h1>
         <p style={{ fontSize: 12 }}>

[Survived] MethodExpression
src/views/PatientView.tsx:742:74
       <div className="print-only" style={{ display: "none" }}>
         <h1 style={{ fontSize: 18 }}>MindPattern session summary — {patient.username}</h1>
         <p style={{ fontSize: 12 }}>
-          Sharing since {dayOf(patient.granted_at)} · summary generated {new Date().toISOString().slice(0, 10)}
+          Sharing since {dayOf(patient.granted_at)} · summary generated {new Date().toISOString()}
           {lastReviewed && ` · delta anchored ${lastReviewed}`}
           {newCount > 0 && ` · ${newCount} new pattern${newCount === 1 ? "" : "s"}`}

[Survived] ConditionalExpression
src/views/PatientView.tsx:743:12
         <h1 style={{ fontSize: 18 }}>MindPattern session summary — {patient.username}</h1>
         <p style={{ fontSize: 12 }}>
           Sharing since {dayOf(patient.granted_at)} · summary generated {new Date().toISOString().slice(0, 10)}
-          {lastReviewed && ` · delta anchored ${lastReviewed}`}
+          {true}
           {newCount > 0 && ` · ${newCount} new pattern${newCount === 1 ? "" : "s"}`}
         </p>

[Survived] LogicalOperator
src/views/PatientView.tsx:743:12
         <h1 style={{ fontSize: 18 }}>MindPattern session summary — {patient.username}</h1>
         <p style={{ fontSize: 12 }}>
           Sharing since {dayOf(patient.granted_at)} · summary generated {new Date().toISOString().slice(0, 10)}
-          {lastReviewed && ` · delta anchored ${lastReviewed}`}
+          {lastReviewed || ` · delta anchored ${lastReviewed}`}
           {newCount > 0 && ` · ${newCount} new pattern${newCount === 1 ? "" : "s"}`}
         </p>

[Survived] EqualityOperator
src/views/PatientView.tsx:744:12
         <p style={{ fontSize: 12 }}>
           Sharing since {dayOf(patient.granted_at)} · summary generated {new Date().toISOString().slice(0, 10)}
           {lastReviewed && ` · delta anchored ${lastReviewed}`}
-          {newCount > 0 && ` · ${newCount} new pattern${newCount === 1 ? "" : "s"}`}
+          {newCount >= 0 && ` · ${newCount} new pattern${newCount === 1 ? "" : "s"}`}
         </p>
         {stats && (

[Survived] ConditionalExpression
src/views/PatientView.tsx:744:57
         <p style={{ fontSize: 12 }}>
           Sharing since {dayOf(patient.granted_at)} · summary generated {new Date().toISOString().slice(0, 10)}
           {lastReviewed && ` · delta anchored ${lastReviewed}`}
-          {newCount > 0 && ` · ${newCount} new pattern${newCount === 1 ? "" : "s"}`}
+          {newCount > 0 && ` · ${newCount} new pattern${true ? "" : "s"}`}
         </p>
         {stats && (

[Survived] LogicalOperator
src/views/PatientView.tsx:746:10
           {lastReviewed && ` · delta anchored ${lastReviewed}`}
           {newCount > 0 && ` · ${newCount} new pattern${newCount === 1 ? "" : "s"}`}
         </p>
-        {stats && (
-          <p style={{ fontSize: 12 }}>
-            {stats.total_entries ?? "?"} entries · {stats.active_days ?? "?"} active days
-            {typeof stats.avg_sentiment === "number" && ` · average reading ${stats.avg_sentiment.toFixed(2)}`}
-          </p>
-        )}
+        {stats || <p style={{
+  fontSize: 12
+}}>
+            {stats.total_entries ?? "?"} entries · {stats.active_days ?? "?"} active days
+            {typeof stats.avg_sentiment === "number" && ` · average reading ${stats.avg_sentiment.toFixed(2)}`}
+          </p>}
         {(patterns ?? []).map((pattern, index) => (
           <div key={patternKey(pattern, index)} style={{ borderTop: "1px solid #999", paddingTop: 6, marginTop: 6 }}>

[Survived] ConditionalExpression
src/views/PatientView.tsx:746:10
           {lastReviewed && ` · delta anchored ${lastReviewed}`}
           {newCount > 0 && ` · ${newCount} new pattern${newCount === 1 ? "" : "s"}`}
         </p>
-        {stats && (
-          <p style={{ fontSize: 12 }}>
-            {stats.total_entries ?? "?"} entries · {stats.active_days ?? "?"} active days
-            {typeof stats.avg_sentiment === "number" && ` · average reading ${stats.avg_sentiment.toFixed(2)}`}
-          </p>
-        )}
+        {true}
         {(patterns ?? []).map((pattern, index) => (
           <div key={patternKey(pattern, index)} style={{ borderTop: "1px solid #999", paddingTop: 6, marginTop: 6 }}>

[Survived] LogicalOperator
src/views/PatientView.tsx:748:53
         </p>
         {stats && (
           <p style={{ fontSize: 12 }}>
-            {stats.total_entries ?? "?"} entries · {stats.active_days ?? "?"} active days
+            {stats.total_entries ?? "?"} entries · {stats.active_days && "?"} active days
             {typeof stats.avg_sentiment === "number" && ` · average reading ${stats.avg_sentiment.toFixed(2)}`}
           </p>

[Survived] LogicalOperator
src/views/PatientView.tsx:748:14
         </p>
         {stats && (
           <p style={{ fontSize: 12 }}>
-            {stats.total_entries ?? "?"} entries · {stats.active_days ?? "?"} active days
+            {stats.total_entries && "?"} entries · {stats.active_days ?? "?"} active days
             {typeof stats.avg_sentiment === "number" && ` · average reading ${stats.avg_sentiment.toFixed(2)}`}
           </p>

[Survived] LogicalOperator
src/views/PatientView.tsx:749:14
         {stats && (
           <p style={{ fontSize: 12 }}>
             {stats.total_entries ?? "?"} entries · {stats.active_days ?? "?"} active days
-            {typeof stats.avg_sentiment === "number" && ` · average reading ${stats.avg_sentiment.toFixed(2)}`}
+            {typeof stats.avg_sentiment === "number" || ` · average reading ${stats.avg_sentiment.toFixed(2)}`}
           </p>
         )}

[Survived] EqualityOperator
src/views/PatientView.tsx:749:14
         {stats && (
           <p style={{ fontSize: 12 }}>
             {stats.total_entries ?? "?"} entries · {stats.active_days ?? "?"} active days
-            {typeof stats.avg_sentiment === "number" && ` · average reading ${stats.avg_sentiment.toFixed(2)}`}
+            {typeof stats.avg_sentiment !== "number" && ` · average reading ${stats.avg_sentiment.toFixed(2)}`}
           </p>
         )}

[Survived] LogicalOperator
src/views/PatientView.tsx:752:11
             {typeof stats.avg_sentiment === "number" && ` · average reading ${stats.avg_sentiment.toFixed(2)}`}
           </p>
         )}
-        {(patterns ?? []).map((pattern, index) => (
+        {(patterns && []).map((pattern, index) => (
           <div key={patternKey(pattern, index)} style={{ borderTop: "1px solid #999", paddingTop: 6, marginTop: 6 }}>
             <strong style={{ fontSize: 13 }}>{pattern.detail.sensitive ? "A difficult thought (non-quoting)" : `${pattern.kind} — ${pattern.label}`}</strong>

[Survived] ArrowFunction
src/views/PatientView.tsx:752:31
             {typeof stats.avg_sentiment === "number" && ` · average reading ${stats.avg_sentiment.toFixed(2)}`}
           </p>
         )}
-        {(patterns ?? []).map((pattern, index) => (
-          <div key={patternKey(pattern, index)} style={{ borderTop: "1px solid #999", paddingTop: 6, marginTop: 6 }}>
-            <strong style={{ fontSize: 13 }}>{pattern.detail.sensitive ? "A difficult thought (non-quoting)" : `${pattern.kind} — ${pattern.label}`}</strong>
-            <p style={{ fontSize: 12, margin: "2px 0" }}>{describePattern(pattern)}</p>
-            <p style={{ fontSize: 11, color: "#333" }}>
-              {evidenceRows(pattern).map(([k, v]) => `${k}: ${v}`).join(" · ")}
-            </p>
-          </div>
-        ))}
+        {(patterns ?? []).map(() => undefined)}
         {(selected ? patternNotes : generalNotes).length > 0 && (
           <>

[Survived] StringLiteral
src/views/PatientView.tsx:753:69
           </p>
         )}
         {(patterns ?? []).map((pattern, index) => (
-          <div key={patternKey(pattern, index)} style={{ borderTop: "1px solid #999", paddingTop: 6, marginTop: 6 }}>
+          <div key={patternKey(pattern, index)} style={{ borderTop: "", paddingTop: 6, marginTop: 6 }}>
             <strong style={{ fontSize: 13 }}>{pattern.detail.sensitive ? "A difficult thought (non-quoting)" : `${pattern.kind} — ${pattern.label}`}</strong>
             <p style={{ fontSize: 12, margin: "2px 0" }}>{describePattern(pattern)}</p>

[Survived] StringLiteral
src/views/PatientView.tsx:754:74
         )}
         {(patterns ?? []).map((pattern, index) => (
           <div key={patternKey(pattern, index)} style={{ borderTop: "1px solid #999", paddingTop: 6, marginTop: 6 }}>
-            <strong style={{ fontSize: 13 }}>{pattern.detail.sensitive ? "A difficult thought (non-quoting)" : `${pattern.kind} — ${pattern.label}`}</strong>
+            <strong style={{ fontSize: 13 }}>{pattern.detail.sensitive ? "" : `${pattern.kind} — ${pattern.label}`}</strong>
             <p style={{ fontSize: 12, margin: "2px 0" }}>{describePattern(pattern)}</p>
             <p style={{ fontSize: 11, color: "#333" }}>

[Survived] StringLiteral
src/views/PatientView.tsx:755:47
         {(patterns ?? []).map((pattern, index) => (
           <div key={patternKey(pattern, index)} style={{ borderTop: "1px solid #999", paddingTop: 6, marginTop: 6 }}>
             <strong style={{ fontSize: 13 }}>{pattern.detail.sensitive ? "A difficult thought (non-quoting)" : `${pattern.kind} — ${pattern.label}`}</strong>
-            <p style={{ fontSize: 12, margin: "2px 0" }}>{describePattern(pattern)}</p>
+            <p style={{ fontSize: 12, margin: "" }}>{describePattern(pattern)}</p>
             <p style={{ fontSize: 11, color: "#333" }}>
               {evidenceRows(pattern).map(([k, v]) => `${k}: ${v}`).join(" · ")}

[Survived] ArrowFunction
src/views/PatientView.tsx:757:42
             <strong style={{ fontSize: 13 }}>{pattern.detail.sensitive ? "A difficult thought (non-quoting)" : `${pattern.kind} — ${pattern.label}`}</strong>
             <p style={{ fontSize: 12, margin: "2px 0" }}>{describePattern(pattern)}</p>
             <p style={{ fontSize: 11, color: "#333" }}>
-              {evidenceRows(pattern).map(([k, v]) => `${k}: ${v}`).join(" · ")}
+              {evidenceRows(pattern).map(() => undefined).join(" · ")}
             </p>
           </div>

[Survived] StringLiteral
src/views/PatientView.tsx:757:73
             <strong style={{ fontSize: 13 }}>{pattern.detail.sensitive ? "A difficult thought (non-quoting)" : `${pattern.kind} — ${pattern.label}`}</strong>
             <p style={{ fontSize: 12, margin: "2px 0" }}>{describePattern(pattern)}</p>
             <p style={{ fontSize: 11, color: "#333" }}>
-              {evidenceRows(pattern).map(([k, v]) => `${k}: ${v}`).join(" · ")}
+              {evidenceRows(pattern).map(([k, v]) => `${k}: ${v}`).join("")}
             </p>
           </div>

[Survived] EqualityOperator
src/views/PatientView.tsx:761:10
             </p>
           </div>
         ))}
-        {(selected ? patternNotes : generalNotes).length > 0 && (
+        {(selected ? patternNotes : generalNotes).length <= 0 && (
           <>
             <h2 style={{ fontSize: 14, marginTop: 10 }}>Therapist notes ({selected ? "this pattern" : "general"})</h2>

[Survived] EqualityOperator
src/views/PatientView.tsx:761:10
             </p>
           </div>
         ))}
-        {(selected ? patternNotes : generalNotes).length > 0 && (
+        {(selected ? patternNotes : generalNotes).length >= 0 && (
           <>
             <h2 style={{ fontSize: 14, marginTop: 10 }}>Therapist notes ({selected ? "this pattern" : "general"})</h2>

[Survived] ArrowFunction
src/views/PatientView.tsx:764:59
         {(selected ? patternNotes : generalNotes).length > 0 && (
           <>
             <h2 style={{ fontSize: 14, marginTop: 10 }}>Therapist notes ({selected ? "this pattern" : "general"})</h2>
-            {(selected ? patternNotes : generalNotes).map((note) => (
-              <p key={note.id} style={{ fontSize: 12, borderTop: "1px solid #999", paddingTop: 4 }}>
-                {dayOf(note.created_at)} — {note.text}
-              </p>
-            ))}
+            {(selected ? patternNotes : generalNotes).map(() => undefined)}
           </>
         )}

[Survived] StringLiteral
src/views/PatientView.tsx:771:42
             ))}
           </>
         )}
-        <p style={{ fontSize: 10, color: "#555", marginTop: 10 }}>
+        <p style={{ fontSize: 10, color: "", marginTop: 10 }}>
           Observations from the patient's own encrypted journal — not a diagnosis. Generated by MindPattern.
         </p>
