[Survived] BooleanLiteral
src/views/PatientsView.tsx:36:36
 }): React.JSX.Element {
   const [patients, setPatients] = useState<Patient[]>([]);
   const [pairingCode, setPairingCode] = useState<string | null>(null);
-  const [busy, setBusy] = useState(false);
+  const [busy, setBusy] = useState(true);
   const [error, setError] = useState("");
   const [scan, setScan] = useState<Record<string, CaseloadScanRow> | null>(null);

[Survived] BooleanLiteral
src/views/PatientsView.tsx:39:44
   const [busy, setBusy] = useState(false);
   const [error, setError] = useState("");
   const [scan, setScan] = useState<Record<string, CaseloadScanRow> | null>(null);
-  const [scanning, setScanning] = useState(false);
+  const [scanning, setScanning] = useState(true);
   /** This therapist's own wrap-key fingerprint (shown beside the pairing
    * code so the patient can verify it after lookup — 2026-09-17 audit). */

[Survived] BlockStatement
src/views/PatientsView.tsx:44:19
    * code so the patient can verify it after lookup — 2026-09-17 audit). */
   const [fingerprint, setFingerprint] = useState<string | null>(null);
 
-  useEffect(() => {
-    if (!props.session) return;
-    let cancelled = false;
-    keyFingerprint(props.session.publicKeyB64)
-      .then((fp) => { if (!cancelled) setFingerprint(fp); })
-      .catch(() => { if (!cancelled) setFingerprint(null); });
-    return () => { cancelled = true; };
-  }, [props.session]);
+  useEffect(() => {}, [props.session]);
 
   const refresh = useCallback(() => {

[Survived] BooleanLiteral
src/views/PatientsView.tsx:45:9
   const [fingerprint, setFingerprint] = useState<string | null>(null);
 
   useEffect(() => {
-    if (!props.session) return;
+    if (props.session) return;
     let cancelled = false;
     keyFingerprint(props.session.publicKeyB64)

[Survived] ConditionalExpression
src/views/PatientsView.tsx:45:9
   const [fingerprint, setFingerprint] = useState<string | null>(null);
 
   useEffect(() => {
-    if (!props.session) return;
+    if (true) return;
     let cancelled = false;
     keyFingerprint(props.session.publicKeyB64)

[Survived] BooleanLiteral
src/views/PatientsView.tsx:46:21
 
   useEffect(() => {
     if (!props.session) return;
-    let cancelled = false;
+    let cancelled = true;
     keyFingerprint(props.session.publicKeyB64)
       .then((fp) => { if (!cancelled) setFingerprint(fp); })

[Survived] ConditionalExpression
src/views/PatientsView.tsx:48:27
     if (!props.session) return;
     let cancelled = false;
     keyFingerprint(props.session.publicKeyB64)
-      .then((fp) => { if (!cancelled) setFingerprint(fp); })
+      .then((fp) => { if (true) setFingerprint(fp); })
       .catch(() => { if (!cancelled) setFingerprint(null); });
     return () => { cancelled = true; };

[Survived] ConditionalExpression
src/views/PatientsView.tsx:48:27
     if (!props.session) return;
     let cancelled = false;
     keyFingerprint(props.session.publicKeyB64)
-      .then((fp) => { if (!cancelled) setFingerprint(fp); })
+      .then((fp) => { if (false) setFingerprint(fp); })
       .catch(() => { if (!cancelled) setFingerprint(null); });
     return () => { cancelled = true; };

[NoCoverage] ConditionalExpression
src/views/PatientsView.tsx:49:26
     let cancelled = false;
     keyFingerprint(props.session.publicKeyB64)
       .then((fp) => { if (!cancelled) setFingerprint(fp); })
-      .catch(() => { if (!cancelled) setFingerprint(null); });
+      .catch(() => { if (true) setFingerprint(null); });
     return () => { cancelled = true; };
   }, [props.session]);

[NoCoverage] ConditionalExpression
src/views/PatientsView.tsx:49:26
     let cancelled = false;
     keyFingerprint(props.session.publicKeyB64)
       .then((fp) => { if (!cancelled) setFingerprint(fp); })
-      .catch(() => { if (!cancelled) setFingerprint(null); });
+      .catch(() => { if (false) setFingerprint(null); });
     return () => { cancelled = true; };
   }, [props.session]);

[Survived] BooleanLiteral
src/views/PatientsView.tsx:50:32
     keyFingerprint(props.session.publicKeyB64)
       .then((fp) => { if (!cancelled) setFingerprint(fp); })
       .catch(() => { if (!cancelled) setFingerprint(null); });
-    return () => { cancelled = true; };
+    return () => { cancelled = false; };
   }, [props.session]);
 

[Survived] BlockStatement
src/views/PatientsView.tsx:50:18
     keyFingerprint(props.session.publicKeyB64)
       .then((fp) => { if (!cancelled) setFingerprint(fp); })
       .catch(() => { if (!cancelled) setFingerprint(null); });
-    return () => { cancelled = true; };
+    return () => {};
   }, [props.session]);
 

[Survived] BlockStatement
src/views/PatientsView.tsx:53:37
     return () => { cancelled = true; };
   }, [props.session]);
 
-  const refresh = useCallback(() => {
-    api.patients().then(setPatients).catch((err) => setError(err instanceof Error ? err.message : "could not load patients"));
-  }, []);
+  const refresh = useCallback(() => {}, []);
   useEffect(refresh, [refresh]);
 

[Survived] ArrowFunction
src/views/PatientsView.tsx:54:44
   }, [props.session]);
 
   const refresh = useCallback(() => {
-    api.patients().then(setPatients).catch((err) => setError(err instanceof Error ? err.message : "could not load patients"));
+    api.patients().then(setPatients).catch(() => undefined);
   }, []);
   useEffect(refresh, [refresh]);

[Survived] BlockStatement
src/views/PatientsView.tsx:58:31
   }, []);
   useEffect(refresh, [refresh]);
 
-  const newCode = async () => {
-    if (busy) return;
-    setBusy(true);
-    setError("");
-    setPairingCode(null);
-    try {
-      const { code } = await api.newPairingCode();
-      setPairingCode(code);
-    } catch (err) {
-      setError(err instanceof Error ? err.message : "could not create a pairing code");
-    } finally {
-      setBusy(false);
-    }
-  };
+  const newCode = async () => {};
 
   const scanCaseload = async () => {

[Survived] ConditionalExpression
src/views/PatientsView.tsx:59:9
   useEffect(refresh, [refresh]);
 
   const newCode = async () => {
-    if (busy) return;
+    if (false) return;
     setBusy(true);
     setError("");

[Survived] ConditionalExpression
src/views/PatientsView.tsx:59:9
   useEffect(refresh, [refresh]);
 
   const newCode = async () => {
-    if (busy) return;
+    if (true) return;
     setBusy(true);
     setError("");

[Survived] CallExpression
src/views/PatientsView.tsx:62:5
     if (busy) return;
     setBusy(true);
     setError("");
-    setPairingCode(null);
+    ;
     try {
       const { code } = await api.newPairingCode();

[Survived] BlockStatement
src/views/PatientsView.tsx:63:9
     setBusy(true);
     setError("");
     setPairingCode(null);
-    try {
-      const { code } = await api.newPairingCode();
-      setPairingCode(code);
-    } catch (err) {
+    try {} catch (err) {
       setError(err instanceof Error ? err.message : "could not create a pairing code");
     } finally {

[Survived] CallExpression
src/views/PatientsView.tsx:65:7
     setPairingCode(null);
     try {
       const { code } = await api.newPairingCode();
-      setPairingCode(code);
+      ;
     } catch (err) {
       setError(err instanceof Error ? err.message : "could not create a pairing code");

[NoCoverage] BlockStatement
src/views/PatientsView.tsx:66:19
     try {
       const { code } = await api.newPairingCode();
       setPairingCode(code);
-    } catch (err) {
-      setError(err instanceof Error ? err.message : "could not create a pairing code");
-    } finally {
+    } catch (err) {} finally {
       setBusy(false);
     }

[NoCoverage] StringLiteral
src/views/PatientsView.tsx:67:53
       const { code } = await api.newPairingCode();
       setPairingCode(code);
     } catch (err) {
-      setError(err instanceof Error ? err.message : "could not create a pairing code");
+      setError(err instanceof Error ? err.message : "");
     } finally {
       setBusy(false);

[Survived] BlockStatement
src/views/PatientsView.tsx:68:15
       setPairingCode(code);
     } catch (err) {
       setError(err instanceof Error ? err.message : "could not create a pairing code");
-    } finally {
-      setBusy(false);
-    }
+    } finally {}
   };
 

[Survived] ConditionalExpression
src/views/PatientsView.tsx:74:9
   };
 
   const scanCaseload = async () => {
-    if (scanning || !props.session) return;
+    if (true) return;
     setScanning(true);
     setError("");

[Survived] ConditionalExpression
src/views/PatientsView.tsx:74:9
   };
 
   const scanCaseload = async () => {
-    if (scanning || !props.session) return;
+    if (false) return;
     setScanning(true);
     setError("");

[Survived] BooleanLiteral
src/views/PatientsView.tsx:75:17
 
   const scanCaseload = async () => {
     if (scanning || !props.session) return;
-    setScanning(true);
+    setScanning(false);
     setError("");
     const rows: Record<string, CaseloadScanRow> = {};

[Survived] MethodExpression
src/views/PatientsView.tsx:79:29
     setError("");
     const rows: Record<string, CaseloadScanRow> = {};
     try {
-      for (const patient of patients.filter((p) => p.status === "active")) {
+      for (const patient of patients) {
         try {
           const summary = await api.patientInsights(patient.user_id);

[Survived] ConditionalExpression
src/views/PatientsView.tsx:79:52
     setError("");
     const rows: Record<string, CaseloadScanRow> = {};
     try {
-      for (const patient of patients.filter((p) => p.status === "active")) {
+      for (const patient of patients.filter((p) => true)) {
         try {
           const summary = await api.patientInsights(patient.user_id);

[Survived] BooleanLiteral
src/views/PatientsView.tsx:86:24
           const row: CaseloadScanRow = {
             userId: patient.user_id,
             patterns: 0,
-            sensitive: false,
+            sensitive: true,
             newSinceReviewed: 0,
             lastReviewed: stamp ? dayOf(stamp) : null,

[Survived] ConditionalExpression
src/views/PatientsView.tsx:90:31
             newSinceReviewed: 0,
             lastReviewed: stamp ? dayOf(stamp) : null,
           };
-          if (summary.blob && summary.phase === "insight" && patient.ephemeral_pub && patient.wrapped_key) {
+          if (summary.blob && true && patient.ephemeral_pub && patient.wrapped_key) {
             // Keep the concrete ArrayBuffer-backed crypto type. A generic
             // Uint8Array could include SharedArrayBuffer storage, which the

[Survived] LogicalOperator
src/views/PatientsView.tsx:90:15
             newSinceReviewed: 0,
             lastReviewed: stamp ? dayOf(stamp) : null,
           };
-          if (summary.blob && summary.phase === "insight" && patient.ephemeral_pub && patient.wrapped_key) {
+          if (summary.blob && summary.phase === "insight" || patient.ephemeral_pub && patient.wrapped_key) {
             // Keep the concrete ArrayBuffer-backed crypto type. A generic
             // Uint8Array could include SharedArrayBuffer storage, which the

[Survived] BlockStatement
src/views/PatientsView.tsx:95:17
             // Uint8Array could include SharedArrayBuffer storage, which the
             // WebCrypto helper intentionally rejects.
             let dataKey: Bytes | null = null;
-            try {
-              dataKey = await unwrapPatientDataKey(
-                props.session.privateKey,
-                patient.ephemeral_pub,
-                patient.wrapped_key,
-                patient.user_id,
-                props.session.userId,
-                props.session.publicKeyB64,
-              );
-              const payload = await decryptInsights(dataKey, patient.user_id, summary.blob);
-              const surfaced = payload.stats.patterns ?? [];
-              row.patterns = surfaced.length;
-              row.sensitive = surfaced.some((p) => p.detail.sensitive === true);
-              row.newSinceReviewed = stamp
-                ? surfaced.filter((p) => p.detail.first_seen && p.detail.first_seen > stamp).length
-                : surfaced.length;
-            } finally {
+            try {} finally {
               // Caseload scans unwrap each patient's data key in turn. It is
               // needed only for this one decrypt; retain no raw key bytes

[Survived] LogicalOperator
src/views/PatientsView.tsx:105:32
                 props.session.publicKeyB64,
               );
               const payload = await decryptInsights(dataKey, patient.user_id, summary.blob);
-              const surfaced = payload.stats.patterns ?? [];
+              const surfaced = payload.stats.patterns && [];
               row.patterns = surfaced.length;
               row.sensitive = surfaced.some((p) => p.detail.sensitive === true);

[Survived] ConditionalExpression
src/views/PatientsView.tsx:107:52
               const payload = await decryptInsights(dataKey, patient.user_id, summary.blob);
               const surfaced = payload.stats.patterns ?? [];
               row.patterns = surfaced.length;
-              row.sensitive = surfaced.some((p) => p.detail.sensitive === true);
+              row.sensitive = surfaced.some((p) => true);
               row.newSinceReviewed = stamp
                 ? surfaced.filter((p) => p.detail.first_seen && p.detail.first_seen > stamp).length

[Survived] ArrowFunction
src/views/PatientsView.tsx:107:45
               const payload = await decryptInsights(dataKey, patient.user_id, summary.blob);
               const surfaced = payload.stats.patterns ?? [];
               row.patterns = surfaced.length;
-              row.sensitive = surfaced.some((p) => p.detail.sensitive === true);
+              row.sensitive = surfaced.some(() => undefined);
               row.newSinceReviewed = stamp
                 ? surfaced.filter((p) => p.detail.first_seen && p.detail.first_seen > stamp).length

[NoCoverage] ConditionalExpression
src/views/PatientsView.tsx:109:65
               row.patterns = surfaced.length;
               row.sensitive = surfaced.some((p) => p.detail.sensitive === true);
               row.newSinceReviewed = stamp
-                ? surfaced.filter((p) => p.detail.first_seen && p.detail.first_seen > stamp).length
+                ? surfaced.filter((p) => p.detail.first_seen && true).length
                 : surfaced.length;
             } finally {

[NoCoverage] ConditionalExpression
src/views/PatientsView.tsx:109:42
               row.patterns = surfaced.length;
               row.sensitive = surfaced.some((p) => p.detail.sensitive === true);
               row.newSinceReviewed = stamp
-                ? surfaced.filter((p) => p.detail.first_seen && p.detail.first_seen > stamp).length
+                ? surfaced.filter((p) => true).length
                 : surfaced.length;
             } finally {

[Survived] BlockStatement
src/views/PatientsView.tsx:111:23
               row.newSinceReviewed = stamp
                 ? surfaced.filter((p) => p.detail.first_seen && p.detail.first_seen > stamp).length
                 : surfaced.length;
-            } finally {
-              // Caseload scans unwrap each patient's data key in turn. It is
-              // needed only for this one decrypt; retain no raw key bytes
-              // after either a successful scan or a decrypt failure.
-              dataKey?.fill(0);
-            }
+            } finally {}
           }
           rows[patient.user_id] = row;

[Survived] OptionalChaining
src/views/PatientsView.tsx:115:15
               // Caseload scans unwrap each patient's data key in turn. It is
               // needed only for this one decrypt; retain no raw key bytes
               // after either a successful scan or a decrypt failure.
-              dataKey?.fill(0);
+              dataKey.fill(0);
             }
           }

[NoCoverage] BlockStatement
src/views/PatientsView.tsx:119:17
             }
           }
           rows[patient.user_id] = row;
-        } catch {
-          rows[patient.user_id] = {
-            userId: patient.user_id, patterns: -1, sensitive: false,
-            newSinceReviewed: -1, lastReviewed: null,
-          }; // -1 = could not scan (revoked mid-scan, dead key): honest blank
-        }
+        } catch {}
       }
       setScan(rows);

[NoCoverage] BooleanLiteral
src/views/PatientsView.tsx:121:63
           rows[patient.user_id] = row;
         } catch {
           rows[patient.user_id] = {
-            userId: patient.user_id, patterns: -1, sensitive: false,
+            userId: patient.user_id, patterns: -1, sensitive: true,
             newSinceReviewed: -1, lastReviewed: null,
           }; // -1 = could not scan (revoked mid-scan, dead key): honest blank

[NoCoverage] UnaryOperator
src/views/PatientsView.tsx:121:48
           rows[patient.user_id] = row;
         } catch {
           rows[patient.user_id] = {
-            userId: patient.user_id, patterns: -1, sensitive: false,
+            userId: patient.user_id, patterns: +1, sensitive: false,
             newSinceReviewed: -1, lastReviewed: null,
           }; // -1 = could not scan (revoked mid-scan, dead key): honest blank

[NoCoverage] UnaryOperator
src/views/PatientsView.tsx:122:31
         } catch {
           rows[patient.user_id] = {
             userId: patient.user_id, patterns: -1, sensitive: false,
-            newSinceReviewed: -1, lastReviewed: null,
+            newSinceReviewed: +1, lastReviewed: null,
           }; // -1 = could not scan (revoked mid-scan, dead key): honest blank
         }

[Survived] CallExpression
src/views/PatientsView.tsx:126:7
           }; // -1 = could not scan (revoked mid-scan, dead key): honest blank
         }
       }
-      setScan(rows);
+      ;
     } finally {
       setScanning(false);

[Survived] BlockStatement
src/views/PatientsView.tsx:127:15
         }
       }
       setScan(rows);
-    } finally {
-      setScanning(false);
-    }
+    } finally {}
   };
 

[Survived] BooleanLiteral
src/views/PatientsView.tsx:128:19
       }
       setScan(rows);
     } finally {
-      setScanning(false);
+      setScanning(true);
     }
   };

[Survived] ArrowFunction
src/views/PatientsView.tsx:132:34
     }
   };
 
-  const active = patients.filter((p) => p.status === "active");
+  const active = patients.filter(() => undefined);
   const stopped = patients.filter((p) => p.status !== "active");
 

[Survived] MethodExpression
src/views/PatientsView.tsx:132:18
     }
   };
 
-  const active = patients.filter((p) => p.status === "active");
+  const active = patients;
   const stopped = patients.filter((p) => p.status !== "active");
 

[Survived] ConditionalExpression
src/views/PatientsView.tsx:133:42
   };
 
   const active = patients.filter((p) => p.status === "active");
-  const stopped = patients.filter((p) => p.status !== "active");
+  const stopped = patients.filter((p) => true);
 
   return (

[Survived] ConditionalExpression
src/views/PatientsView.tsx:133:42
   };
 
   const active = patients.filter((p) => p.status === "active");
-  const stopped = patients.filter((p) => p.status !== "active");
+  const stopped = patients.filter((p) => false);
 
   return (

[Survived] StringLiteral
src/views/PatientsView.tsx:136:122
   const stopped = patients.filter((p) => p.status !== "active");
 
   return (
-    <main style={{ backgroundColor: theme.bg, minHeight: "100vh", color: theme.body, padding: 24, maxWidth: 860, margin: "0 auto" }}>
+    <main style={{ backgroundColor: theme.bg, minHeight: "100vh", color: theme.body, padding: 24, maxWidth: 860, margin: "" }}>
       <header style={{ display: "flex", justifyContent: "space-between", alignItems: "center", marginBottom: 18 }}>
         <h1 style={{ color: theme.text, fontSize: 20, margin: 0 }}>Patients — {props.displayName}</h1>

[Survived] StringLiteral
src/views/PatientsView.tsx:137:86
 
   return (
     <main style={{ backgroundColor: theme.bg, minHeight: "100vh", color: theme.body, padding: 24, maxWidth: 860, margin: "0 auto" }}>
-      <header style={{ display: "flex", justifyContent: "space-between", alignItems: "center", marginBottom: 18 }}>
+      <header style={{ display: "flex", justifyContent: "space-between", alignItems: "", marginBottom: 18 }}>
         <h1 style={{ color: theme.text, fontSize: 20, margin: 0 }}>Patients — {props.displayName}</h1>
         <Button label="Sign out" small onPress={props.onSignOut} />

[Survived] ObjectLiteral
src/views/PatientsView.tsx:138:20
   return (
     <main style={{ backgroundColor: theme.bg, minHeight: "100vh", color: theme.body, padding: 24, maxWidth: 860, margin: "0 auto" }}>
       <header style={{ display: "flex", justifyContent: "space-between", alignItems: "center", marginBottom: 18 }}>
-        <h1 style={{ color: theme.text, fontSize: 20, margin: 0 }}>Patients — {props.displayName}</h1>
+        <h1 style={{}}>Patients — {props.displayName}</h1>
         <Button label="Sign out" small onPress={props.onSignOut} />
       </header>

[Survived] ConditionalExpression
src/views/PatientsView.tsx:147:10
           Generate a pairing code and read it to your patient. They enter it in their app, see your
           name, and confirm with their password. The code works once and expires in 15 minutes.
         </Note>
-        {pairingCode && (
-          <p data-testid="pairing-code" style={{ margin: 0, color: theme.text, fontSize: 28, letterSpacing: 6, fontWeight: 700 }}>
-            {pairingCode}
-          </p>
-        )}
+        {true}
         {fingerprint && (
           <p data-testid="key-fingerprint" style={{ margin: "2px 0 0", color: theme.text, fontSize: 15, letterSpacing: 2, fontWeight: 600 }}>

[Survived] ConditionalExpression
src/views/PatientsView.tsx:147:10
           Generate a pairing code and read it to your patient. They enter it in their app, see your
           name, and confirm with their password. The code works once and expires in 15 minutes.
         </Note>
-        {pairingCode && (
-          <p data-testid="pairing-code" style={{ margin: 0, color: theme.text, fontSize: 28, letterSpacing: 6, fontWeight: 700 }}>
-            {pairingCode}
-          </p>
-        )}
+        {false}
         {fingerprint && (
           <p data-testid="key-fingerprint" style={{ margin: "2px 0 0", color: theme.text, fontSize: 15, letterSpacing: 2, fontWeight: 600 }}>

[Survived] ObjectLiteral
src/views/PatientsView.tsx:148:48
           name, and confirm with their password. The code works once and expires in 15 minutes.
         </Note>
         {pairingCode && (
-          <p data-testid="pairing-code" style={{ margin: 0, color: theme.text, fontSize: 28, letterSpacing: 6, fontWeight: 700 }}>
+          <p data-testid="pairing-code" style={{}}>
             {pairingCode}
           </p>

[Survived] ConditionalExpression
src/views/PatientsView.tsx:152:10
             {pairingCode}
           </p>
         )}
-        {fingerprint && (
-          <p data-testid="key-fingerprint" style={{ margin: "2px 0 0", color: theme.text, fontSize: 15, letterSpacing: 2, fontWeight: 600 }}>
-            {fingerprint}
-          </p>
-        )}
+        {false}
         {fingerprint && (
           <Note>Your key fingerprint — ask your patient to read theirs back after they look you up; a mismatch means a key was substituted in transit.</Note>

[Survived] LogicalOperator
src/views/PatientsView.tsx:152:10
             {pairingCode}
           </p>
         )}
-        {fingerprint && (
-          <p data-testid="key-fingerprint" style={{ margin: "2px 0 0", color: theme.text, fontSize: 15, letterSpacing: 2, fontWeight: 600 }}>
-            {fingerprint}
-          </p>
-        )}
+        {fingerprint || <p data-testid="key-fingerprint" style={{
+  margin: "2px 0 0",
+  color: theme.text,
+  fontSize: 15,
+  letterSpacing: 2,
+  fontWeight: 600
+}}>
+            {fingerprint}
+          </p>}
         {fingerprint && (
           <Note>Your key fingerprint — ask your patient to read theirs back after they look you up; a mismatch means a key was substituted in transit.</Note>

[Survived] ObjectLiteral
src/views/PatientsView.tsx:153:51
           </p>
         )}
         {fingerprint && (
-          <p data-testid="key-fingerprint" style={{ margin: "2px 0 0", color: theme.text, fontSize: 15, letterSpacing: 2, fontWeight: 600 }}>
+          <p data-testid="key-fingerprint" style={{}}>
             {fingerprint}
           </p>

[Survived] ConditionalExpression
src/views/PatientsView.tsx:157:10
             {fingerprint}
           </p>
         )}
-        {fingerprint && (
-          <Note>Your key fingerprint — ask your patient to read theirs back after they look you up; a mismatch means a key was substituted in transit.</Note>
-        )}
+        {true}
         <Button label={busy ? "Generating…" : "Generate pairing code"} onPress={newCode} disabled={busy} />
       </Card>

[Survived] ConditionalExpression
src/views/PatientsView.tsx:157:10
             {fingerprint}
           </p>
         )}
-        {fingerprint && (
-          <Note>Your key fingerprint — ask your patient to read theirs back after they look you up; a mismatch means a key was substituted in transit.</Note>
-        )}
+        {false}
         <Button label={busy ? "Generating…" : "Generate pairing code"} onPress={newCode} disabled={busy} />
       </Card>

[Survived] StringLiteral
src/views/PatientsView.tsx:160:47
         {fingerprint && (
           <Note>Your key fingerprint — ask your patient to read theirs back after they look you up; a mismatch means a key was substituted in transit.</Note>
         )}
-        <Button label={busy ? "Generating…" : "Generate pairing code"} onPress={newCode} disabled={busy} />
+        <Button label={busy ? "Generating…" : ""} onPress={newCode} disabled={busy} />
       </Card>
 

[Survived] EqualityOperator
src/views/PatientsView.tsx:166:8
       <ErrorBanner message={error} />
 
       <h2 style={{ color: theme.muted, fontSize: 13, letterSpacing: 1, marginTop: 22 }}>ACTIVE</h2>
-      {active.length > 1 && (
+      {active.length <= 1 && (
         <div style={{ marginBottom: 10 }}>
           <Button label={scanning ? "Scanning caseload…" : "Scan caseload for triage"} small onPress={() => void scanCaseload()} disabled={scanning} />

[Survived] LogicalOperator
src/views/PatientsView.tsx:166:8
       <ErrorBanner message={error} />
 
       <h2 style={{ color: theme.muted, fontSize: 13, letterSpacing: 1, marginTop: 22 }}>ACTIVE</h2>
-      {active.length > 1 && (
-        <div style={{ marginBottom: 10 }}>
-          <Button label={scanning ? "Scanning caseload…" : "Scan caseload for triage"} small onPress={() => void scanCaseload()} disabled={scanning} />
-          <span style={{ color: theme.muted, fontSize: 12, marginLeft: 10 }}>
-            Fetches each patient's decrypted pattern counts sequentially — nothing is stored.
-          </span>
-        </div>
-      )}
+      {active.length > 1 || <div style={{
+  marginBottom: 10
+}}>
+          <Button label={scanning ? "Scanning caseload…" : "Scan caseload for triage"} small onPress={() => void scanCaseload()} disabled={scanning} />
+          <span style={{
+    color: theme.muted,
+    fontSize: 12,
+    marginLeft: 10
+  }}>
+            Fetches each patient's decrypted pattern counts sequentially — nothing is stored.
+          </span>
+        </div>}
       {active.length === 0 && <Note>No patients are sharing with you yet.</Note>}
       {active.map((patient) => {

[Survived] ArrowFunction
src/views/PatientsView.tsx:168:103
       <h2 style={{ color: theme.muted, fontSize: 13, letterSpacing: 1, marginTop: 22 }}>ACTIVE</h2>
       {active.length > 1 && (
         <div style={{ marginBottom: 10 }}>
-          <Button label={scanning ? "Scanning caseload…" : "Scan caseload for triage"} small onPress={() => void scanCaseload()} disabled={scanning} />
+          <Button label={scanning ? "Scanning caseload…" : "Scan caseload for triage"} small onPress={() => undefined} disabled={scanning} />
           <span style={{ color: theme.muted, fontSize: 12, marginLeft: 10 }}>
             Fetches each patient's decrypted pattern counts sequentially — nothing is stored.

[Survived] LogicalOperator
src/views/PatientsView.tsx:174:8
           </span>
         </div>
       )}
-      {active.length === 0 && <Note>No patients are sharing with you yet.</Note>}
+      {active.length === 0 || <Note>No patients are sharing with you yet.</Note>}
       {active.map((patient) => {
         const row = scan?.[patient.user_id];

[Survived] ConditionalExpression
src/views/PatientsView.tsx:174:8
           </span>
         </div>
       )}
-      {active.length === 0 && <Note>No patients are sharing with you yet.</Note>}
+      {true}
       {active.map((patient) => {
         const row = scan?.[patient.user_id];
