[Survived] BlockStatement
src/views/PatientsView.tsx:175:32
         </div>
       )}
       {active.length === 0 && <Note>No patients are sharing with you yet.</Note>}
-      {active.map((patient) => {
-        const row = scan?.[patient.user_id];
-        return (
-        <Card key={patient.user_id}>
-          <div style={{ display: "flex", justifyContent: "space-between", alignItems: "center", gap: 12 }}>
-            <div>
-              <strong style={{ color: theme.text, fontSize: 15 }}>{patient.username}</strong>
-              <Note>
-                sharing since {dayOf(patient.granted_at)}
-                {row && row.patterns >= 0 && ` · ${row.patterns} pattern${row.patterns === 1 ? "" : "s"}`}
-                {row && row.newSinceReviewed > 0 && ` · ${row.newSinceReviewed} new`}
-                {row && row.lastReviewed && ` · reviewed ${row.lastReviewed}`}
-              </Note>
-              {row?.sensitive && (
-                <Note tone="warn">a sensitive card is present — review ordering puts it first</Note>
-              )}
-            </div>
-            <Button label="Open patterns" onPress={() => props.onOpen(patient)} />
-          </div>
-        </Card>
-        );
-      })}
+      {active.map((patient) => {})}
 
       {stopped.length > 0 && (

[Survived] OptionalChaining
src/views/PatientsView.tsx:176:21
       )}
       {active.length === 0 && <Note>No patients are sharing with you yet.</Note>}
       {active.map((patient) => {
-        const row = scan?.[patient.user_id];
+        const row = scan[patient.user_id];
         return (
         <Card key={patient.user_id}>

[Survived] ConditionalExpression
src/views/PatientsView.tsx:184:75
               <strong style={{ color: theme.text, fontSize: 15 }}>{patient.username}</strong>
               <Note>
                 sharing since {dayOf(patient.granted_at)}
-                {row && row.patterns >= 0 && ` · ${row.patterns} pattern${row.patterns === 1 ? "" : "s"}`}
+                {row && row.patterns >= 0 && ` · ${row.patterns} pattern${true ? "" : "s"}`}
                 {row && row.newSinceReviewed > 0 && ` · ${row.newSinceReviewed} new`}
                 {row && row.lastReviewed && ` · reviewed ${row.lastReviewed}`}

[Survived] ConditionalExpression
src/views/PatientsView.tsx:184:18
               <strong style={{ color: theme.text, fontSize: 15 }}>{patient.username}</strong>
               <Note>
                 sharing since {dayOf(patient.granted_at)}
-                {row && row.patterns >= 0 && ` · ${row.patterns} pattern${row.patterns === 1 ? "" : "s"}`}
+                {false}
                 {row && row.newSinceReviewed > 0 && ` · ${row.newSinceReviewed} new`}
                 {row && row.lastReviewed && ` · reviewed ${row.lastReviewed}`}

[Survived] ConditionalExpression
src/views/PatientsView.tsx:185:25
               <Note>
                 sharing since {dayOf(patient.granted_at)}
                 {row && row.patterns >= 0 && ` · ${row.patterns} pattern${row.patterns === 1 ? "" : "s"}`}
-                {row && row.newSinceReviewed > 0 && ` · ${row.newSinceReviewed} new`}
+                {row && true && ` · ${row.newSinceReviewed} new`}
                 {row && row.lastReviewed && ` · reviewed ${row.lastReviewed}`}
               </Note>

[Survived] EqualityOperator
src/views/PatientsView.tsx:185:25
               <Note>
                 sharing since {dayOf(patient.granted_at)}
                 {row && row.patterns >= 0 && ` · ${row.patterns} pattern${row.patterns === 1 ? "" : "s"}`}
-                {row && row.newSinceReviewed > 0 && ` · ${row.newSinceReviewed} new`}
+                {row && row.newSinceReviewed >= 0 && ` · ${row.newSinceReviewed} new`}
                 {row && row.lastReviewed && ` · reviewed ${row.lastReviewed}`}
               </Note>

[Survived] ConditionalExpression
src/views/PatientsView.tsx:186:18
                 sharing since {dayOf(patient.granted_at)}
                 {row && row.patterns >= 0 && ` · ${row.patterns} pattern${row.patterns === 1 ? "" : "s"}`}
                 {row && row.newSinceReviewed > 0 && ` · ${row.newSinceReviewed} new`}
-                {row && row.lastReviewed && ` · reviewed ${row.lastReviewed}`}
+                {true}
               </Note>
               {row?.sensitive && (

[Survived] ConditionalExpression
src/views/PatientsView.tsx:186:18
                 sharing since {dayOf(patient.granted_at)}
                 {row && row.patterns >= 0 && ` · ${row.patterns} pattern${row.patterns === 1 ? "" : "s"}`}
                 {row && row.newSinceReviewed > 0 && ` · ${row.newSinceReviewed} new`}
-                {row && row.lastReviewed && ` · reviewed ${row.lastReviewed}`}
+                {true && ` · reviewed ${row.lastReviewed}`}
               </Note>
               {row?.sensitive && (

[Survived] ConditionalExpression
src/views/PatientsView.tsx:188:16
                 {row && row.newSinceReviewed > 0 && ` · ${row.newSinceReviewed} new`}
                 {row && row.lastReviewed && ` · reviewed ${row.lastReviewed}`}
               </Note>
-              {row?.sensitive && (
-                <Note tone="warn">a sensitive card is present — review ordering puts it first</Note>
-              )}
+              {true}
             </div>
             <Button label="Open patterns" onPress={() => props.onOpen(patient)} />

[Survived] LogicalOperator
src/views/PatientsView.tsx:188:16
                 {row && row.newSinceReviewed > 0 && ` · ${row.newSinceReviewed} new`}
                 {row && row.lastReviewed && ` · reviewed ${row.lastReviewed}`}
               </Note>
-              {row?.sensitive && (
-                <Note tone="warn">a sensitive card is present — review ordering puts it first</Note>
-              )}
+              {row?.sensitive || <Note tone="warn">a sensitive card is present — review ordering puts it first</Note>}
             </div>
             <Button label="Open patterns" onPress={() => props.onOpen(patient)} />

[Survived] ArrowFunction
src/views/PatientsView.tsx:192:52
                 <Note tone="warn">a sensitive card is present — review ordering puts it first</Note>
               )}
             </div>
-            <Button label="Open patterns" onPress={() => props.onOpen(patient)} />
+            <Button label="Open patterns" onPress={() => undefined} />
           </div>
         </Card>

[Survived] EqualityOperator
src/views/PatientsView.tsx:198:8
         );
       })}
 
-      {stopped.length > 0 && (
+      {stopped.length <= 0 && (
         <>
           <h2 style={{ color: theme.muted, fontSize: 13, letterSpacing: 1, marginTop: 22 }}>STOPPED SHARING</h2>

[Survived] ConditionalExpression
src/views/PatientsView.tsx:198:8
         );
       })}
 
-      {stopped.length > 0 && (
-        <>
-          <h2 style={{ color: theme.muted, fontSize: 13, letterSpacing: 1, marginTop: 22 }}>STOPPED SHARING</h2>
-          {stopped.map((patient) => (
-            <Card key={patient.user_id} deep>
-              <strong style={{ color: theme.text, fontSize: 14 }}>{patient.username}</strong>
-              <Note>
-                access ended {patient.revoked_at ? dayOf(patient.revoked_at) : "recently"} — their
-                entries and patterns are no longer reachable. Your notes about this patient stay.
-              </Note>
-            </Card>
-          ))}
-        </>
-      )}
+      {true}
     </main>
   );

[Survived] ArrowFunction
src/views/PatientsView.tsx:201:24
       {stopped.length > 0 && (
         <>
           <h2 style={{ color: theme.muted, fontSize: 13, letterSpacing: 1, marginTop: 22 }}>STOPPED SHARING</h2>
-          {stopped.map((patient) => (
-            <Card key={patient.user_id} deep>
-              <strong style={{ color: theme.text, fontSize: 14 }}>{patient.username}</strong>
-              <Note>
-                access ended {patient.revoked_at ? dayOf(patient.revoked_at) : "recently"} — their
-                entries and patterns are no longer reachable. Your notes about this patient stay.
-              </Note>
-            </Card>
-          ))}
+          {stopped.map(() => undefined)}
         </>
       )}
