[Survived] BlockStatement
src/aad.ts:17:46
  * cases; if you change anything here, the vector tests fail loudly.
  */
 
-function toEnsureAscii(text: string): string {
-  let out = "";
-  for (let i = 0; i < text.length; i++) {
-    const code = text.charCodeAt(i);
-    out += code >= 0x7f ? "\\u" + code.toString(16).padStart(4, "0") : text[i]!;
-  }
-  return out;
-}
+function toEnsureAscii(text: string): string {}
 
 export function buildAad(...parts: string[]): Uint8Array<ArrayBuffer> {

[Survived] UpdateOperator
src/aad.ts:19:36
 
 function toEnsureAscii(text: string): string {
   let out = "";
-  for (let i = 0; i < text.length; i++) {
+  for (let i = 0; i < text.length; i--) {
     const code = text.charCodeAt(i);
     out += code >= 0x7f ? "\\u" + code.toString(16).padStart(4, "0") : text[i]!;

[Survived] EqualityOperator
src/aad.ts:19:19
 
 function toEnsureAscii(text: string): string {
   let out = "";
-  for (let i = 0; i < text.length; i++) {
+  for (let i = 0; i >= text.length; i++) {
     const code = text.charCodeAt(i);
     out += code >= 0x7f ? "\\u" + code.toString(16).padStart(4, "0") : text[i]!;

[Survived] EqualityOperator
src/aad.ts:21:12
   let out = "";
   for (let i = 0; i < text.length; i++) {
     const code = text.charCodeAt(i);
-    out += code >= 0x7f ? "\\u" + code.toString(16).padStart(4, "0") : text[i]!;
+    out += code > 0x7f ? "\\u" + code.toString(16).padStart(4, "0") : text[i]!;
   }
   return out;

[Survived] EqualityOperator
src/aad.ts:21:12
   let out = "";
   for (let i = 0; i < text.length; i++) {
     const code = text.charCodeAt(i);
-    out += code >= 0x7f ? "\\u" + code.toString(16).padStart(4, "0") : text[i]!;
+    out += code < 0x7f ? "\\u" + code.toString(16).padStart(4, "0") : text[i]!;
   }
   return out;

[Survived] BlockStatement
src/aad.ts:26:71
   return out;
 }
 
-export function buildAad(...parts: string[]): Uint8Array<ArrayBuffer> {
-  const arrayJson = JSON.stringify(parts);
-  // The JSON structure itself is pure ASCII after this pass; only string
-  // contents could contain non-ASCII, and JSON.stringify escapes structural
-  // characters itself — escaping the WHOLE serialization is safe.
-  // (TextEncoder's result is always a fresh ArrayBuffer; the annotation
-  // exists because the lib types it as ArrayBufferLike.)
-  return new TextEncoder().encode(toEnsureAscii(arrayJson)) as Uint8Array<ArrayBuffer>;
-}
+export function buildAad(...parts: string[]): Uint8Array<ArrayBuffer> {}
 
