[Survived] StringLiteral
src/ui.tsx:8:7
 import type { ReactNode } from "react";
 
 export const theme = {
-  bg: "#0d1117",
+  bg: "",
   card: "#161b26",
   cardDeep: "#10141d",

[Survived] StringLiteral
src/ui.tsx:10:13
 export const theme = {
   bg: "#0d1117",
   card: "#161b26",
-  cardDeep: "#10141d",
+  cardDeep: "",
   text: "#e7ecf5",
   body: "#c3ccdb",

[Survived] StringLiteral
src/ui.tsx:13:10
   cardDeep: "#10141d",
   text: "#e7ecf5",
   body: "#c3ccdb",
-  muted: "#7d8899",
+  muted: "",
   accent: "#4f8cff",
   accentBright: "#6ea0ff",

[Survived] StringLiteral
src/ui.tsx:15:17
   body: "#c3ccdb",
   muted: "#7d8899",
   accent: "#4f8cff",
-  accentBright: "#6ea0ff",
+  accentBright: "",
   danger: "#e0604f",
   ok: "#4fae7c",

[Survived] StringLiteral
src/ui.tsx:16:11
   muted: "#7d8899",
   accent: "#4f8cff",
   accentBright: "#6ea0ff",
-  danger: "#e0604f",
+  danger: "",
   ok: "#4fae7c",
   border: "#232a38",

[Survived] StringLiteral
src/ui.tsx:18:11
   accentBright: "#6ea0ff",
   danger: "#e0604f",
   ok: "#4fae7c",
-  border: "#232a38",
+  border: "",
   radius: 10,
 };

[Survived] BlockStatement
src/ui.tsx:28:23
   disabled?: boolean;
   danger?: boolean;
   small?: boolean;
-}): React.JSX.Element {
-  return (
-    <button
-      type="button"
-      onClick={props.onPress}
-      disabled={props.disabled === true}
-      style={{
-        backgroundColor: props.danger ? theme.danger : theme.accent,
-        color: "#fff",
-        border: "none",
-        borderRadius: theme.radius,
-        padding: props.small ? "6px 12px" : "10px 16px",
-        fontSize: props.small ? 13 : 15,
-        fontWeight: 600,
-        cursor: props.disabled ? "default" : "pointer",
-        opacity: props.disabled ? 0.5 : 1,
-      }}
-    >
-      {props.label}
-    </button>
-  );
-}
+}): React.JSX.Element {}
 
 export function Card(props: { children: ReactNode; deep?: boolean; title?: string }): React.JSX.Element {

[Survived] ConditionalExpression
src/ui.tsx:33:17
     <button
       type="button"
       onClick={props.onPress}
-      disabled={props.disabled === true}
+      disabled={false}
       style={{
         backgroundColor: props.danger ? theme.danger : theme.accent,

[Survived] ConditionalExpression
src/ui.tsx:33:17
     <button
       type="button"
       onClick={props.onPress}
-      disabled={props.disabled === true}
+      disabled={true}
       style={{
         backgroundColor: props.danger ? theme.danger : theme.accent,

[Survived] StringLiteral
src/ui.tsx:42:34
         padding: props.small ? "6px 12px" : "10px 16px",
         fontSize: props.small ? 13 : 15,
         fontWeight: 600,
-        cursor: props.disabled ? "default" : "pointer",
+        cursor: props.disabled ? "" : "pointer",
         opacity: props.disabled ? 0.5 : 1,
       }}

[Survived] StringLiteral
src/ui.tsx:42:46
         padding: props.small ? "6px 12px" : "10px 16px",
         fontSize: props.small ? 13 : 15,
         fontWeight: 600,
-        cursor: props.disabled ? "default" : "pointer",
+        cursor: props.disabled ? "default" : "",
         opacity: props.disabled ? 0.5 : 1,
       }}

[Survived] BlockStatement
src/ui.tsx:51:105
   );
 }
 
-export function Card(props: { children: ReactNode; deep?: boolean; title?: string }): React.JSX.Element {
-  return (
-    <section
-      style={{
-        backgroundColor: props.deep ? theme.cardDeep : theme.card,
-        borderRadius: theme.radius,
-        border: `1px solid ${theme.border}`,
-        padding: 16,
-        display: "flex",
-        flexDirection: "column",
-        gap: 10,
-      }}
-    >
-      {props.title && (
-        <h3 style={{ margin: 0, color: theme.text, fontSize: 15, fontWeight: 600 }}>{props.title}</h3>
-      )}
-      {props.children}
-    </section>
-  );
-}
+export function Card(props: { children: ReactNode; deep?: boolean; title?: string }): React.JSX.Element {}
 
 export function Field(props: {

[Survived] StringLiteral
src/ui.tsx:59:18
         borderRadius: theme.radius,
         border: `1px solid ${theme.border}`,
         padding: 16,
-        display: "flex",
+        display: "",
         flexDirection: "column",
         gap: 10,

[Survived] StringLiteral
src/ui.tsx:60:24
         border: `1px solid ${theme.border}`,
         padding: 16,
         display: "flex",
-        flexDirection: "column",
+        flexDirection: "",
         gap: 10,
       }}

[Survived] LogicalOperator
src/ui.tsx:64:8
         gap: 10,
       }}
     >
-      {props.title && (
-        <h3 style={{ margin: 0, color: theme.text, fontSize: 15, fontWeight: 600 }}>{props.title}</h3>
-      )}
+      {props.title || <h3 style={{
+  margin: 0,
+  color: theme.text,
+  fontSize: 15,
+  fontWeight: 600
+}}>{props.title}</h3>}
       {props.children}
     </section>

[Survived] ConditionalExpression
src/ui.tsx:64:8
         gap: 10,
       }}
     >
-      {props.title && (
-        <h3 style={{ margin: 0, color: theme.text, fontSize: 15, fontWeight: 600 }}>{props.title}</h3>
-      )}
+      {false}
       {props.children}
     </section>

[Survived] ObjectLiteral
src/ui.tsx:65:20
       }}
     >
       {props.title && (
-        <h3 style={{ margin: 0, color: theme.text, fontSize: 15, fontWeight: 600 }}>{props.title}</h3>
+        <h3 style={{}}>{props.title}</h3>
       )}
       {props.children}

[Survived] BlockStatement
src/ui.tsx:79:23
   type?: string;
   placeholder?: string;
   autoComplete?: string;
-}): React.JSX.Element {
-  return (
-    <label style={{ display: "flex", flexDirection: "column", gap: 4, color: theme.muted, fontSize: 12, fontWeight: 700 }}>
-      {props.label}
-      <input
-        type={props.type ?? "text"}
-        value={props.value}
-        placeholder={props.placeholder}
-        autoComplete={props.autoComplete}
-        onChange={(e) => props.onChange(e.target.value)}
-        style={{
-          backgroundColor: theme.cardDeep,
-          color: theme.text,
-          border: `1px solid ${theme.border}`,
-          borderRadius: theme.radius,
-          padding: "10px 12px",
-          fontSize: 15,
-          fontWeight: 400,
-        }}
-      />
-    </label>
-  );
-}
+}): React.JSX.Element {}
 
 export function Note(props: { children: ReactNode; tone?: "muted" | "ok" | "danger" | "warn" }): React.JSX.Element {

[Survived] StringLiteral
src/ui.tsx:81:53
   autoComplete?: string;
 }): React.JSX.Element {
   return (
-    <label style={{ display: "flex", flexDirection: "column", gap: 4, color: theme.muted, fontSize: 12, fontWeight: 700 }}>
+    <label style={{ display: "flex", flexDirection: "", gap: 4, color: theme.muted, fontSize: 12, fontWeight: 700 }}>
       {props.label}
       <input

[Survived] LogicalOperator
src/ui.tsx:84:15
     <label style={{ display: "flex", flexDirection: "column", gap: 4, color: theme.muted, fontSize: 12, fontWeight: 700 }}>
       {props.label}
       <input
-        type={props.type ?? "text"}
+        type={props.type && "text"}
         value={props.value}
         placeholder={props.placeholder}

[Survived] StringLiteral
src/ui.tsx:84:29
     <label style={{ display: "flex", flexDirection: "column", gap: 4, color: theme.muted, fontSize: 12, fontWeight: 700 }}>
       {props.label}
       <input
-        type={props.type ?? "text"}
+        type={props.type ?? ""}
         value={props.value}
         placeholder={props.placeholder}

[Survived] ArrowFunction
src/ui.tsx:88:19
         value={props.value}
         placeholder={props.placeholder}
         autoComplete={props.autoComplete}
-        onChange={(e) => props.onChange(e.target.value)}
+        onChange={() => undefined}
         style={{
           backgroundColor: theme.cardDeep,

[Survived] BlockStatement
src/ui.tsx:103:116
   );
 }
 
-export function Note(props: { children: ReactNode; tone?: "muted" | "ok" | "danger" | "warn" }): React.JSX.Element {
-  const color =
-    props.tone === "ok" ? theme.ok
-      : props.tone === "danger" ? theme.danger
-        : props.tone === "warn" ? theme.accentBright
-          : theme.muted;
-  return <p style={{ margin: 0, color, fontSize: 13, lineHeight: 1.5 }}>{props.children}</p>;
-}
+export function Note(props: { children: ReactNode; tone?: "muted" | "ok" | "danger" | "warn" }): React.JSX.Element {}
 
 export function ErrorBanner({ message }: { message: string }): React.JSX.Element | null {

[Survived] ConditionalExpression
src/ui.tsx:105:5
 
 export function Note(props: { children: ReactNode; tone?: "muted" | "ok" | "danger" | "warn" }): React.JSX.Element {
   const color =
-    props.tone === "ok" ? theme.ok
+    false ? theme.ok
       : props.tone === "danger" ? theme.danger
         : props.tone === "warn" ? theme.accentBright

[Survived] ConditionalExpression
src/ui.tsx:105:5
 
 export function Note(props: { children: ReactNode; tone?: "muted" | "ok" | "danger" | "warn" }): React.JSX.Element {
   const color =
-    props.tone === "ok" ? theme.ok
+    true ? theme.ok
       : props.tone === "danger" ? theme.danger
         : props.tone === "warn" ? theme.accentBright

[Survived] EqualityOperator
src/ui.tsx:106:9
 export function Note(props: { children: ReactNode; tone?: "muted" | "ok" | "danger" | "warn" }): React.JSX.Element {
   const color =
     props.tone === "ok" ? theme.ok
-      : props.tone === "danger" ? theme.danger
+      : props.tone !== "danger" ? theme.danger
         : props.tone === "warn" ? theme.accentBright
           : theme.muted;

[Survived] ConditionalExpression
src/ui.tsx:106:9
 export function Note(props: { children: ReactNode; tone?: "muted" | "ok" | "danger" | "warn" }): React.JSX.Element {
   const color =
     props.tone === "ok" ? theme.ok
-      : props.tone === "danger" ? theme.danger
+      : true ? theme.danger
         : props.tone === "warn" ? theme.accentBright
           : theme.muted;

[Survived] ConditionalExpression
src/ui.tsx:107:11
   const color =
     props.tone === "ok" ? theme.ok
       : props.tone === "danger" ? theme.danger
-        : props.tone === "warn" ? theme.accentBright
+        : false ? theme.accentBright
           : theme.muted;
   return <p style={{ margin: 0, color, fontSize: 13, lineHeight: 1.5 }}>{props.children}</p>;

[Survived] EqualityOperator
src/ui.tsx:107:11
   const color =
     props.tone === "ok" ? theme.ok
       : props.tone === "danger" ? theme.danger
-        : props.tone === "warn" ? theme.accentBright
+        : props.tone !== "warn" ? theme.accentBright
           : theme.muted;
   return <p style={{ margin: 0, color, fontSize: 13, lineHeight: 1.5 }}>{props.children}</p>;

[Survived] BlockStatement
src/ui.tsx:112:89
   return <p style={{ margin: 0, color, fontSize: 13, lineHeight: 1.5 }}>{props.children}</p>;
 }
 
-export function ErrorBanner({ message }: { message: string }): React.JSX.Element | null {
-  if (!message) return null;
-  return (
-    <div
-      role="alert"
-      style={{
-        backgroundColor: "#2a1a17",
-        color: "#f0b6ad",
-        border: `1px solid ${theme.danger}`,
-        borderRadius: theme.radius,
-        padding: "10px 14px",
-        fontSize: 14,
-      }}
-    >
-      {message}
-    </div>
-  );
-}
+export function ErrorBanner({ message }: { message: string }): React.JSX.Element | null {}
 

[Survived] BooleanLiteral
src/ui.tsx:113:7
 }
 
 export function ErrorBanner({ message }: { message: string }): React.JSX.Element | null {
-  if (!message) return null;
+  if (message) return null;
   return (
     <div

[Survived] ConditionalExpression
src/ui.tsx:113:7
 }
 
 export function ErrorBanner({ message }: { message: string }): React.JSX.Element | null {
-  if (!message) return null;
+  if (true) return null;
   return (
     <div

[Survived] ObjectLiteral
src/ui.tsx:117:14
   return (
     <div
       role="alert"
-      style={{
-        backgroundColor: "#2a1a17",
-        color: "#f0b6ad",
-        border: `1px solid ${theme.danger}`,
-        borderRadius: theme.radius,
-        padding: "10px 14px",
-        fontSize: 14,
-      }}
+      style={{}}
     >
       {message}

[Survived] StringLiteral
src/ui.tsx:120:17
       style={{
         backgroundColor: "#2a1a17",
         color: "#f0b6ad",
-        border: `1px solid ${theme.danger}`,
+        border: ``,
         borderRadius: theme.radius,
         padding: "10px 14px",
